#ifndef UE4SS_SDK_BP_EnemyCampObject_Shelf07_Stone_HPP
#define UE4SS_SDK_BP_EnemyCampObject_Shelf07_Stone_HPP

class ABP_EnemyCampObject_Shelf07_Stone_C : public APalBuildObject
{
    class UPalEnemyCampObjectSpawnMapObjectComponent* EnemyCampObjectSpawnMapObject;  // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SM_Cabinet01;                                         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SM_Clock_Small;                                       // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SM_BooksSet05;                                        // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* SM_BooksSet01;                                        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* SM_BooksSet02;                                        // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* SM_box_desk;                                          // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* SM_BooksSet04;                                        // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* SM_BooksSet03;                                        // 0x06C8 (size: 0x8)
    class UBoxComponent* CheckOverlapCollision;                                       // 0x06D0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x06D8 (size: 0x8)

}; // Size: 0x6E0

#endif
