#ifndef UE4SS_SDK_BP_MoonQueen_HPP
#define UE4SS_SDK_BP_MoonQueen_HPP

class ABP_MoonQueen_C : public ABP_MonsterBase_C
{
    class UPalFlyMeshHeightCtrlComponent* PalFlyMeshHeightCtrl;                       // 0x0B20 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule12;                       // 0x0B28 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule11;                       // 0x0B30 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule10;                       // 0x0B38 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule9;                        // 0x0B40 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule8;                        // 0x0B48 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule7;                        // 0x0B50 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule6;                        // 0x0B58 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule5;                        // 0x0B60 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule4;                        // 0x0B68 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule3;                        // 0x0B70 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule2;                        // 0x0B78 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule1;                        // 0x0B80 (size: 0x8)
    class UPalBodyPartsCapsuleComponent* PalBodyPartsCapsule;                         // 0x0B88 (size: 0x8)
    class UPalRideMarkerComponent* PalRideMarker;                                     // 0x0B90 (size: 0x8)

}; // Size: 0xB98

#endif
