#ifndef UE4SS_SDK_BP_NPCCamp_Ninja_02_01_HPP
#define UE4SS_SDK_BP_NPCCamp_Ninja_02_01_HPP

class ABP_NPCCamp_Ninja_02_01_C : public ABP_NPCCampPresetBase_C
{
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent5; // 0x02D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Chair01;                  // 0x02E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Pillar_Wood;              // 0x02E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Roof; // 0x02F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Stone;              // 0x02F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Carpet01;                 // 0x0300 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_wicker_basket;            // 0x0308 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cup_board_04;             // 0x0310 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_towel_rack_big_01;        // 0x0318 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner770_EnemyCamp_Spa_2;                    // 0x0320 (size: 0x8)
    class UNiagaraComponent* FX770_EnemyCamp_Spa_1;                                   // 0x0328 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_PalSpa;        // 0x0330 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_toilet_holder_02;         // 0x0338 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_carpeSM_long;             // 0x0340 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseWritingDesk;      // 0x0348 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_IncenseBurner;            // 0x0350 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_teadish;                  // 0x0358 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_dining_table;             // 0x0360 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_lilies;                   // 0x0368 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_teacup_tea;               // 0x0370 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_teaspoon;                 // 0x0378 (size: 0x8)
    class UNiagaraComponent* FX760_EnemyCamp_Irori_1;                                 // 0x0380 (size: 0x8)
    class UNiagaraComponent* FX759_EnemyCamp_Irori_1;                                 // 0x0388 (size: 0x8)
    class UNiagaraComponent* FX758_EnemyCamp_Irori_1;                                 // 0x0390 (size: 0x8)
    class UNiagaraComponent* FX757_EnemyCamp_Irori_1;                                 // 0x0398 (size: 0x8)
    class UNiagaraComponent* FX756_EnemyCamp_Irori_1;                                 // 0x03A0 (size: 0x8)
    class UNiagaraComponent* FX755_EnemyCamp_Irori_1;                                 // 0x03A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Hearth;                   // 0x03B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Pillar; // 0x03B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseChest;            // 0x03C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FlowerArrangement;        // 0x03C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Bonsai;                   // 0x03D0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light678_EnemyCamp_Andon_1;              // 0x03D8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light677_EnemyCamp_Andon_1;              // 0x03E0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light676_EnemyCamp_Andon_1;              // 0x03E8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light675_EnemyCamp_Andon_1;              // 0x03F0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light674_EnemyCamp_Andon_1;              // 0x03F8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light673_EnemyCamp_Andon_1;              // 0x0400 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light671_EnemyCamp_Andon_1;              // 0x0408 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light670_EnemyCamp_Andon_1;              // 0x0410 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light669_EnemyCamp_Andon_1;              // 0x0418 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light668_EnemyCamp_Andon_1;              // 0x0420 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light667_EnemyCamp_Andon_1;              // 0x0428 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light666_EnemyCamp_Andon_1;              // 0x0430 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light665_EnemyCamp_Andon_1;              // 0x0438 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light664_EnemyCamp_Andon_1;              // 0x0440 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light663_EnemyCamp_Andon_1;              // 0x0448 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light662_EnemyCamp_Andon_1;              // 0x0450 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light661_EnemyCamp_Andon_1;              // 0x0458 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light660_EnemyCamp_Andon_1;              // 0x0460 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light659_EnemyCamp_Andon_1;              // 0x0468 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light658_EnemyCamp_Andon_1;              // 0x0470 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light657_EnemyCamp_Andon_1;              // 0x0478 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light656_EnemyCamp_Andon_1;              // 0x0480 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light655_EnemyCamp_Andon_1;              // 0x0488 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light654_EnemyCamp_Andon_1;              // 0x0490 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light653_EnemyCamp_Andon_1;              // 0x0498 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light652_EnemyCamp_Andon_1;              // 0x04A0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light651_EnemyCamp_Andon_1;              // 0x04A8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light650_EnemyCamp_Andon_1;              // 0x04B0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light649_EnemyCamp_Andon_1;              // 0x04B8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light648_EnemyCamp_Andon_1;              // 0x04C0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light647_EnemyCamp_Andon_1;              // 0x04C8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light646_EnemyCamp_Andon_1;              // 0x04D0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light645_EnemyCamp_Andon_1;              // 0x04D8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light644_EnemyCamp_Andon_1;              // 0x04E0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light643_EnemyCamp_Andon_1;              // 0x04E8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light642_EnemyCamp_Andon_1;              // 0x04F0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light641_EnemyCamp_Andon_1;              // 0x04F8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light640_EnemyCamp_Andon_1;              // 0x0500 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseLantern;          // 0x0508 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_HangingScroll;            // 0x0510 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingScreen;            // 0x0518 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingChair;             // 0x0520 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofB; // 0x0528 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseCushion;          // 0x0530 (size: 0x8)
    class UBoxComponent* VirtualShapeBox596_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0538 (size: 0x8)
    class UBoxComponent* VirtualShapeBox595_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0540 (size: 0x8)
    class UBoxComponent* VirtualShapeBox594_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0548 (size: 0x8)
    class UBoxComponent* VirtualShapeBox593_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0550 (size: 0x8)
    class UBoxComponent* VirtualShapeBox592_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0558 (size: 0x8)
    class UBoxComponent* VirtualShapeBox591_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0560 (size: 0x8)
    class UBoxComponent* VirtualShapeBox590_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0568 (size: 0x8)
    class UBoxComponent* VirtualShapeBox589_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0570 (size: 0x8)
    class UBoxComponent* VirtualShapeBox588_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0578 (size: 0x8)
    class UBoxComponent* VirtualShapeBox587_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0580 (size: 0x8)
    class UBoxComponent* VirtualShapeBox586_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0588 (size: 0x8)
    class UBoxComponent* VirtualShapeBox585_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0590 (size: 0x8)
    class UBoxComponent* VirtualShapeBox584_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0598 (size: 0x8)
    class UBoxComponent* VirtualShapeBox583_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05A0 (size: 0x8)
    class UBoxComponent* VirtualShapeBox582_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05A8 (size: 0x8)
    class UBoxComponent* VirtualShapeBox581_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05B0 (size: 0x8)
    class UBoxComponent* VirtualShapeBox580_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05B8 (size: 0x8)
    class UBoxComponent* VirtualShapeBox579_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05C0 (size: 0x8)
    class UBoxComponent* VirtualShapeBox578_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05C8 (size: 0x8)
    class UBoxComponent* VirtualShapeBox577_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05D0 (size: 0x8)
    class UBoxComponent* VirtualShapeBox576_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05D8 (size: 0x8)
    class UBoxComponent* VirtualShapeBox575_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x05E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallWindow; // 0x05E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Stair; // 0x05F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofC; // 0x05F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallTryangle; // 0x0600 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Floor; // 0x0608 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_toilet_01;                // 0x0610 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_SinkSet;                  // 0x0618 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_PlantSet02;               // 0x0620 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_stool;                    // 0x0628 (size: 0x8)
    class UPointLightComponent* Light140_EnemyCamp_Torch_2;                           // 0x0630 (size: 0x8)
    class UNiagaraComponent* FX140_EnemyCamp_Torch_1;                                 // 0x0638 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_TorchStand;               // 0x0640 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Sofa02;                   // 0x0648 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Pier-Mirror;              // 0x0650 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Bench;                    // 0x0658 (size: 0x8)
    class UNiagaraComponent* FX133_EnemyCamp_BuildableGoddessStatue_1;                // 0x0660 (size: 0x8)
    class UNiagaraComponent* FX132_EnemyCamp_BuildableGoddessStatue_1;                // 0x0668 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_GoddessStatue;            // 0x0670 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_carpeSM_living_room;      // 0x0678 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Roof_Wood;                // 0x0680 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_room_divider;             // 0x0688 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Wood;               // 0x0690 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_doily;                    // 0x0698 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_lilies_vase;              // 0x06A0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner017_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x06A8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner016_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x06B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallA; // 0x06B8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner014_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x06C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_WallA; // 0x06C8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner013_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x06D0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner012_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x06D8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner011_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x06E0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner010_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x06E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_L; // 0x06F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_R; // 0x06F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC; // 0x0700 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner009_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0708 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner008_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0710 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner007_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0718 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorB; // 0x0720 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner006_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0728 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner005_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0730 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner004_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0738 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner003_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0740 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner002_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0748 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner001_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0750 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner000_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0758 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_R; // 0x0760 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_L; // 0x0768 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA; // 0x0770 (size: 0x8)
    class UPalLimitVolumeBoxComponent* PalLimitVolumeBox;                             // 0x0778 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x0780 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent_Goal; // 0x0788 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent4; // 0x0790 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_3F_Main;       // 0x0798 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_2F_Corrider2;  // 0x07A0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_2F_Main;       // 0x07A8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_2F_Corrider;   // 0x07B0 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent3; // 0x07B8 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent2; // 0x07C0 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent1; // 0x07C8 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent; // 0x07D0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Main;       // 0x07D8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Tearoom;    // 0x07E0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Bathroom;   // 0x07E8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Restroom;   // 0x07F0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Corrider;   // 0x07F8 (size: 0x8)
    class UPalFoliageRemoveVolumeBoxComponent* PalFoliageRemoveVolumeBox;             // 0x0800 (size: 0x8)
    class USceneComponent* BuildObjectRoot;                                           // 0x0808 (size: 0x8)

}; // Size: 0x810

#endif
