#ifndef UE4SS_SDK_BP_NPCCamp_Ninja_02_02_HPP
#define UE4SS_SDK_BP_NPCCamp_Ninja_02_02_HPP

class ABP_NPCCamp_Ninja_02_02_C : public ABP_NPCCampPresetBase_C
{
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallA; // 0x02D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_SausageSet;               // 0x02E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BlackBreadSet;            // 0x02E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_HamSet;                   // 0x02F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_CheeseSet;                // 0x02F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_CakeSet;                  // 0x0300 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Rectangular_Table_onProp; // 0x0308 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Rectangular_Table;        // 0x0310 (size: 0x8)
    class UNiagaraComponent* FX682_EnemyCamp_HugeKitchen_1;                           // 0x0318 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_KitchenMedievalLarge;     // 0x0320 (size: 0x8)
    class UPointLightComponent* Light681_EnemyCamp_CandleStand_1;                     // 0x0328 (size: 0x8)
    class UPointLightComponent* Light680_EnemyCamp_CandleStand_1;                     // 0x0330 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_pal_b00_building_Lordenfel_Candelabra_02; // 0x0338 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Stump;                    // 0x0340 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_toilet_holder_02;         // 0x0348 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Rustic_CoffeeTable;       // 0x0350 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Continental_Armchair_SP;  // 0x0358 (size: 0x8)
    class UNiagaraComponent* FX674_EnemyCamp_Irori_1;                                 // 0x0360 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Hearth;                   // 0x0368 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_IncenseBurner;            // 0x0370 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BookShelf04;              // 0x0378 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BookShelfPart03;          // 0x0380 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BooksSet01;               // 0x0388 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Commode;                  // 0x0390 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_lilies_vase;              // 0x0398 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_GoddessStatue_low;        // 0x03A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BooksSet04;               // 0x03A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_doily;                    // 0x03B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_frame_01;                 // 0x03B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Night_lamp_1;             // 0x03C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_frame_02;                 // 0x03C8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light666_EnemyCamp_Andon_1;              // 0x03D0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light665_EnemyCamp_Andon_1;              // 0x03D8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light664_EnemyCamp_Andon_1;              // 0x03E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseLantern;          // 0x03E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingChair;             // 0x03F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseCushion;          // 0x03F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FlowerArrangement;        // 0x0400 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_pal_b00_Megascans_Japanese_Gravestone_ucnocfmfa_lod3; // 0x0408 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Bonsai;                   // 0x0410 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_HangingScroll;            // 0x0418 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard_door_01; // 0x0420 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard_door_02; // 0x0428 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard;         // 0x0430 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner645_EnemyCamp_Shelf07_Stone_8;          // 0x0438 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner644_EnemyCamp_Shelf07_Stone_8;          // 0x0440 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Cabinet01;     // 0x0448 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Clock_Small;   // 0x0450 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet01;    // 0x0458 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet02;    // 0x0460 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_box_desk;      // 0x0468 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet04;    // 0x0470 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet03;    // 0x0478 (size: 0x8)
    class UBP_WorkVisualFX_C* FX643_EnemyCamp_CompositeDesk_1;                        // 0x0480 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_DraftingDesk;             // 0x0488 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_PalSphereFactoryMedieval; // 0x0490 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_PlantSet02;               // 0x0498 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_PalSkillUnlockWorkbench;     // 0x04A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_stool;                    // 0x04A8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner622_EnemyCamp_MedicineFacility_01_1;    // 0x04B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_MedicineFacilityMedieval; // 0x04B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_RepairTable;              // 0x04C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Chair_Dining_Wood;        // 0x04C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BlastFurnacePrimitive;    // 0x04D0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_WorkBenchMedieval;        // 0x04D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Box1;                     // 0x04E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_ChestCopper;              // 0x04E8 (size: 0x8)
    class UNiagaraComponent* FX612_EnemyCamp_Shishiodoshi_1;                          // 0x04F0 (size: 0x8)
    class UPalMapObjectSkeletalMeshComponent* SK612_EnemyCamp_Shishiodoshi_0;         // 0x04F8 (size: 0x8)
    class UNiagaraComponent* FX611_EnemyCamp_Shishiodoshi_1;                          // 0x0500 (size: 0x8)
    class UPalMapObjectSkeletalMeshComponent* SK611_EnemyCamp_Shishiodoshi_0;         // 0x0508 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Froggy_Chair;             // 0x0510 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Barricade_02;             // 0x0518 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cup_board_04;             // 0x0520 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FridgeSmall;              // 0x0528 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_SideTable;                // 0x0530 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_barrel2;                  // 0x0538 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cup_board_props;          // 0x0540 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cup_board_01;             // 0x0548 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner586_EnemyCamp_Clock01_Stone_1;          // 0x0550 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner585_EnemyCamp_Clock01_Stone_1;          // 0x0558 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner584_EnemyCamp_Clock01_Stone_1;          // 0x0560 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Floor_Clock_comb; // 0x0568 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_AVI_Stool_02;             // 0x0570 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_support_cask;             // 0x0578 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseChest;            // 0x0580 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_room_divider;             // 0x0588 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_ChestIron;                // 0x0590 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cask_01;                  // 0x0598 (size: 0x8)
    class UPointLightComponent* Light566_EnemyCamp_FireStand_2;                       // 0x05A0 (size: 0x8)
    class UNiagaraComponent* FX566_EnemyCamp_FireStand_1;                             // 0x05A8 (size: 0x8)
    class UPointLightComponent* Light565_EnemyCamp_FireStand_2;                       // 0x05B0 (size: 0x8)
    class UNiagaraComponent* FX565_EnemyCamp_FireStand_1;                             // 0x05B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_pal_b00_building_Lordenfel_Brazier_02; // 0x05C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_ChestWood;                // 0x05C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Roof_Wood;                // 0x05D0 (size: 0x8)
    class UNiagaraComponent* FX558_EnemyCamp_CookingStove_1;                          // 0x05D8 (size: 0x8)
    class UNiagaraComponent* FX557_EnemyCamp_CookingStove_1;                          // 0x05E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_KitchenMedieval;          // 0x05E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Pillar_Wood;              // 0x05F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_towel_rack_big_01;        // 0x05F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_wicker_basket;            // 0x0600 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseStoneLantern;     // 0x0608 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_GuardianDogStatue;        // 0x0610 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_PlantSet01;               // 0x0618 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Roof_Stone;               // 0x0620 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Pillar_Stone;             // 0x0628 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Bench;                    // 0x0630 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Flowerbed;                // 0x0638 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_DamagedScarecrow;         // 0x0640 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_carpeSM_long;             // 0x0648 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_barrel1;                  // 0x0650 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BlastFurnaceMedieval;     // 0x0658 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner449_EnemyCamp_Spa_2;                    // 0x0660 (size: 0x8)
    class UNiagaraComponent* FX449_EnemyCamp_Spa_1;                                   // 0x0668 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_PalSpa;        // 0x0670 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_toilet_01;                // 0x0678 (size: 0x8)
    class UBoxComponent* VirtualShapeBox447_EnemyCamp_Wood_WindowWall_1;              // 0x0680 (size: 0x8)
    class UBoxComponent* VirtualShapeBox446_EnemyCamp_Wood_WindowWall_1;              // 0x0688 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_WallWindow_Wood;          // 0x0690 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_WallTryangle_Wood;        // 0x0698 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Floor; // 0x06A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wall_Wood;                // 0x06A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Stair_Wood;               // 0x06B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseWritingDesk;      // 0x06B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Fence_Stone;              // 0x06C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Roof; // 0x06C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Stair_Stone;              // 0x06D0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_books_01;                 // 0x06D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_bookcase_low;             // 0x06E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wooden_Box_01;            // 0x06E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wall_Stone;               // 0x06F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Stone;              // 0x06F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_wall_shelf_03;            // 0x0700 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FridgeLarge;              // 0x0708 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofB; // 0x0710 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Fence; // 0x0718 (size: 0x8)
    class UBoxComponent* VirtualShapeBox215_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0720 (size: 0x8)
    class UBoxComponent* VirtualShapeBox214_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0728 (size: 0x8)
    class UBoxComponent* VirtualShapeBox213_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0730 (size: 0x8)
    class UBoxComponent* VirtualShapeBox212_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0738 (size: 0x8)
    class UBoxComponent* VirtualShapeBox211_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0740 (size: 0x8)
    class UBoxComponent* VirtualShapeBox210_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0748 (size: 0x8)
    class UBoxComponent* VirtualShapeBox209_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0750 (size: 0x8)
    class UBoxComponent* VirtualShapeBox208_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0758 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallWindow; // 0x0760 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_high_stool;               // 0x0768 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_MedicineBox;              // 0x0770 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallTryangle; // 0x0778 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Pillar; // 0x0780 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Wood;               // 0x0788 (size: 0x8)
    class UInstancedStaticMeshComponent* ISM052_EnemyCamp_FarmBlockV2_Carrot_1;       // 0x0790 (size: 0x8)
    class UInstancedStaticMeshComponent* ISM051_EnemyCamp_FarmBlockV2_wheet_1;        // 0x0798 (size: 0x8)
    class UInstancedStaticMeshComponent* ISM050_EnemyCamp_FarmBlockV2_Lettuce_1;      // 0x07A0 (size: 0x8)
    class UInstancedStaticMeshComponent* ISM049_EnemyCamp_FarmBlockV2_tomato_1;       // 0x07A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FarmGround;               // 0x07B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Fence_Wood;               // 0x07B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofC; // 0x07C0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner018_EnemyCamp_JapaneseStyle_DoorWall_03_OneSide_3; // 0x07C8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner017_EnemyCamp_Stone_DoorWall_2;         // 0x07D0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Door_Stone;    // 0x07D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Doorbase_Stone; // 0x07E0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner016_EnemyCamp_Wood_Gate_3;              // 0x07E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_Base_Wood; // 0x07F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_DoorLeft_Wood; // 0x07F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_DoorRight_Wood; // 0x0800 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner015_EnemyCamp_Wooden_DoorWall_2;        // 0x0808 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner014_EnemyCamp_Wooden_DoorWall_2;        // 0x0810 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner013_EnemyCamp_Wooden_DoorWall_2;        // 0x0818 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Door_Wood;     // 0x0820 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Doorbase_Wood; // 0x0828 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner012_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0830 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorB; // 0x0838 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner011_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0840 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner010_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0848 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner009_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0850 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner008_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0858 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner007_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0860 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner006_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0868 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner005_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0870 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner004_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0878 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_L; // 0x0880 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_R; // 0x0888 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC; // 0x0890 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner003_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0898 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner002_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x08A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_R; // 0x08A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_L; // 0x08B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA; // 0x08B8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner001_EnemyCamp_Wooden_ladder_1;          // 0x08C0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner000_EnemyCamp_Wooden_ladder_1;          // 0x08C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Ladder_Wood;   // 0x08D0 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent5; // 0x08D8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Roof2; // 0x08E0 (size: 0x8)
    class UPalLimitVolumeBoxComponent* PalLimitVolumeBox;                             // 0x08E8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Roof;  // 0x08F0 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent4; // 0x08F8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_DiningRoom;    // 0x0900 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_BathRoom;      // 0x0908 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_RestRoom;      // 0x0910 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_CageRoom;      // 0x0918 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_TeaRoom;       // 0x0920 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_CraftRoom;     // 0x0928 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Main;  // 0x0930 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent_Goal; // 0x0938 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent3; // 0x0940 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent2; // 0x0948 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent1; // 0x0950 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent; // 0x0958 (size: 0x8)
    class UPalFoliageRemoveVolumeBoxComponent* PalFoliageRemoveVolumeBox;             // 0x0960 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x0968 (size: 0x8)
    class USceneComponent* BuildObjectRoot;                                           // 0x0970 (size: 0x8)

}; // Size: 0x978

#endif
