#ifndef UE4SS_SDK_BP_NPCCamp_Ninja_01_02_HPP
#define UE4SS_SDK_BP_NPCCamp_Ninja_01_02_HPP

class ABP_NPCCamp_Ninja_01_02_C : public ABP_NPCCampPresetBase_C
{
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Stair_Stone;              // 0x02D8 (size: 0x8)
    class UNiagaraComponent* FX181_EnemyCamp_Shishiodoshi_1;                          // 0x02E0 (size: 0x8)
    class UPalMapObjectSkeletalMeshComponent* SK181_EnemyCamp_Shishiodoshi_0;         // 0x02E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Banyan_Hero_Forest_Big_001;  // 0x02F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_IncenseBurner;            // 0x02F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BookShelf04;              // 0x0300 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BookShelfPart03;          // 0x0308 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BooksSet01;               // 0x0310 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_PlantSet02;               // 0x0318 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard_door_01; // 0x0320 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard_door_02; // 0x0328 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_hanging_cupboard;         // 0x0330 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner173_EnemyCamp_Shelf07_Stone_8;          // 0x0338 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Cabinet01;     // 0x0340 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Clock_Small;   // 0x0348 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet01;    // 0x0350 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet02;    // 0x0358 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_box_desk;      // 0x0360 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet04;    // 0x0368 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_BooksSet03;    // 0x0370 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Commode;                  // 0x0378 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_lilies_vase;              // 0x0380 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_GoddessStatue_low;        // 0x0388 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_BooksSet04;               // 0x0390 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_doily;                    // 0x0398 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_frame_01;                 // 0x03A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Night_lamp_1;             // 0x03A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_frame_02;                 // 0x03B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseWritingDesk;      // 0x03B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseCushion;          // 0x03C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_HangingScroll;            // 0x03C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FlowerArrangement;        // 0x03D0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light162_EnemyCamp_Andon_1;              // 0x03D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_cup_board_04;             // 0x03E0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light159_EnemyCamp_Andon_1;              // 0x03E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseLantern;          // 0x03F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingChair;             // 0x03F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseStoneLantern;     // 0x0400 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Fence; // 0x0408 (size: 0x8)
    class UBoxComponent* VirtualShapeBox151_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0410 (size: 0x8)
    class UBoxComponent* VirtualShapeBox149_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0418 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallWindow; // 0x0420 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofC; // 0x0428 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner133_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0430 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_R; // 0x0438 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_L; // 0x0440 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA; // 0x0448 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Pillar; // 0x0450 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_ivy01;                    // 0x0458 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Roof; // 0x0460 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner089_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x0468 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner088_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x0470 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_WallA; // 0x0478 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallTryangle; // 0x0480 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner083_EnemyCamp_Wooden_ladder_1;          // 0x0488 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner076_EnemyCamp_Wooden_ladder_1;          // 0x0490 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Ladder_Wood;   // 0x0498 (size: 0x8)
    class UPalSkeletalMeshComponent* SK071_EnemyCamp_BaseCampBattleDirector_0;        // 0x04A0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Pillar_Wood;              // 0x04A8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofB; // 0x04B0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Roof_Wood;                // 0x04B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Stair; // 0x04C0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner064_EnemyCamp_Wood_Gate_3;              // 0x04C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_Base_Wood; // 0x04D0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_DoorLeft_Wood; // 0x04D8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_SM_Gate_DoorRight_Wood; // 0x04E0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallA; // 0x04E8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Stone;              // 0x04F0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_02_DoorKeeper;    // 0x04F8 (size: 0x8)
    class UPalLimitVolumeBoxComponent* PalLimitVolumeBox;                             // 0x0500 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_02_Inside;        // 0x0508 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_02_Outside;       // 0x0510 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent2; // 0x0518 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent1; // 0x0520 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent; // 0x0528 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent_Goal; // 0x0530 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x0538 (size: 0x8)
    class UPalFoliageRemoveVolumeBoxComponent* PalFoliageRemoveVolumeBox;             // 0x0540 (size: 0x8)
    class USceneComponent* BuildObjectRoot;                                           // 0x0548 (size: 0x8)

}; // Size: 0x550

#endif
