#ifndef UE4SS_SDK_BP_NPCCamp_Ninja_01_01_HPP
#define UE4SS_SDK_BP_NPCCamp_Ninja_01_01_HPP

class ABP_NPCCamp_Ninja_01_01_C : public ABP_NPCCampPresetBase_C
{
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_2F_Corridor;   // 0x02D8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_Right2;     // 0x02E0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_Left1;      // 0x02E8 (size: 0x8)
    class UNiagaraComponent* FX439_EnemyCamp_Irori_1;                                 // 0x02F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Hearth;                   // 0x02F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Bonsai;                   // 0x0300 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FlowerArrangement;        // 0x0308 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingChair;             // 0x0310 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseWritingDesk;      // 0x0318 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofC; // 0x0320 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallTryangle; // 0x0328 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseCushion;          // 0x0330 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallA; // 0x0338 (size: 0x8)
    class UBoxComponent* VirtualShapeBox342_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0340 (size: 0x8)
    class UBoxComponent* VirtualShapeBox341_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0348 (size: 0x8)
    class UBoxComponent* VirtualShapeBox340_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0350 (size: 0x8)
    class UBoxComponent* VirtualShapeBox339_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0358 (size: 0x8)
    class UBoxComponent* VirtualShapeBox338_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0360 (size: 0x8)
    class UBoxComponent* VirtualShapeBox337_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0368 (size: 0x8)
    class UBoxComponent* VirtualShapeBox336_EnemyCamp_JapaneseStyle_WindowWall_1;     // 0x0370 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_WallWindow; // 0x0378 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wall_Wood;                // 0x0380 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_WallTryangle_Wood;        // 0x0388 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Stair; // 0x0390 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light329_EnemyCamp_Andon_1;              // 0x0398 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light328_EnemyCamp_Andon_1;              // 0x03A0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light327_EnemyCamp_Andon_1;              // 0x03A8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light326_EnemyCamp_Andon_1;              // 0x03B0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light325_EnemyCamp_Andon_1;              // 0x03B8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light324_EnemyCamp_Andon_1;              // 0x03C0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light323_EnemyCamp_Andon_1;              // 0x03C8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light322_EnemyCamp_Andon_1;              // 0x03D0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light321_EnemyCamp_Andon_1;              // 0x03D8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light320_EnemyCamp_Andon_1;              // 0x03E0 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light319_EnemyCamp_Andon_1;              // 0x03E8 (size: 0x8)
    class UBP_PalTimerPointLightComponent_C* Light318_EnemyCamp_Andon_1;              // 0x03F0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_JapaneseLantern;          // 0x03F8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_FoldingScreen;            // 0x0400 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wall_Glass;               // 0x0408 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_RoofB; // 0x0410 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Roof_Wood;                // 0x0418 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Roof; // 0x0420 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Wall_Stone;               // 0x0428 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Stair_Stone;              // 0x0430 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_Architecture_JapaneseStyle_Pillar; // 0x0438 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* ISM_SM_Floor_Stone;              // 0x0440 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner041_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0448 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner040_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0450 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner039_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0458 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner038_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0460 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner037_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0468 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner036_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0470 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner035_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0478 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner034_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0480 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner033_EnemyCamp_JapaneseStyle_DoorWall_01_3; // 0x0488 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA; // 0x0490 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner032_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x0498 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner031_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04A0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner030_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04A8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner029_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04B0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner028_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04B8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner027_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04C0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner026_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04C8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner025_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04D0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner024_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04D8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner023_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04E0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner022_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04E8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner021_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x04F0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner020_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x04F8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner019_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0500 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner018_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0508 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner017_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0510 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner016_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0518 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner015_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0520 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner014_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0528 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner013_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0530 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner012_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0538 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner011_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0540 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner010_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0548 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner009_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0550 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner008_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0558 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner007_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0560 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner006_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0568 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner005_EnemyCamp_JapaneseStyle_DoorWall_02_3; // 0x0570 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_L; // 0x0578 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorA_R; // 0x0580 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorB; // 0x0588 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner004_EnemyCamp_JapaneseStyle_wall_01_Destructable_1; // 0x0590 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_WallA; // 0x0598 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner003_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x05A0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner002_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x05A8 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner001_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x05B0 (size: 0x8)
    class UPalMapObjectSpawnComponent* Spawner000_EnemyCamp_JapaneseStyle_DoorWall_03_3; // 0x05B8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_L; // 0x05C0 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC_R; // 0x05C8 (size: 0x8)
    class UHierarchicalInstancedStaticMeshComponent* EditorOnly_ISM_Architecture_JapaneseStyle_DoorC; // 0x05D0 (size: 0x8)
    class UPalLimitVolumeBoxComponent* PalLimitVolumeBox;                             // 0x05D8 (size: 0x8)
    class UChildActorComponent* BP_PalCapturedCage;                                   // 0x05E0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_Left2;      // 0x05E8 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_Right1;     // 0x05F0 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_CorriderA;  // 0x05F8 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent2; // 0x0600 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_2F_C;          // 0x0608 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_2F_B;          // 0x0610 (size: 0x8)
    class UChildActorComponent* BP_SquadNPCSpawner_ForCamp_Ninja_01_01_2F_A;          // 0x0618 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent1; // 0x0620 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent_Goal; // 0x0628 (size: 0x8)
    class UBP_EnemyCampTreasureBoxSpawnerComponent_C* BP_EnemyCampTreasureBoxSpawnerComponent; // 0x0630 (size: 0x8)
    class UPalFoliageRemoveVolumeBoxComponent* PalFoliageRemoveVolumeBox;             // 0x0638 (size: 0x8)
    class USceneComponent* BuildObjectRoot;                                           // 0x0640 (size: 0x8)

}; // Size: 0x648

#endif
