#ifndef UE4SS_SDK_BP_ShrineParts_08_HPP
#define UE4SS_SDK_BP_ShrineParts_08_HPP

class ABP_ShrineParts_08_C : public AActor
{
    class UChildActorComponent* BP_Andon_lamp_04;                                     // 0x0290 (size: 0x8)
    class UChildActorComponent* BP_Andon_lamp_03;                                     // 0x0298 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Base_04;                               // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Base_03;                               // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Body_05;                               // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Body_04;                               // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Body_03;                               // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_pal_b00_shrine_interior_lod;                       // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* Lantern;                                              // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* SM_PaperLanternLong01;                                // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Door_Front;                            // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0300 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0308 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0310 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0318 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Pillar_Front;                          // 0x0328 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Beam02;                                // 0x0330 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Beam01;                                // 0x0338 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0340 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_PillarOrnament01;                      // 0x0348 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0350 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0358 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0360 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0368 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0378 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0380 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0390 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0398 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_RoofOrnament_02;                       // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_RoofOrnament_01;                       // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* F;                                                    // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Body_02;                               // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Body_01;                               // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Engawa_02;                             // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Engawa_01;                             // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Base_02;                               // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Base_01;                               // 0x03F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0400 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Roof_01;                               // 0x0408 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Roof_Front;                            // 0x0410 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Roof_Center;                           // 0x0418 (size: 0x8)
    class UStaticMeshComponent* SM_ShrineParts_Roof_02;                               // 0x0420 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0428 (size: 0x8)

}; // Size: 0x430

#endif
