#ifndef UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Main_HPP
#define UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Main_HPP

class ABP_SquadNPCSpawner_ForCamp_Ninja_02_02_Outside_Main_C : public ABP_SquadNPCSpawner_ForCampBase_C
{
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent7;                   // 0x04F8 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent6;                   // 0x0500 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent5;                   // 0x0508 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent4;                   // 0x0510 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent3;                   // 0x0518 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent2;                   // 0x0520 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent1;                   // 0x0528 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent;                    // 0x0530 (size: 0x8)

}; // Size: 0x538

#endif
