#ifndef UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Main_HPP
#define UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Main_HPP

class ABP_SquadNPCSpawner_ForCamp_Ninja_02_01_1F_Main_C : public ABP_SquadNPCSpawner_ForCampBase_C
{
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_2;          // 0x04F8 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_1;          // 0x0500 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent12;                  // 0x0508 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent11;                  // 0x0510 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent10;                  // 0x0518 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent9;                   // 0x0520 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent8;                   // 0x0528 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent7;                   // 0x0530 (size: 0x8)

}; // Size: 0x538

#endif
