#ifndef UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_CorriderA_HPP
#define UE4SS_SDK_BP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_CorriderA_HPP

class ABP_SquadNPCSpawner_ForCamp_Ninja_01_01_1F_CorriderA_C : public ABP_SquadNPCSpawner_ForCampBase_C
{
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_6;          // 0x04F8 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_5;          // 0x0500 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent2;                   // 0x0508 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_4;          // 0x0510 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_3;          // 0x0518 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent1;                   // 0x0520 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_1;          // 0x0528 (size: 0x8)
    class UBP_NPCPathWalkPointComponent_1_C* BP_NPCPathWalkPointComponent_2;          // 0x0530 (size: 0x8)
    class UBP_NPCSpawnPointComponent_C* BP_NPCSpawnPointComponent;                    // 0x0538 (size: 0x8)

}; // Size: 0x540

#endif
