#ifndef UE4SS_SDK_Pal_HPP
#define UE4SS_SDK_Pal_HPP

#include "Pal_enums.hpp"

struct FActionDynamicParameter
{
    class AActor* ActionTarget;                                                       // 0x0000 (size: 0x8)
    TArray<class AActor*> OtherActionTargets;                                         // 0x0008 (size: 0x10)
    FTransform StartTransform;                                                        // 0x0020 (size: 0x60)
    FVector ActionVelocity;                                                           // 0x0080 (size: 0x18)
    int32 GeneralPurposeIndex;                                                        // 0x0098 (size: 0x4)
    FVector DummyTargetLocation;                                                      // 0x00A0 (size: 0x18)
    FGuid TargetMapObjectInstanceId;                                                  // 0x00B8 (size: 0x10)
    FGuid ActionID;                                                                   // 0x00C8 (size: 0x10)
    bool bIsAdjustTransform;                                                          // 0x00D8 (size: 0x1)
    FPalNetArchive Blackboard;                                                        // 0x00E0 (size: 0x10)
    int32 NetRandSeed;                                                                // 0x00F0 (size: 0x4)
    bool IsReflectedForClient;                                                        // 0x00F4 (size: 0x1)

}; // Size: 0x100

struct FActorArray
{
    TArray<class AActor*> Actors;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBuildingSurfaceMaterialSet
{
    class UMaterialInstance* Highlight;                                               // 0x0000 (size: 0x8)
    class UMaterialInstance* Error;                                                   // 0x0008 (size: 0x8)
    class UMaterialInstance* Building;                                                // 0x0010 (size: 0x8)
    class UMaterialInstance* BuildComplete;                                           // 0x0018 (size: 0x8)
    class UMaterialInstance* Dismantle;                                               // 0x0020 (size: 0x8)
    class UMaterialInstance* Damage;                                                  // 0x0028 (size: 0x8)
    class UCurveFloat* BuildCompleteAnimationCurve;                                   // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FBulletHoleDecalInfo
{
    TArray<class UMaterialInterface*> BulletHoleDecals;                               // 0x0000 (size: 0x10)
    FVector Decal_Size;                                                               // 0x0010 (size: 0x18)
    float Decal_Size_RandomMin;                                                       // 0x0028 (size: 0x4)
    float Decal_Size_RandomMax;                                                       // 0x002C (size: 0x4)

}; // Size: 0x30

struct FCaptureResult
{
    bool IsSuccess;                                                                   // 0x0000 (size: 0x1)
    int32 TestSuccessCount;                                                           // 0x0004 (size: 0x4)
    EFailedCaptureType FailedCaptureType;                                             // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FCharacterListForImportanceManager
{
    TArray<class APalCharacter*> CharacterList;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterParameterRepInfo : public FFastArraySerializerItem
{
    FGuid RequestGUID;                                                                // 0x000C (size: 0x10)
    FPalInstanceID ID;                                                                // 0x0020 (size: 0x30)
    class UPalIndividualCharacterParameter* Parameter;                                // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FDelegateTickFunction : public FTickFunction
{
}; // Size: 0x38

struct FElementOfLayeredFlagContainer
{
    int32 Priority;                                                                   // 0x0000 (size: 0x4)
    FFlagContainer Container;                                                         // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FFastCharacterParameterRepInfoArray : public FFastArraySerializer
{
    TArray<FCharacterParameterRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFastPalBaseCampRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampRepInfo> Items;                                                // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFastPalIndividualCharacterHandleIdArray : public FFastArraySerializer
{
    TArray<FPalIndividualCharacterHandleId> Items;                                    // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FFastPalLocationRepInfoArray : public FFastArraySerializer
{
    TArray<FPalLocationRepInfo> Items;                                                // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFastPlayerPlatformInfoArray : public FFastArraySerializer
{
    TArray<FPalPlayerPlatformInfo> Items;                                             // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FFixedPoint
{
    int32 Value;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FFixedPoint64
{
    int64 Value;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FFlagContainer
{
    TMap<class FName, class bool> Flags;                                              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FFloatContainer
{
    TArray<FFloatContainer_FloatPair> Values;                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFloatContainer_FloatPair
{
    FName Key;                                                                        // 0x0000 (size: 0x8)
    float Value;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFloatCounter
{
    float TriggerValue;                                                               // 0x0000 (size: 0x4)
    float CurrentStackValue;                                                          // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FFootIKSetting
{
    bool bIsEnableIK;                                                                 // 0x0000 (size: 0x1)
    FName RayCastBoneName;                                                            // 0x0004 (size: 0x8)
    float RayStartOffset;                                                             // 0x000C (size: 0x4)
    float RayEndOffset;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FFootStampInfo
{
    TMap<class EPalFootType, class UMaterialInterface*> FootstepDecalMap;             // 0x0000 (size: 0x50)
    FVector FootstepDecal_Size;                                                       // 0x0050 (size: 0x18)
    FRotator FootstepDecal_InitialRotation;                                           // 0x0068 (size: 0x18)

}; // Size: 0x80

struct FFootStepEffectInfo
{
    TMap<TEnumAsByte<EPhysicalSurface>, TSoftObjectPtr<UNiagaraSystem>> PhysicalSurfaceToEffect; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FGameDateTime
{
    int64 Ticks;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FGeneralAnimationParameter
{
    float MoveSpeed;                                                                  // 0x0000 (size: 0x4)
    float MoveSpeedXY;                                                                // 0x0004 (size: 0x4)
    FVector Velocity;                                                                 // 0x0008 (size: 0x18)
    FVector InputVelocity;                                                            // 0x0020 (size: 0x18)
    FVector ClimbingVelocity;                                                         // 0x0038 (size: 0x18)
    bool bIsInAir;                                                                    // 0x0050 (size: 0x1)
    bool bIsSliding;                                                                  // 0x0051 (size: 0x1)
    bool bIsSwimming;                                                                 // 0x0052 (size: 0x1)
    float RangeForGround;                                                             // 0x0054 (size: 0x4)
    bool bIsNearGround;                                                               // 0x0058 (size: 0x1)
    TMap<class EPalGeneralAnimSequenceType, class UAnimSequence*> GeneralAnimSequenceMap; // 0x0060 (size: 0x50)
    TMap<class EPalGeneralBlendSpaceType, class UBlendSpace*> GeneralBlendSpaceMap;   // 0x00B0 (size: 0x50)
    float FootIKRootOffset;                                                           // 0x0100 (size: 0x4)
    TMap<EPalFootType, float> FootIKOffset;                                           // 0x0108 (size: 0x50)
    float MoveSpeedPlusByRotateYaw;                                                   // 0x0158 (size: 0x4)
    float YawSpeed;                                                                   // 0x015C (size: 0x4)
    float AdditiveAnimationRate;                                                      // 0x0160 (size: 0x4)
    bool DisableUpperOverrideFlag;                                                    // 0x0164 (size: 0x1)
    bool bTransportingObject;                                                         // 0x0165 (size: 0x1)
    TEnumAsByte<EMovementMode> MovementMode;                                          // 0x0166 (size: 0x1)
    EPalCharacterMovementCustomMode CustomMovementMode;                               // 0x0167 (size: 0x1)
    bool bForceSprintForNPC;                                                          // 0x0168 (size: 0x1)
    bool bUseUpperBodyOnlyWhileRidingFlag;                                            // 0x0169 (size: 0x1)

}; // Size: 0x170

struct FHistoryServerWorld
{
    FString ServerName;                                                               // 0x0000 (size: 0x10)
    FString Description;                                                              // 0x0010 (size: 0x10)
    int32 MaxPlayerNum;                                                               // 0x0020 (size: 0x4)
    FString ServerAddress;                                                            // 0x0028 (size: 0x10)
    int32 ServerPort;                                                                 // 0x0038 (size: 0x4)
    FString VersionString;                                                            // 0x0040 (size: 0x10)
    bool IsLocked;                                                                    // 0x0050 (size: 0x1)
    FString Guid;                                                                     // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FLayeredFlagContainer
{
    TArray<FElementOfLayeredFlagContainer> ContainerList;                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FNetworkActorSpawnParameters
{
    class AActor* NetworkOwner;                                                       // 0x0000 (size: 0x8)
    FName Name;                                                                       // 0x0008 (size: 0x8)
    class AActor* Owner;                                                              // 0x0010 (size: 0x8)
    FVector SpawnLocation;                                                            // 0x0018 (size: 0x18)
    FRotator SpawnRotation;                                                           // 0x0030 (size: 0x18)
    FVector SpawnScale;                                                               // 0x0048 (size: 0x18)
    TSubclassOf<class AController> ControllerClass;                                   // 0x0060 (size: 0x8)
    ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingOverride;                // 0x0068 (size: 0x1)
    bool bAlwaysRelevant;                                                             // 0x0069 (size: 0x1)
    bool bNeedAdjustToFloor;                                                          // 0x006A (size: 0x1)
    float AdjustUpOffset;                                                             // 0x006C (size: 0x4)
    bool bAdjustShortRayLength;                                                       // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FOverridePlayerGenderParams
{
    TMap<class EPalWeaponType, class FSoftShooterAnimeAssetPair> OverrideDefaultWeaponAnimPair; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalACEWordFilterRequestData
{
    FString TargetString;                                                             // 0x0000 (size: 0x10)
    EPalACEWordFilterSceneType SceneType;                                             // 0x0010 (size: 0x1)
    FPalACEWordFilterRequestDataCallback Callback;                                    // 0x0018 (size: 0x10)
    void AsyncHTTPRequestFunction(const FString ResponseBody, bool bResponseOK, int32 ResponseCode);

}; // Size: 0x28

struct FPalAIActionBaseCampSleepActivelyParameter
{
    float WalkAroundTime;                                                             // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPalAIActionDynamicParameter
{
    class AActor* GeneralActor1;                                                      // 0x0000 (size: 0x8)
    FVector GeneralVector1;                                                           // 0x0008 (size: 0x18)
    FVector GeneralVector2;                                                           // 0x0020 (size: 0x18)
    int32 GeneralIndex1;                                                              // 0x0038 (size: 0x4)
    bool GeneralBool1;                                                                // 0x003C (size: 0x1)
    int32 GeneralInteger1;                                                            // 0x0040 (size: 0x4)
    int32 GeneralInteger2;                                                            // 0x0044 (size: 0x4)
    EPalWazaID SelfDestructWaza;                                                      // 0x0048 (size: 0x2)

}; // Size: 0x50

struct FPalAIMoveRequest : public FAIMoveRequest
{
}; // Size: 0x68

struct FPalAISensorSearchQuery
{
}; // Size: 0x18

struct FPalActivatableDamageAreaLoopStartParameter
{
    float LoopInterval;                                                               // 0x0000 (size: 0x4)
    int32 LoopCount;                                                                  // 0x0004 (size: 0x4)
    float ActiveInterval;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalAmbientSoundAreaData
{
    int32 AmbientPriority;                                                            // 0x0000 (size: 0x4)
    TArray<class UAkAudioEvent*> DayAmbientEvents;                                    // 0x0008 (size: 0x10)
    TArray<class UAkAudioEvent*> NightAmbientEvents;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalArenaBattleFormation
{
    FTransform PlayerTransform;                                                       // 0x0000 (size: 0x60)
    TArray<FTransform> PalTransforms;                                                 // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalArenaBattleResultInfo
{
    EPalArenaBattleResult BattleResult;                                               // 0x0000 (size: 0x1)
    bool bIsTimeup;                                                                   // 0x0001 (size: 0x1)
    TArray<FPalArenaRankPointChangeResult> RankPointChangeResults;                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalArenaCharacterOverrideStatus
{
    bool bValid;                                                                      // 0x0000 (size: 0x1)
    int32 Level;                                                                      // 0x0004 (size: 0x4)
    int32 MaxHP;                                                                      // 0x0008 (size: 0x4)
    int32 Attack;                                                                     // 0x000C (size: 0x4)
    int32 Defense;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalArenaCharacterRestoreParameter
{
    bool bValid;                                                                      // 0x0000 (size: 0x1)
    FFixedPoint64 Hp;                                                                 // 0x0008 (size: 0x8)
    float FullStomach;                                                                // 0x0010 (size: 0x4)
    float SanityValue;                                                                // 0x0014 (size: 0x4)
    EPalBaseCampWorkerSickType WorkerSick;                                            // 0x0018 (size: 0x1)
    FName FoodWithStatusEffect;                                                       // 0x001C (size: 0x8)
    int32 Tiemr_FoodWithStatusEffect;                                                 // 0x0024 (size: 0x4)
    FPalFoodRegeneInfo FoodRegeneEffectInfo;                                          // 0x0028 (size: 0x20)

}; // Size: 0x48

struct FPalArenaEntranceInfo
{
    TArray<FPalArenaEntryPair> EntryPlayers;                                          // 0x0000 (size: 0x10)
    bool bCanEntry;                                                                   // 0x0010 (size: 0x1)
    FGuid ArenaRoomId;                                                                // 0x0014 (size: 0x10)

}; // Size: 0x28

struct FPalArenaEntryPair
{
    FGuid PlayerUId1;                                                                 // 0x0000 (size: 0x10)
    FGuid PlayerUId2;                                                                 // 0x0010 (size: 0x10)
    bool IsSoloMode;                                                                  // 0x0020 (size: 0x1)

}; // Size: 0x24

struct FPalArenaInstanceModelCreateParameter
{
    class UDataLayerAsset* ReservedDataLayerAsset;                                    // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPalArenaLevelInstanceLoadOperator
{
}; // Size: 0x20

struct FPalArenaMatchingPlayerInfo
{
    FString PlayerName;                                                               // 0x0000 (size: 0x10)
    EPalArenaRank ArenaRank;                                                          // 0x0010 (size: 0x1)
    int32 PlayerLevel;                                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalArenaNPCData : public FTableRowBase
{
    FName NameTextID;                                                                 // 0x0008 (size: 0x8)
    int32 RankPoint;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalArenaNPCOtomo
{
    FPalDataTableRowName_PalMonsterData PalId;                                        // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 TalentLevel;                                                                // 0x000C (size: 0x4)
    int32 Rank;                                                                       // 0x0010 (size: 0x4)
    TArray<FPalCharacterStatusRank> StatusRank;                                       // 0x0018 (size: 0x10)
    TArray<EPalWazaID> WazaList;                                                      // 0x0028 (size: 0x10)
    TArray<FPalDataTableRowName_PassiveSkillData> PassiveSkill;                       // 0x0038 (size: 0x10)
    int32 FriendshipRank;                                                             // 0x0048 (size: 0x4)
    bool isAlwaysPicked;                                                              // 0x004C (size: 0x1)

}; // Size: 0x50

struct FPalArenaNPCPresetRow : public FTableRowBase
{
    EPalArenaRank ArenaRank;                                                          // 0x0008 (size: 0x1)
    FPalDataTableRowName_PalHumanData NPCID;                                          // 0x000C (size: 0x8)
    FPalDataTableRowName_NPCUniqueData UniqueNPCID;                                   // 0x0014 (size: 0x8)
    int32 Level;                                                                      // 0x001C (size: 0x4)
    int32 TalentLevel;                                                                // 0x0020 (size: 0x4)
    int32 Rank;                                                                       // 0x0024 (size: 0x4)
    TArray<FPalCharacterStatusRank> StatusRank;                                       // 0x0028 (size: 0x10)
    TArray<FPalArenaNPCOtomo> OtomoList;                                              // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPalArenaPlayerInfo
{
    EPalArenaPlayerIndex PlayerIndex;                                                 // 0x0000 (size: 0x1)
    class UPalIndividualCharacterParameter* PlayerIndividualParameter;                // 0x0008 (size: 0x8)
    FGuid PlayerUId;                                                                  // 0x0010 (size: 0x10)
    TArray<class UPalIndividualCharacterParameter*> OtomoList;                        // 0x0020 (size: 0x10)
    FPalArenaPlayerParty Party;                                                       // 0x0030 (size: 0x20)
    EPalArenaRank ArenaRank;                                                          // 0x0050 (size: 0x1)
    bool bIsNpc;                                                                      // 0x0051 (size: 0x1)

}; // Size: 0x58

struct FPalArenaPlayerInitializeParameter
{
    EPalArenaPlayerIndex PlayerIndex;                                                 // 0x0000 (size: 0x1)
    FGuid PlayerUId;                                                                  // 0x0004 (size: 0x10)
    FPalInstanceID PlayerIndividualId;                                                // 0x0018 (size: 0x30)
    TArray<FPalInstanceID> OtomoIndividualIdList;                                     // 0x0048 (size: 0x10)
    EPalArenaRank ArenaRank;                                                          // 0x0058 (size: 0x1)
    bool bIsNpc;                                                                      // 0x0059 (size: 0x1)
    TArray<FPalInstanceID> OtomoPicks;                                                // 0x0060 (size: 0x10)
    bool bPartySelected;                                                              // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FPalArenaPlayerNoSaveRestoreParameter
{
    EPalOtomoPalOrderType OrderType;                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalArenaPlayerParty
{
    TArray<class UPalIndividualCharacterParameter*> Pals;                             // 0x0000 (size: 0x10)
    class UPalIndividualCharacterParameter* LeaderPal;                                // 0x0010 (size: 0x8)
    bool PartySelected;                                                               // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalArenaRankPointChangeResult
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    int32 AfterPoint;                                                                 // 0x0010 (size: 0x4)
    int32 ChangePoint;                                                                // 0x0014 (size: 0x4)
    EPalArenaRankChange RankChange;                                                   // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FPalArenaResultFormation
{
    FTransform PlayerTransform;                                                       // 0x0000 (size: 0x60)
    TArray<FTransform> PalTransforms;                                                 // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalArenaRule
{
    bool bLevelSync;                                                                  // 0x0000 (size: 0x1)
    int32 TimeLimit;                                                                  // 0x0004 (size: 0x4)
    float PlayerDamageRate;                                                           // 0x0008 (size: 0x4)
    float PalDamageRate;                                                              // 0x000C (size: 0x4)
    bool bBossPalRestricion;                                                          // 0x0010 (size: 0x1)
    bool bLegendPalRestricion;                                                        // 0x0011 (size: 0x1)
    bool bHumanRestricion;                                                            // 0x0012 (size: 0x1)
    bool bRideRestricion;                                                             // 0x0013 (size: 0x1)
    bool bDuplicatePalRestricion;                                                     // 0x0014 (size: 0x1)
    TArray<EPalElementType> ElementRestricions;                                       // 0x0018 (size: 0x10)
    TArray<FPalDataTableRowName_PalMonsterData> PalRestricionIds;                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPalArenaSequencerInitializeParameter
{
    TArray<FPalArenaPlayerInitializeParameter> PlayerParams;                          // 0x0000 (size: 0x10)
    class UPalArenaInstanceModel* ArenaInstanceModel;                                 // 0x0010 (size: 0x8)
    bool bIsSpectate;                                                                 // 0x0018 (size: 0x1)
    EPalArenaSequenceType StartSequenceType;                                          // 0x0019 (size: 0x1)
    FGameDateTime ServerSequenceBeginTime;                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalArenaSoloClearItemInfo
{
    FPalDataTableRowName_ItemData ItemName;                                           // 0x0000 (size: 0x8)
    float Rate;                                                                       // 0x0008 (size: 0x4)
    int32 Min;                                                                        // 0x000C (size: 0x4)
    int32 Max;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalArenaSoloClearRewardRow : public FTableRowBase
{
    EPalArenaRank Rank;                                                               // 0x0008 (size: 0x1)
    TArray<FPalArenaSoloClearItemInfo> FirstClearReward;                              // 0x0010 (size: 0x10)
    TArray<FPalArenaSoloClearItemInfo> RepeatClearReward;                             // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalArenaSpectatePlayerInfo
{
    class UPalIndividualCharacterParameter* IndividualParameter;                      // 0x0000 (size: 0x8)
    TArray<class UPalIndividualCharacterParameter*> OtomoList;                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalArenaSpectateRoomInfo
{
    bool bIsPartySelecting;                                                           // 0x0000 (size: 0x1)
    TArray<FPalArenaSpectatePlayerInfo> SpectatePlayerInfos;                          // 0x0008 (size: 0x10)
    FPalArenaRule Rule;                                                               // 0x0018 (size: 0x38)
    FGuid ArenaInstanceId;                                                            // 0x0050 (size: 0x10)
    FGuid ArenaRoomId;                                                                // 0x0060 (size: 0x10)
    FGameDateTime SequenceStartTime;                                                  // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FPalArenaSpectateSpringArmParameter
{
    bool bEnableCameraLag;                                                            // 0x0000 (size: 0x1)
    bool bEnableCameraRotationLag;                                                    // 0x0001 (size: 0x1)
    float CameraLagSpeed;                                                             // 0x0004 (size: 0x4)
    float CameraRotationLagSpeed;                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalArenaStartParameter
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FQuat Rot;                                                                        // 0x0020 (size: 0x20)
    EPalAudioStateGroup BattleBGMStateGroup;                                          // 0x0040 (size: 0x1)

}; // Size: 0x50

struct FPalArenaTestParameter
{
    class UPalArenaPartyAsset* Player1Data;                                           // 0x0000 (size: 0x8)
    class UPalArenaPartyAsset* Player2Data;                                           // 0x0008 (size: 0x8)
    class AActor* Player1StartPoint;                                                  // 0x0010 (size: 0x8)
    class AActor* Player2StartPoint;                                                  // 0x0018 (size: 0x8)
    TArray<class AActor*> Player1PalPoint;                                            // 0x0020 (size: 0x10)
    TArray<class AActor*> Player2PalPoint;                                            // 0x0030 (size: 0x10)
    EPalAudioStateGroup BattleBGMStateGroup;                                          // 0x0040 (size: 0x1)
    float RideDelayTime;                                                              // 0x0044 (size: 0x4)
    bool bRandomPartyMode;                                                            // 0x0048 (size: 0x1)
    int32 RandomPartyPalLevel;                                                        // 0x004C (size: 0x4)

}; // Size: 0x50

struct FPalArenaUnusableItemRow : public FTableRowBase
{
    FName ItemId;                                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalArenaWeaponRestoreParameter
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 BulletNum;                                                                  // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FPalArenaWorldRankingRecord
{
    int32 RankingNo;                                                                  // 0x0000 (size: 0x4)
    FString PlayerName;                                                               // 0x0008 (size: 0x10)
    FName NPCNameTextID;                                                              // 0x0018 (size: 0x8)
    FString GuildName;                                                                // 0x0020 (size: 0x10)
    EPalArenaRank ArenaRank;                                                          // 0x0030 (size: 0x1)
    int32 ArenaRankPoint;                                                             // 0x0034 (size: 0x4)
    FName RankingNPCId;                                                               // 0x0038 (size: 0x8)
    FGuid PlayerUId;                                                                  // 0x0040 (size: 0x10)
    FString OldPlayerName;                                                            // 0x0050 (size: 0x10)
    FString OldGuildName;                                                             // 0x0060 (size: 0x10)
    TWeakObjectPtr<class UPalIndividualCharacterParameter> PlayerIndividualParameter_InServer; // 0x0070 (size: 0x8)
    FGuid GuildId_InServer;                                                           // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FPalArenaWorldRankingRepInfo : public FFastArraySerializerItem
{
    FPalArenaWorldRankingRecord Record;                                               // 0x0010 (size: 0x88)

}; // Size: 0x98

struct FPalArrowSettings
{
    FColor Color;                                                                     // 0x0000 (size: 0x4)
    float Size;                                                                       // 0x0004 (size: 0x4)
    float Thickness;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalAsyncSaveProcess
{
    EPalAsyncSaveProcessState State;                                                  // 0x0000 (size: 0x1)
    bool bPreDelegateSuccess;                                                         // 0x0001 (size: 0x1)
    class USaveGame* SaveObject;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x30

struct FPalAsyncSaveProcessParallel
{
    TMap<class FString, class FPalAsyncSaveProcess> ProcessMap;                       // 0x0000 (size: 0x50)

}; // Size: 0x60

struct FPalAudioFadeParameter
{
    EPalAudioFadeType FadeType;                                                       // 0x0000 (size: 0x1)
    float CurrentVolume;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalAxisKeyConfigKeys : public FPalKeyConfigKeys
{
    FName AxisName;                                                                   // 0x0030 (size: 0x8)
    EPalKeyConfigAxisFilterType FilterType;                                           // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FPalBPClassDataRow : public FTableRowBase
{
    TSoftClassPtr<APalCharacter> BPClass;                                             // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBaseCampCreateParameter
{
}; // Size: 0x170

struct FPalBaseCampEnergyGeneratorWorkStateChangeParameter
{
}; // Size: 0x4

struct FPalBaseCampFacilityCountPair
{
    EPalMapObjectWorkerAvailableFacilityType FacilityType;                            // 0x0000 (size: 0x1)
    int32 FacilityCount;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalBaseCampFacilityUsageInfo
{
    EPalBaseCampFacilityUsageState State;                                             // 0x0000 (size: 0x1)
    FPalInstanceID ReservedIndividualId;                                              // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBaseCampFacilityUsageInfoSet
{
    TMap<class FGuid, class FPalBaseCampFacilityUsageInfo> InfoMap;                   // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalBaseCampGetContainerIdsOption
{
}; // Size: 0x28

struct FPalBaseCampItemContainerInfo
{
    FGuid OwnerMapObjectConcreteModelInstanceId;                                      // 0x0000 (size: 0x10)
    EPalBaseCampItemContainerType Type;                                               // 0x0010 (size: 0x1)
    FPalContainerId ContainerIdCache;                                                 // 0x0014 (size: 0x10)
    bool bShouldUseContainerIdCache;                                                  // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FPalBaseCampItemExistsInfo
{
    FGuid MapObjectModelInstanceId;                                                   // 0x0000 (size: 0x10)
    int32 itemNum;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalBaseCampItemStackInfo
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 StackCount;                                                                 // 0x0028 (size: 0x4)
    class UPalDynamicItemDataBase* DynamicItemData;                                   // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalBaseCampItemStackRepInfo : public FFastArraySerializerItem
{
    FGuid MapObjectConcreteModelInstanceId;                                           // 0x000C (size: 0x10)
    TArray<FGuid> AvailablePlayerUIds;                                                // 0x0020 (size: 0x10)
    TArray<FPalBaseCampItemStackInfo> ItemStackInfos;                                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalBaseCampLevelMasterData : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 WorkerMaxNum;                                                               // 0x000C (size: 0x4)
    int32 BaseCampMaxNumInGuild;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalBaseCampMapObjectRepInfo : public FFastArraySerializerItem
{
    FGuid InstanceId;                                                                 // 0x000C (size: 0x10)

}; // Size: 0x1C

struct FPalBaseCampModuleResourceCollectWorkInfo
{
    FGuid WorkId;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampModuleTransportItemCharacterInfo
{
    TArray<FPalItemAndNum> ItemInfos;                                                 // 0x0000 (size: 0x10)
    FVector CharacterLocation;                                                        // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FPalBaseCampModuleTransportItemDepotParameter
{
    FGuid OwnerMapObjectConcreteModelInstanceId;                                      // 0x0000 (size: 0x10)
    FPalBoundsTransform DepotLocalBoundsTransform;                                    // 0x0010 (size: 0x80)
    FPalBaseCampModuleTransportItemRequirement Requirement;                           // 0x0090 (size: 0x48)

}; // Size: 0xE0

struct FPalBaseCampModuleTransportItemDirection
{
    FGuid RequiredMapObjectConcreteModelInstanceId;                                   // 0x0000 (size: 0x10)
    FGuid TransportTargetMapObjectConcreteModelInstanceId;                            // 0x0010 (size: 0x10)
    int32 MaxItemStackNum;                                                            // 0x0020 (size: 0x4)
    bool bRetunring;                                                                  // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FPalBaseCampModuleTransportItemRequirement
{
    EPalBaseCampModuleTransportItemTransportPriority Priority;                        // 0x0000 (size: 0x1)
    TArray<FPalStaticItemIdAndNum> ItemInfo;                                          // 0x0008 (size: 0x10)
    TArray<EPalItemTypeA> ItemTypeA;                                                  // 0x0018 (size: 0x10)
    TArray<EPalItemTypeB> ItemTypeB;                                                  // 0x0028 (size: 0x10)
    TArray<EPalBaseCampModuleTransportItemTransportableItemExtraType> ItemExtraTypes; // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPalBaseCampModuleTransportItemStatus
{
    FPalBaseCampModuleTransportItemRequirement Requirement;                           // 0x0000 (size: 0x48)
    bool bDepot;                                                                      // 0x0048 (size: 0x1)
    FPalBoundsTransform DepotLocalBoundsTransform;                                    // 0x0050 (size: 0x80)
    FGuid WorkId;                                                                     // 0x00D0 (size: 0x10)
    TMap<class FPalInstanceID, class FPalBaseCampModuleTransportItemDirection> DirectionMap; // 0x00E0 (size: 0x50)
    TMap<FName, int32> NotSatisfiedRequirementItemInfoMap;                            // 0x0130 (size: 0x50)

}; // Size: 0x180

struct FPalBaseCampModuleTransportItemTarget
{
    bool bTargetRemoved;                                                              // 0x0000 (size: 0x1)
    TMap<class FPalInstanceID, class FPalBaseCampModuleTransportItemTargetReservedInfo> ReservedInfoMap; // 0x0008 (size: 0x50)
    bool bNotExistMovePath;                                                           // 0x0058 (size: 0x1)
    bool bEnableObtainAnywhere;                                                       // 0x0059 (size: 0x1)
    TMap<FName, int32> NotReservedItemInfoMap;                                        // 0x0060 (size: 0x50)
    FGuid WorkId;                                                                     // 0x00B0 (size: 0x10)

}; // Size: 0xC0

struct FPalBaseCampModuleTransportItemTargetReservedInfo
{
    TArray<FPalStaticItemIdAndNum> ItemInfos;                                         // 0x0000 (size: 0x10)
    FGuid RequiredConcreteModelId;                                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalBaseCampPassiveEffectMapObjectInfo
{
    TArray<FGuid> ConcreteModelInstanceIds;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampPassiveEffectRepInfo : public FFastArraySerializerItem
{
    class UPalBaseCampPassiveEffectBase* Effect;                                      // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalBaseCampPassiveEffectWorkHardInfo
{
    float WorkSpeedRate;                                                              // 0x0000 (size: 0x4)
    float MoveSpeedRate;                                                              // 0x0004 (size: 0x4)
    float AffectSanityRate;                                                           // 0x0008 (size: 0x4)
    float DecreaseFullStomachRate;                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalBaseCampPassiveSkillGrantedEffectInfo
{
    TArray<FPalPassiveSkillEffect> Effects;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampRepInfo : public FFastArraySerializerItem
{
    FGuid ID;                                                                         // 0x000C (size: 0x10)
    class UPalBaseCampModel* BaseCamp;                                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalBaseCampSaveData : public FPalBinaryMemory
{
    FPalBaseCampSaveData_WorkerDirector WorkerDirector;                               // 0x0020 (size: 0x20)
    FPalBaseCampSaveData_WorkCollection WorkCollection;                               // 0x0040 (size: 0x20)
    TMap<class EPalBaseCampModuleType, class FPalBaseCampSaveData_Module> ModuleMap;  // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FPalBaseCampSaveData_Module : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalBaseCampSaveData_Module_PassiveEffect : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalBaseCampSaveData_WorkCollection : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalBaseCampSaveData_WorkerDirector : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalBaseCampSignificanceInfo
{
    float DistanceInRangeFromPlayer;                                                  // 0x0000 (size: 0x4)
    float TickInterval;                                                               // 0x0004 (size: 0x4)
    bool bMergeDropItems;                                                             // 0x0008 (size: 0x1)
    bool bUpdateSimple;                                                               // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FPalBaseCampTaskCheckedData
{
    int32 completedTaskNum;                                                           // 0x0000 (size: 0x4)
    TMap<FName, int32> buildObjectNumMap;                                             // 0x0008 (size: 0x50)
    int32 workerNum;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FPalBaseCampTaskDataSet
{
    TArray<FPalBaseCampTaskData_BuildObject> requireBuildObjects;                     // 0x0000 (size: 0x10)
    FPalBaseCampTaskData_WorkerNum requirePalNum;                                     // 0x0010 (size: 0x14)

}; // Size: 0x28

struct FPalBaseCampTaskDataSet_TableRow : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 workerNum;                                                                  // 0x000C (size: 0x4)
    FName WorkerNum_IncompleteMsgID;                                                  // 0x0010 (size: 0x8)
    FName WorkerNum_CompleteMsgID;                                                    // 0x0018 (size: 0x8)
    FName BuildObject1;                                                               // 0x0020 (size: 0x8)
    int32 BuildObjectNum1;                                                            // 0x0028 (size: 0x4)
    FName BuildObject1_IncompleteMsgID;                                               // 0x002C (size: 0x8)
    FName BuildObject1_CompleteMsgID;                                                 // 0x0034 (size: 0x8)
    FName BuildObject2;                                                               // 0x003C (size: 0x8)
    int32 BuildObjectNum2;                                                            // 0x0044 (size: 0x4)
    FName BuildObject2_IncompleteMsgID;                                               // 0x0048 (size: 0x8)
    FName BuildObject2_CompleteMsgID;                                                 // 0x0050 (size: 0x8)
    FName BuildObject3;                                                               // 0x0058 (size: 0x8)
    int32 BuildObjectNum3;                                                            // 0x0060 (size: 0x4)
    FName BuildObject3_IncompleteMsgID;                                               // 0x0064 (size: 0x8)
    FName BuildObject3_CompleteMsgID;                                                 // 0x006C (size: 0x8)

}; // Size: 0x78

struct FPalBaseCampTaskData_BuildObject
{
    FName incompleteMsgID;                                                            // 0x0000 (size: 0x8)
    FName completeMsgID;                                                              // 0x0008 (size: 0x8)
    FPalDataTableRowName_MapObjectData mapObjectRowName;                              // 0x0010 (size: 0x8)
    int32 requireNum;                                                                 // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalBaseCampTaskData_WorkerNum
{
    FName incompleteMsgID;                                                            // 0x0000 (size: 0x8)
    FName completeMsgID;                                                              // 0x0008 (size: 0x8)
    int32 requireNum;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalBaseCampWorkAssignRequest
{
}; // Size: 0x60

struct FPalBaseCampWorkCollectionRepInfo : public FFastArraySerializerItem
{
    FGuid ID;                                                                         // 0x000C (size: 0x10)
    class UPalWorkBase* Work;                                                         // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalBaseCampWorkCollectionStashInfo
{
    FGameDateTime StashAtTime;                                                        // 0x0000 (size: 0x8)
    bool bRestoreAtNextResetTime;                                                     // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FPalBaseCampWorkDirectorBattleDefenseModelStashInfo
{
    FDateTime StashAtTime;                                                            // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalBaseCampWorkerEventMasterData : public FTableRowBase
{
    FName Debug_DisplayName;                                                          // 0x0008 (size: 0x8)
    EPalBaseCampWorkerEventPriority Priority;                                         // 0x0010 (size: 0x1)
    int32 TriggerSanity;                                                              // 0x0014 (size: 0x4)
    bool bAllowInterruptRecoverHungry;                                                // 0x0018 (size: 0x1)
    bool bAllowInterruptSleep;                                                        // 0x0019 (size: 0x1)
    bool bAssignableWork;                                                             // 0x001A (size: 0x1)
    bool bAssignableFixedWork;                                                        // 0x001B (size: 0x1)
    int32 TriggerSkipCount;                                                           // 0x001C (size: 0x4)
    EPalLogPriority logPriority;                                                      // 0x0020 (size: 0x1)
    EPalLogContentToneType LogTone;                                                   // 0x0021 (size: 0x1)
    bool Invalid;                                                                     // 0x0022 (size: 0x1)

}; // Size: 0x28

struct FPalBaseCampWorkerFindPreferredWorkInfoCache
{
    TArray<class UPalWorkBase*> SortedByPriorityDescWorks;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBaseCampWorkerMoveExtraParameter
{
}; // Size: 0x90

struct FPalBaseCampWorkerMovementLogDisplayData
{
    FPalInstanceID WorkerInstanceID;                                                  // 0x0000 (size: 0x30)
    EPalLogType Type;                                                                 // 0x0030 (size: 0x1)
    EPalLogContentToneType ToneType;                                                  // 0x0031 (size: 0x1)
    FName TargetMapObjectMasterDataId;                                                // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FPalBaseCampWorkerSickMasterData : public FTableRowBase
{
    EPalBaseCampWorkerSickType SickType;                                              // 0x0008 (size: 0x1)
    int32 EffectiveItemRank;                                                          // 0x000C (size: 0x4)
    EPalFacialEyeType Facial;                                                         // 0x0010 (size: 0x1)
    int32 WorkSpeed;                                                                  // 0x0014 (size: 0x4)
    int32 MoveSpeed;                                                                  // 0x0018 (size: 0x4)
    int32 SatietyDecrease;                                                            // 0x001C (size: 0x4)
    int32 RecoveryProbabilityPercentageInPalBox;                                      // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalBaseCampWorkerTaskCheckResponse
{
}; // Size: 0x50

struct FPalBaseCampWorkerWalkAroundDynamicInfo
{
    EPalBaseCampWorkerWalkAroundState CurrentState;                                   // 0x0000 (size: 0x1)
    FVector WalkAroundDestination;                                                    // 0x0008 (size: 0x18)
    FFloatCounter WalkAroundTimeCounter;                                              // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalBaseCampWorkerWalkAroundSettingItem
{
    EPalBaseCampWorkerWalkAroundState State;                                          // 0x0000 (size: 0x1)
    int32 OccurWeight;                                                                // 0x0004 (size: 0x4)
    FFloatInterval RandomTimeRange;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalBaseCampWorkerWalkAroundSettings
{
    TArray<FPalBaseCampWorkerWalkAroundSettingItem> Items;                            // 0x0000 (size: 0x10)
    float WalkAroundArrivalRange;                                                     // 0x0010 (size: 0x4)
    float WalkAroundNextDistance;                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalBelongInfo
{
}; // Size: 0x8

struct FPalBinaryMemory
{
    TArray<uint8> RawData;                                                            // 0x0000 (size: 0x10)
    TArray<uint8> CustomVersionData;                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalBodyInstanceParameter
{
    int32 InstanceBodyIndex;                                                          // 0x0000 (size: 0x4)
    int16 InstanceBoneIndex;                                                          // 0x0004 (size: 0x2)
    float LinearDamping;                                                              // 0x0008 (size: 0x4)
    float AngularDamping;                                                             // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalBossBattleDifficultyParameter
{
    FPalDataTableRowName_PalMonsterData PalId;                                        // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    TArray<FPalBossBattleSuccessItemInfo> SuccessItemList;                            // 0x0010 (size: 0x10)
    TSoftClassPtr<APalBossBattleEventBase> BossBattleEvent;                           // 0x0020 (size: 0x30)

}; // Size: 0x50

struct FPalBossBattleInstanceModelCreateParameter
{
    TSoftClassPtr<APalCutsceneActor> IntroCutsceneActor;                              // 0x0008 (size: 0x30)
    class UDataLayerAsset* ReservedDataLayerAsset;                                    // 0x0038 (size: 0x8)
    TSoftObjectPtr<UAkAudioEvent> BGMAudioEvent;                                      // 0x0040 (size: 0x30)
    class APalBossTower* BossTower;                                                   // 0x0070 (size: 0x8)

}; // Size: 0x1A0

struct FPalBossBattleLevelInstanceLoadOperator
{
}; // Size: 0x20

struct FPalBossBattleStaticInfo
{
    TSoftClassPtr<APalCutsceneActor> IntroCutscene;                                   // 0x0000 (size: 0x30)
    TMap<class EPalBossBattleDifficulty, class FPalBossBattleDifficultyParameter> DifficultyParameter; // 0x0030 (size: 0x50)
    class UDataLayerAsset* DataLayerAsset;                                            // 0x0080 (size: 0x8)
    TSoftObjectPtr<UAkAudioEvent> BGMAudioEvent;                                      // 0x0088 (size: 0x30)
    FString AchievementId;                                                            // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FPalBossBattleSuccessItemInfo
{
    FPalDataTableRowName_ItemData ItemName;                                           // 0x0000 (size: 0x8)
    float Rate;                                                                       // 0x0008 (size: 0x4)
    int32 Min;                                                                        // 0x000C (size: 0x4)
    int32 Max;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalBossSpawnerSaveData
{
    TMap<class FName, class bool> RespawnDisableFlag;                                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalBoundsTransform
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FQuat Rotation;                                                                   // 0x0020 (size: 0x20)
    FBoxSphereBounds Bounds;                                                          // 0x0040 (size: 0x38)

}; // Size: 0x80

struct FPalBuildInstallOtherOptions
{
}; // Size: 0x2

struct FPalBuildObjectCharacterTeamMissionCharacterLoadProgress
{
    bool bCompleteLoad;                                                               // 0x0010 (size: 0x1)
    FVector SkeletalMeshScale;                                                        // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalBuildObjectCharacterTeamMissionPerformanceInProgressData
{
    class UPalCharacterVisualSkeletalMeshComponent* CharacterVisual;                  // 0x0000 (size: 0x8)
    float ProgressTime;                                                               // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalBuildObjectCharacterTeamMissionPerformanceInProgressDataArray
{
    float CannotAddRemainTime;                                                        // 0x0000 (size: 0x4)
    TArray<FPalBuildObjectCharacterTeamMissionPerformanceInProgressData> Array;       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalBuildObjectCharacterTeamMissionPerformanceStartCharacterData
{
    EPalTribeID TribeId;                                                              // 0x0000 (size: 0x2)
    FVector SkeletalMeshScale;                                                        // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalBuildObjectCharacterTeamMissionPerformanceWaitData
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    FVector SkeletalMeshScale;                                                        // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalBuildObjectConvertCharacterToItemVisualProcessInfo
{
    FGuid InstanceId;                                                                 // 0x0000 (size: 0x10)
    FName CharacterID;                                                                // 0x0010 (size: 0x8)
    float ConvertProgressRate;                                                        // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalBuildObjectData : public FTableRowBase
{
    FName MapObjectId;                                                                // 0x0008 (size: 0x8)
    EPalBuildObjectTypeA TypeA;                                                       // 0x0010 (size: 0x1)
    int32 RedialIndex;                                                                // 0x0014 (size: 0x4)
    EPalBuildObjectTypeB TypeB;                                                       // 0x0018 (size: 0x1)
    int32 Rank;                                                                       // 0x001C (size: 0x4)
    int32 BuildCapacity;                                                              // 0x0020 (size: 0x4)
    float RequiredBuildWorkAmount;                                                    // 0x0024 (size: 0x4)
    int32 AssetValue;                                                                 // 0x0028 (size: 0x4)
    EPalEnergyType RequiredEnergyType;                                                // 0x002C (size: 0x1)
    float ConsumeEnergySpeed;                                                         // 0x0030 (size: 0x4)
    FName Material1_Id;                                                               // 0x0034 (size: 0x8)
    int32 Material1_Count;                                                            // 0x003C (size: 0x4)
    FName Material2_Id;                                                               // 0x0040 (size: 0x8)
    int32 Material2_Count;                                                            // 0x0048 (size: 0x4)
    FName Material3_Id;                                                               // 0x004C (size: 0x8)
    int32 Material3_Count;                                                            // 0x0054 (size: 0x4)
    FName Material4_Id;                                                               // 0x0058 (size: 0x8)
    int32 Material4_Count;                                                            // 0x0060 (size: 0x4)
    FName BlueprintItemID;                                                            // 0x0064 (size: 0x8)
    FName OverrideDescMsgID;                                                          // 0x006C (size: 0x8)
    bool bInstallAtReticle;                                                           // 0x0074 (size: 0x1)
    float InstallNeighborThreshold;                                                   // 0x0078 (size: 0x4)
    bool bIsInstallOnlyOnBase;                                                        // 0x007C (size: 0x1)
    bool bIsInstallOnlyInDoor;                                                        // 0x007D (size: 0x1)
    bool bIsInstallOnlyHubAround;                                                     // 0x007E (size: 0x1)
    int32 InstallMaxNumInBaseCamp;                                                    // 0x0080 (size: 0x4)
    bool bInstallableNoObstacleFromCamera;                                            // 0x0084 (size: 0x1)
    float BuildExpRate;                                                               // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FPalBuildObjectDataSetTypeB
{
    EPalBuildObjectTypeB TypeB;                                                       // 0x0000 (size: 0x1)
    TArray<FPalBuildObjectData> DataArray;                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalBuildObjectIconData : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> SoftIcon;                                              // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalBuildObjectMaterialArray
{
    TArray<class UMaterialInterface*> Materials;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBuildObjectMaterialInstanceDynamicArray
{
    TArray<class UMaterialInstanceDynamic*> Materials;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalBuildObjectMeshDefaultSetting
{
    FName ProfileName;                                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalBuildRequestDebugParameter
{
    bool bNotConsumeMaterials;                                                        // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalBuildResultParameter
{
    FVector InstallLocation;                                                          // 0x0000 (size: 0x18)
    int32 CurrentBuildingNum;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalBuilderRotateOrderInfo
{
    int32 YCount;                                                                     // 0x0000 (size: 0x4)
    int32 SnapYCount;                                                                 // 0x0004 (size: 0x4)
    int32 NeighborYCount;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalBuildingCountRepInfo
{
    FGuid BaseCampId;                                                                 // 0x0000 (size: 0x10)
    int32 BuildingNum;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCalcCharacterDamageInfo
{
    float OtomoRate;                                                                  // 0x0000 (size: 0x4)
    int32 DefenderLevel;                                                              // 0x0004 (size: 0x4)
    int32 DefenderDefence;                                                            // 0x0008 (size: 0x4)
    EPalElementType DefenderElementType1;                                             // 0x000C (size: 0x1)
    EPalElementType DefenderElementType2;                                             // 0x000D (size: 0x1)
    float ElementStatusMultiplay;                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCameraDOFSetting
{
    float DepthOfFieldFocalDistance;                                                  // 0x0000 (size: 0x4)
    float DepthOfFieldDepthBlurAmount;                                                // 0x0004 (size: 0x4)
    float DepthOfFieldDepthBlurRadius;                                                // 0x0008 (size: 0x4)
    float DepthOfFieldFstop;                                                          // 0x000C (size: 0x4)
    float FOV;                                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCaptureBallEffectSettingData
{
    int32 CaptureAbsorbToBall_ParticleCount;                                          // 0x0000 (size: 0x4)
    float CaptureAbsorbToBall_Scale;                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalCaptureBonusExpRaw : public FTableRowBase
{
    int64 BonusExp;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalCaptureBonusExpTableSetting
{
    int32 TableReferenceNum;                                                          // 0x0000 (size: 0x4)
    int32 TableIndexCount;                                                            // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalCapturedCageInfoDatabaseRow : public FTableRowBase
{
    FName FieldName;                                                                  // 0x0008 (size: 0x8)
    FName PalId;                                                                      // 0x0010 (size: 0x8)
    float Weight;                                                                     // 0x0018 (size: 0x4)
    int32 MinLevel;                                                                   // 0x001C (size: 0x4)
    int32 MaxLevel;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalCellCoord
{
    int64 X;                                                                          // 0x0000 (size: 0x8)
    int64 Y;                                                                          // 0x0008 (size: 0x8)
    int64 Z;                                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalCharacterAsyncTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalCharacterCapsuleRootSettings
{
    float MaxCapsuleRadius;                                                           // 0x0000 (size: 0x4)
    float MaxCapsuleHeight;                                                           // 0x0004 (size: 0x4)
    FVector MeshOffset;                                                               // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalCharacterCompleteDelegateParameter
{
    EPalCharacterCompleteDelegatePriority Priority;                                   // 0x0000 (size: 0x1)
    FPalCharacterCompleteDelegateParameterCompleteDelegate CompleteDelegate;          // 0x0004 (size: 0x10)
    void PalOnCharacterCompleteInitializeParameter(class APalCharacter* InCharacter);

}; // Size: 0x14

struct FPalCharacterContainerSaveData : public FPalBinaryMemory
{
    bool bReferenceSlot;                                                              // 0x0020 (size: 0x1)
    TArray<FPalCharacterSlotSaveData> Slots;                                          // 0x0028 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPalCharacterContainerSlotInfo
{
    FPalInstanceID IndividualId;                                                      // 0x0000 (size: 0x30)
    FPalCharacterSlotId SlotId;                                                       // 0x0030 (size: 0x14)

}; // Size: 0x48

struct FPalCharacterContainerSortInfo
{
    EPalCharacterContainerSortType SortType;                                          // 0x0000 (size: 0x1)
    TArray<uint8> PrioritizeFavoriteIndexArray;                                       // 0x0008 (size: 0x10)
    TArray<EPalElementType> FilteringElementType;                                     // 0x0018 (size: 0x10)
    TArray<EPalWorkSuitability> FilteringSuitability;                                 // 0x0028 (size: 0x10)
    bool bPrioritizeMale;                                                             // 0x0038 (size: 0x1)
    bool bPrioritizeFemael;                                                           // 0x0039 (size: 0x1)
    bool bPrioritizeImportedPal;                                                      // 0x003A (size: 0x1)
    FName FilteringPassiveId;                                                         // 0x003C (size: 0x8)

}; // Size: 0x48

struct FPalCharacterContainerUpdateInfo
{
}; // Size: 0x20

struct FPalCharacterCreationColorPresetDataRow : public FTableRowBase
{
    TArray<FLinearColor> Colors;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalCharacterCreationEyeMaterialDataRow : public FTableRowBase
{
    TSoftObjectPtr<UMaterialInstance> EyeMaterialInstance;                            // 0x0008 (size: 0x30)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0038 (size: 0x30)
    FLinearColor ShiftUIDisplayEyeColor;                                              // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FPalCharacterCreationMakeInfoPresetDataRow : public FTableRowBase
{
    FPalPlayerDataCharacterMakeInfo PresetMakeInfo;                                   // 0x0008 (size: 0x208)

}; // Size: 0x210

struct FPalCharacterCreationMeshPresetDataRow : public FTableRowBase
{
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh;                                       // 0x0008 (size: 0x30)
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh_MaleHead;                              // 0x0038 (size: 0x30)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0068 (size: 0x30)
    TSoftClassPtr<UAnimInstance> ABPAsset;                                            // 0x0098 (size: 0x30)
    FLinearColor ShiftUIDisplayEyeColor;                                              // 0x00C8 (size: 0x10)
    FLinearColor ShiftUIDisplayBodyColor;                                             // 0x00D8 (size: 0x10)
    FLinearColor ShiftUIDisplayBrowColor;                                             // 0x00E8 (size: 0x10)
    FLinearColor ShiftUIDisplayHairColor;                                             // 0x00F8 (size: 0x10)

}; // Size: 0x108

struct FPalCharacterCreationPresetDataRow : public FTableRowBase
{
    FPalPlayerDataCharacterMakeInfo MakeInfo;                                         // 0x0008 (size: 0x208)
    TSoftObjectPtr<UTexture2D> IconTexture;                                           // 0x0210 (size: 0x30)

}; // Size: 0x240

struct FPalCharacterIconDataRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalCharacterList
{
    TArray<class APalCharacter*> CharacterList;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterMovementTickFunction : public FTickFunction
{
}; // Size: 0x68

struct FPalCharacterParameterDatabaseRow : public FTableRowBase
{
    FName OverrideNameTextID;                                                         // 0x0008 (size: 0x8)
    FName NamePrefixID;                                                               // 0x0010 (size: 0x8)
    FName OverridePartnerSkillTextID;                                                 // 0x0018 (size: 0x8)
    bool IsPal;                                                                       // 0x0020 (size: 0x1)
    EPalTribeID Tribe;                                                                // 0x0022 (size: 0x2)
    FName BPClass;                                                                    // 0x0024 (size: 0x8)
    int32 ZukanIndex;                                                                 // 0x002C (size: 0x4)
    FString ZukanIndexSuffix;                                                         // 0x0030 (size: 0x10)
    EPalSizeType Size;                                                                // 0x0040 (size: 0x1)
    int32 Rarity;                                                                     // 0x0044 (size: 0x4)
    EPalElementType ElementType1;                                                     // 0x0048 (size: 0x1)
    EPalElementType ElementType2;                                                     // 0x0049 (size: 0x1)
    EPalGenusCategoryType GenusCategory;                                              // 0x004A (size: 0x1)
    EPalOrganizationType Organization;                                                // 0x004B (size: 0x1)
    EPalWeaponType Weapon;                                                            // 0x004C (size: 0x1)
    bool WeaponEquip;                                                                 // 0x004D (size: 0x1)
    int32 Hp;                                                                         // 0x0050 (size: 0x4)
    int32 MeleeAttack;                                                                // 0x0054 (size: 0x4)
    int32 ShotAttack;                                                                 // 0x0058 (size: 0x4)
    int32 Defense;                                                                    // 0x005C (size: 0x4)
    int32 Support;                                                                    // 0x0060 (size: 0x4)
    int32 CraftSpeed;                                                                 // 0x0064 (size: 0x4)
    float Friendship_HP;                                                              // 0x0068 (size: 0x4)
    float Friendship_ShotAttack;                                                      // 0x006C (size: 0x4)
    float Friendship_Defense;                                                         // 0x0070 (size: 0x4)
    float Friendship_CraftSpeed;                                                      // 0x0074 (size: 0x4)
    float EnemyMaxHPRate;                                                             // 0x0078 (size: 0x4)
    float EnemyReceiveDamageRate;                                                     // 0x007C (size: 0x4)
    float EnemyInflictDamageRate;                                                     // 0x0080 (size: 0x4)
    float CaptureRateCorrect;                                                         // 0x0084 (size: 0x4)
    float ExpRatio;                                                                   // 0x0088 (size: 0x4)
    float Price;                                                                      // 0x008C (size: 0x4)
    float StatusResistUpRate;                                                         // 0x0090 (size: 0x4)
    FName AIResponse;                                                                 // 0x0094 (size: 0x8)
    FName AISightResponse;                                                            // 0x009C (size: 0x8)
    int32 SlowWalkSpeed;                                                              // 0x00A4 (size: 0x4)
    int32 WalkSpeed;                                                                  // 0x00A8 (size: 0x4)
    int32 RunSpeed;                                                                   // 0x00AC (size: 0x4)
    int32 RideSprintSpeed;                                                            // 0x00B0 (size: 0x4)
    int32 TransportSpeed;                                                             // 0x00B4 (size: 0x4)
    int32 SwimSpeed;                                                                  // 0x00B8 (size: 0x4)
    int32 SwimDashSpeed;                                                              // 0x00BC (size: 0x4)
    bool IsBoss;                                                                      // 0x00C0 (size: 0x1)
    bool IsTowerBoss;                                                                 // 0x00C1 (size: 0x1)
    bool IsRaidBoss;                                                                  // 0x00C2 (size: 0x1)
    bool UseBossHPGauge;                                                              // 0x00C3 (size: 0x1)
    EPalBattleBGMType BattleBGM;                                                      // 0x00C4 (size: 0x1)
    bool IgnoreLeanBack;                                                              // 0x00C5 (size: 0x1)
    bool IgnoreBlowAway;                                                              // 0x00C6 (size: 0x1)
    bool IgnoreStun;                                                                  // 0x00C7 (size: 0x1)
    int32 MaxFullStomach;                                                             // 0x00C8 (size: 0x4)
    float FullStomachDecreaseRate;                                                    // 0x00CC (size: 0x4)
    int32 FoodAmount;                                                                 // 0x00D0 (size: 0x4)
    int32 ViewingDistance;                                                            // 0x00D4 (size: 0x4)
    int32 ViewingAngle;                                                               // 0x00D8 (size: 0x4)
    float HearingRate;                                                                // 0x00DC (size: 0x4)
    bool NooseTrap;                                                                   // 0x00E0 (size: 0x1)
    bool Nocturnal;                                                                   // 0x00E1 (size: 0x1)
    int32 BiologicalGrade;                                                            // 0x00E4 (size: 0x4)
    bool Predator;                                                                    // 0x00E8 (size: 0x1)
    bool Edible;                                                                      // 0x00E9 (size: 0x1)
    int32 Stamina;                                                                    // 0x00EC (size: 0x4)
    int32 MaleProbability;                                                            // 0x00F0 (size: 0x4)
    int32 CombiRank;                                                                  // 0x00F4 (size: 0x4)
    int32 CombiDuplicatePriority;                                                     // 0x00F8 (size: 0x4)
    bool IgnoreCombi;                                                                 // 0x00FC (size: 0x1)
    float MeshCapsuleHalfHeight;                                                      // 0x0100 (size: 0x4)
    float MeshCapsuleRadius;                                                          // 0x0104 (size: 0x4)
    FVector MeshRelativeLocation;                                                     // 0x0108 (size: 0x18)
    int32 WorkSuitability_EmitFlame;                                                  // 0x0120 (size: 0x4)
    int32 WorkSuitability_Watering;                                                   // 0x0124 (size: 0x4)
    int32 WorkSuitability_Seeding;                                                    // 0x0128 (size: 0x4)
    int32 WorkSuitability_GenerateElectricity;                                        // 0x012C (size: 0x4)
    int32 WorkSuitability_Handcraft;                                                  // 0x0130 (size: 0x4)
    int32 WorkSuitability_Collection;                                                 // 0x0134 (size: 0x4)
    int32 WorkSuitability_Deforest;                                                   // 0x0138 (size: 0x4)
    int32 WorkSuitability_Mining;                                                     // 0x013C (size: 0x4)
    int32 WorkSuitability_OilExtraction;                                              // 0x0140 (size: 0x4)
    int32 WorkSuitability_ProductMedicine;                                            // 0x0144 (size: 0x4)
    int32 WorkSuitability_Cool;                                                       // 0x0148 (size: 0x4)
    int32 WorkSuitability_Transport;                                                  // 0x014C (size: 0x4)
    int32 WorkSuitability_MonsterFarm;                                                // 0x0150 (size: 0x4)
    FName PassiveSkill1;                                                              // 0x0154 (size: 0x8)
    FName PassiveSkill2;                                                              // 0x015C (size: 0x8)
    FName PassiveSkill3;                                                              // 0x0164 (size: 0x8)
    FName PassiveSkill4;                                                              // 0x016C (size: 0x8)
    FName FirstDefeatRewardItemID;                                                    // 0x0174 (size: 0x8)

}; // Size: 0x180

struct FPalCharacterParameterStorageSaveData
{
    TArray<FPalCharacterStoredParameterInfoSaveData> StoredParameterInfoSaveData;     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterParameter_Work
{
    FGuid MapObjectInstanceIdApproachTo;                                              // 0x0000 (size: 0x10)
    bool bApproachToAssignedLocation;                                                 // 0x0010 (size: 0x1)
    float RepairRequiredWorkAmount;                                                   // 0x0014 (size: 0x4)
    FFlagContainer NotWorkableFlag;                                                   // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FPalCharacterPassiveSkillGrantInfo
{
    TArray<FName> IgnoreIdList;                                                       // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FPalCharacterSlotId
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalCharacterSlotSaveData : public FPalBinaryMemory
{
    int32 SlotIndex;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalCharacterSlotUpdateInfo
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)
    FPalInstanceID InstanceId;                                                        // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FPalCharacterSpatialGrid
{
}; // Size: 0xB0

struct FPalCharacterStatusRank
{
    EPalCharacterStatusOperationName OperationName;                                   // 0x0000 (size: 0x1)
    int32 Rank;                                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalCharacterStoredParameterId
{
    FGuid ID;                                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCharacterStoredParameterInfo
{
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0000 (size: 0x328)
    FGameDateTime StoredAt;                                                           // 0x0328 (size: 0x8)
    FGuid LostPlayerUId;                                                              // 0x0330 (size: 0x10)
    FPalInstanceID InstanceId;                                                        // 0x0340 (size: 0x30)

}; // Size: 0x370

struct FPalCharacterStoredParameterInfoSaveData
{
    FPalCharacterStoredParameterId ID;                                                // 0x0000 (size: 0x10)
    FPalIndividualCharacterSaveParameterSaveData SaveParameter;                       // 0x0010 (size: 0x20)
    FGameDateTime StoredAt;                                                           // 0x0030 (size: 0x8)
    FGuid LostPlayerUId;                                                              // 0x0038 (size: 0x10)
    FPalInstanceID InstanceId;                                                        // 0x0048 (size: 0x30)

}; // Size: 0x78

struct FPalCharacterTeamMissionChallengeConditionMasterData : public FTableRowBase
{
    EPalBossType DefeatBossType;                                                      // 0x0008 (size: 0x1)
    EPalBossBattleDifficulty DefeatBossDifficulty;                                    // 0x0009 (size: 0x1)
    int32 DefeatHardBossNum;                                                          // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalCharacterTeamMissionInfo
{
    FName MissionId;                                                                  // 0x0000 (size: 0x8)
    bool bEnableChallenge;                                                            // 0x0008 (size: 0x1)
    FPalCharacterTeamMissionMasterData MasterData;                                    // 0x0010 (size: 0x40)
    TArray<FName> RewardStaticItemIds;                                                // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalCharacterTeamMissionMasterData : public FTableRowBase
{
    FName TitleTextId;                                                                // 0x0008 (size: 0x8)
    EPalMapObjectCharacterTeamMissionIconTextureType TextureType;                     // 0x0010 (size: 0x1)
    EPalCharacterTeamMissionDifficulty Difficulty;                                    // 0x0011 (size: 0x1)
    int32 RequiredSeconds;                                                            // 0x0014 (size: 0x4)
    int32 RecommendedStrength;                                                        // 0x0018 (size: 0x4)
    EPalElementType RequiredElementType;                                              // 0x001C (size: 0x1)
    int32 RequiredElementNum;                                                         // 0x0020 (size: 0x4)
    int32 MaxCharacterNum;                                                            // 0x0024 (size: 0x4)
    FName ItemFieldLotteryName;                                                       // 0x0028 (size: 0x8)
    FName ReleaseCondition;                                                           // 0x0030 (size: 0x8)
    FName ChallengeCondition;                                                         // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FPalCharacterUpgradeMasterData : public FTableRowBase
{
    int32 Rank;                                                                       // 0x0008 (size: 0x4)
    FName RequiredStaticItemId;                                                       // 0x000C (size: 0x8)
    int32 RequiredItemNum;                                                            // 0x0014 (size: 0x4)
    int32 ResetRequiredMoney;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalChatMessage
{
    EPalChatCategory Category;                                                        // 0x0000 (size: 0x1)
    FString Sender;                                                                   // 0x0008 (size: 0x10)
    FGuid SenderPlayerUId;                                                            // 0x0018 (size: 0x10)
    FString Message;                                                                  // 0x0028 (size: 0x10)
    TArray<FGuid> ReceiverPlayerUIds;                                                 // 0x0038 (size: 0x10)
    FName MessageId;                                                                  // 0x0048 (size: 0x8)
    TArray<FString> MessageArgKeys;                                                   // 0x0050 (size: 0x10)
    TArray<FString> MessageArgValues;                                                 // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalCheckStuckInfo
{
}; // Size: 0x20

struct FPalCircumRequestData
{
    FName RequestID;                                                                  // 0x0000 (size: 0x8)
    EPalItemRequireCategory RequestCategory;                                          // 0x0008 (size: 0x1)
    FPalStaticItemIdAndNum RequestItem;                                               // 0x000C (size: 0xC)
    TArray<FPalStaticItemIdAndNum> RewardItems;                                       // 0x0018 (size: 0x10)
    int32 ExpBonusLevel;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalCircumRequestData_DataAsset : public FTableRowBase
{
    EPalItemRequireCategory RequestCategory;                                          // 0x0008 (size: 0x1)
    FName RequestItem;                                                                // 0x000C (size: 0x8)
    int32 RequestNum;                                                                 // 0x0014 (size: 0x4)
    FString RewardItemString;                                                         // 0x0018 (size: 0x10)
    int32 ExpBonusLevel;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalCollectionRankDefineData
{
    float DropNumRate;                                                                // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FPalCombiUniqueDatabaseRow : public FTableRowBase
{
    EPalTribeID ParentTribeA;                                                         // 0x0008 (size: 0x2)
    EPalGenderType ParentGenderA;                                                     // 0x000A (size: 0x1)
    EPalTribeID ParentTribeB;                                                         // 0x000C (size: 0x2)
    EPalGenderType ParentGenderB;                                                     // 0x000E (size: 0x1)
    FName ChildCharacterID;                                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalCommonQuestRewardData
{
    int32 Exp;                                                                        // 0x0000 (size: 0x4)
    int32 TechnologyPoint;                                                            // 0x0004 (size: 0x4)
    TMap<FPalDataTableRowName_ItemData, int32> Items;                                 // 0x0008 (size: 0x50)
    TArray<FName> SkinNames;                                                          // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalCompletedQuestSaveData
{
    FName QuestName;                                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalContainerBelongInfo : public FPalBelongInfo
{
}; // Size: 0x8

struct FPalContainerCreateExtraParameter
{
    bool bIsWatchAllPlayer;                                                           // 0x0000 (size: 0x1)
    bool bIsSyncEnable;                                                               // 0x0001 (size: 0x1)
    bool bIgnoreOnSave;                                                               // 0x0002 (size: 0x1)
    EPalContainerOperationRestrictType OperationRestrictType;                         // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FPalContainerId
{
    FGuid ID;                                                                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalContainerInfo
{
    FPalContainerId ContainerId;                                                      // 0x0008 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalContainerInitializeParameter
{
    FPalContainerId ID;                                                               // 0x0000 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0010 (size: 0x4)
    bool bReferenceSlot;                                                              // 0x0014 (size: 0x1)
    bool bIgnoreOnSave;                                                               // 0x0015 (size: 0x1)
    EPalContainerOperationRestrictType OperationRestrictType;                         // 0x0016 (size: 0x1)

}; // Size: 0x18

struct FPalCoopSkillAssaultrifleModeCandidateLocation
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float Distance;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalCoopSkillModuleAssignPassiveSkillNames
{
    TArray<FPalDataTableRowName_PassiveSkillData> AssignSkillNames;                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalCoopSkillSearchEffectParameter
{
    FVector Origin;                                                                   // 0x0000 (size: 0x18)
    float RadiusFrom;                                                                 // 0x0018 (size: 0x4)
    float RadiusTo;                                                                   // 0x001C (size: 0x4)
    float ExtRadiusPerSec;                                                            // 0x0020 (size: 0x4)
    float FadeOutSec;                                                                 // 0x0024 (size: 0x4)
    class UAkAudioEvent* Sound;                                                       // 0x0028 (size: 0x8)
    FLinearColor PulseColor;                                                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalCoopSkillSearchResultParameter
{
    EPalCoopSkillSearchType SearchType;                                               // 0x0000 (size: 0x1)
    FVector Location;                                                                 // 0x0008 (size: 0x18)
    FGuid InstanceId;                                                                 // 0x0020 (size: 0x10)
    FPalInstanceID IndividualId;                                                      // 0x0030 (size: 0x30)
    FGuid RequestPlayerUId;                                                           // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalCrimeInstanceCreateParameter
{
    FName CrimeId;                                                                    // 0x0000 (size: 0x8)
    FGuid TargetId;                                                                   // 0x0008 (size: 0x10)
    EPalWorldSecurityLawTriggerType TriggerType;                                      // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FPalCrimeMasterData : public FTableRowBase
{
    FName CrimeNameTextId;                                                            // 0x0008 (size: 0x8)
    int32 BaseReward;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FPalCrimeStateInfo
{
    TMap<class FGuid, class FDateTime> CrimeStateFinishTimeMap;                       // 0x0000 (size: 0x50)
    TArray<FGuid> CrimeStateArray;                                                    // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalCurveBallTableRow : public FTableRowBase
{
    EPalCurveBall CurveID;                                                            // 0x0008 (size: 0x1)
    FVector2D InitVelocity;                                                           // 0x0010 (size: 0x10)
    FVector2D CurveVelocity;                                                          // 0x0020 (size: 0x10)
    float CurveInterval;                                                              // 0x0030 (size: 0x4)
    float ForwardVelocity;                                                            // 0x0034 (size: 0x4)
    float GravityScale;                                                               // 0x0038 (size: 0x4)
    float GravityInterval;                                                            // 0x003C (size: 0x4)

}; // Size: 0x40

struct FPalCustomAnimOverrideData
{
    FVector CustomLocation;                                                           // 0x0000 (size: 0x18)
    FVector CustomDirection;                                                          // 0x0018 (size: 0x18)
    FRotator CustomRotation;                                                          // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FPalCustomMarkerSaveData
{
    FVector IconLocation;                                                             // 0x0000 (size: 0x18)
    int32 IconType;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalDamageInfo
{
    int32 NativeDamageValue;                                                          // 0x0000 (size: 0x4)
    int32 RedirectDamageValue;                                                        // 0x0004 (size: 0x4)
    EPalWazaCategory Category;                                                        // 0x0008 (size: 0x1)
    bool IsBlowAttack;                                                                // 0x0009 (size: 0x1)
    bool IsLeanBack;                                                                  // 0x000A (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0010 (size: 0x18)
    EPalBodyPartsType BodyPartsType;                                                  // 0x0028 (size: 0x1)
    int32 AttackerLevel;                                                              // 0x002C (size: 0x4)
    EPalElementType AttackElementType;                                                // 0x0030 (size: 0x1)
    FGuid AttackerGroupID;                                                            // 0x0034 (size: 0x10)
    class AActor* Attacker;                                                           // 0x0048 (size: 0x8)
    class AActor* OverrideNetworkOwner;                                               // 0x0050 (size: 0x8)
    EPalAttackType AttackType;                                                        // 0x0058 (size: 0x1)
    EPalWeaponType WeaponType;                                                        // 0x0059 (size: 0x1)
    FVector HitLocation;                                                              // 0x0060 (size: 0x18)
    FName FoliageModelId;                                                             // 0x0078 (size: 0x8)
    TArray<FPalFoliageInstanceId> FoliageInstanceIds;                                 // 0x0080 (size: 0x10)
    EPalAdditionalEffectType EffectType1;                                             // 0x0090 (size: 0x1)
    int32 EffectValue1;                                                               // 0x0094 (size: 0x4)
    float EffectValueEx1;                                                             // 0x0098 (size: 0x4)
    EPalAdditionalEffectType EffectType2;                                             // 0x009C (size: 0x1)
    int32 EffectValue2;                                                               // 0x00A0 (size: 0x4)
    float EffectValueEx2;                                                             // 0x00A4 (size: 0x4)
    float SneakAttackRate;                                                            // 0x00A8 (size: 0x4)
    bool PlaySneakAttackEffect;                                                       // 0x00AC (size: 0x1)
    float DamageRatePerCollision;                                                     // 0x00B0 (size: 0x4)
    TArray<FPalSpecialAttackRateInfo> SpecialAttackRateInfos;                         // 0x00B8 (size: 0x10)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x00C8 (size: 0x1)
    bool bAttackableToFriend;                                                         // 0x00C9 (size: 0x1)
    bool NoDamage;                                                                    // 0x00CA (size: 0x1)
    bool IgnoreShield;                                                                // 0x00CB (size: 0x1)
    bool UIDamageTextOverride_DoubleRegist;                                           // 0x00CC (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x00CD (size: 0x1)
    EPalSizeType ForceRagdollSize;                                                    // 0x00CE (size: 0x1)
    bool bApplyNativeDamageValue;                                                     // 0x00CF (size: 0x1)
    bool IgnorePlayerEquipItemDamage;                                                 // 0x00D0 (size: 0x1)
    bool IgnoreCheckGroupForStun;                                                     // 0x00D1 (size: 0x1)
    bool IsPlayerVsPlayerDamage;                                                      // 0x00D2 (size: 0x1)
    float WeaponDamageRatePvP;                                                        // 0x00D4 (size: 0x4)
    TSoftObjectPtr<UNiagaraSystem> OverrideHitEffect;                                 // 0x00D8 (size: 0x30)
    EPalStatusID statusID;                                                            // 0x0108 (size: 0x1)
    bool bRedirectDamage;                                                             // 0x0109 (size: 0x1)
    FName AttackStaticItemID;                                                         // 0x010C (size: 0x8)

}; // Size: 0x118

struct FPalDamageRactionInfo
{
    bool IsBlow;                                                                      // 0x0000 (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0008 (size: 0x18)
    bool IsLeanBackAnime;                                                             // 0x0020 (size: 0x1)
    bool IsStan;                                                                      // 0x0021 (size: 0x1)
    bool IsLargeDown;                                                                 // 0x0022 (size: 0x1)
    FVector HitLocation;                                                              // 0x0028 (size: 0x18)

}; // Size: 0x40

struct FPalDamageResult
{
    int32 Damage;                                                                     // 0x0000 (size: 0x4)
    class AActor* Attacker;                                                           // 0x0008 (size: 0x8)
    class AActor* Defender;                                                           // 0x0010 (size: 0x8)
    FVector BlowVelocity;                                                             // 0x0018 (size: 0x18)
    FVector HitLocation;                                                              // 0x0030 (size: 0x18)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x0048 (size: 0x1)
    bool IgnoreShield;                                                                // 0x0049 (size: 0x1)
    bool IsPlayedLeanBack;                                                            // 0x004A (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x004B (size: 0x1)
    bool IgnorePlayerEquipItemDamage;                                                 // 0x004C (size: 0x1)
    EPalElementType AttackElementType;                                                // 0x004D (size: 0x1)

}; // Size: 0x50

struct FPalDataLayerRuntimeSetting
{
    class UDataLayerAsset* DataLayerAsset;                                            // 0x0000 (size: 0x8)
    bool bRuntimeUnload;                                                              // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FPalDataTableRowName_BaseCampWorkerEventData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_CrimeMasterData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_DungeonSpawnAreaData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FarmCropData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FieldLotteryNameData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FishPondLotteryNameData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FishShadowData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_FishingSpotLotteryNameData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_GameProgressPreset
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemProductData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemShopCreateData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_ItemShopLotteryData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_MapObjectData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_NPCAppearFlagData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_NPCUniqueData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_NoteData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalHumanData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalMonsterData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PalShopCreateData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_PassiveSkillData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_RecipeTechnologyData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_SoundID
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_UIInputAction
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDataTableRowName_WorldMapAreaData
{
    FName Key;                                                                        // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalDeadInfo
{
    int32 LastDamage;                                                                 // 0x0000 (size: 0x4)
    class AActor* LastAttacker;                                                       // 0x0008 (size: 0x8)
    class AActor* SelfActor;                                                          // 0x0010 (size: 0x8)
    FVector BlowVelocity;                                                             // 0x0018 (size: 0x18)
    FVector HitLocation;                                                              // 0x0030 (size: 0x18)
    EPalWazaID SelfDestructWaza;                                                      // 0x0048 (size: 0x2)
    EPalDeadType DeadType;                                                            // 0x004A (size: 0x1)

}; // Size: 0x50

struct FPalDeathPenaltyInfo
{
    FGuid DeathPenaID;                                                                // 0x0000 (size: 0x10)
    FGuid DeathPlayerID;                                                              // 0x0010 (size: 0x10)
    FVector PlayerDeathLocation;                                                      // 0x0020 (size: 0x18)
    FVector DropItemLocation;                                                         // 0x0038 (size: 0x18)
    TArray<FPalItemAndNum> DropItemList;                                              // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalDeathPenaltyList
{
    TArray<FPalDeathPenaltyInfo> DeathPenaArray;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDeathPenaltyPlayerParameter
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    class UPalPlayerInventoryData* Inventory;                                         // 0x0010 (size: 0x8)
    TArray<class UPalIndividualCharacterSlot*> OtomoSlots;                            // 0x0018 (size: 0x10)
    class APalPlayerState* PlayerState;                                               // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPalDebugAttachPassiveSkillInfo
{
    TArray<FPalDataTableRowName_PassiveSkillData> skill;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDebugAutoBaseCampBuilderWorker
{
    FPalDataTableRowName_PalMonsterData MonsterId;                                    // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 Num;                                                                        // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalDebugInfoSet
{
}; // Size: 0x30

struct FPalDebugItemCreateInfo
{
    FPalDataTableRowName_ItemData itemRowName;                                        // 0x0000 (size: 0x8)
    int32 itemNum;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalDebugOtomoPalInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 Rank;                                                                       // 0x000C (size: 0x4)
    int32 TalentLevel;                                                                // 0x0010 (size: 0x4)
    TArray<EPalWazaID> WazaList;                                                      // 0x0018 (size: 0x10)
    TArray<FPalDataTableRowName_PassiveSkillData> PassiveSkill;                       // 0x0028 (size: 0x10)
    TArray<FPalCharacterStatusRank> StatusRank;                                       // 0x0038 (size: 0x10)
    int32 FriendshipRank;                                                             // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FPalDebugPalCaptureInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalDeforestRankDefineData
{
    float DamageRate;                                                                 // 0x0000 (size: 0x4)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPalDimensionPalStorageSaveParameter
{
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0000 (size: 0x328)
    FPalInstanceID InstanceId;                                                        // 0x0328 (size: 0x30)

}; // Size: 0x358

struct FPalDimensionStorageControlData
{
    int32 ControllingPage;                                                            // 0x0000 (size: 0x4)
    class UPalDimensionLockerTimeoutTimer* TimeoutTimer;                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalDimensionStoragePageReplicationData
{
    TArray<FPalDimensionPalStorageSaveParameter> PageData;                            // 0x0000 (size: 0x10)
    int32 pageIndex;                                                                  // 0x0010 (size: 0x4)
    bool bDirtyToggle;                                                                // 0x0014 (size: 0x1)
    EPalDimensionStorageReplicationTriggerType TriggerType;                           // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FPalDimensionStorageRestoreInfo
{
    FGuid RestorePlayerUId;                                                           // 0x0000 (size: 0x10)
    int32 RestoreSlotIndex;                                                           // 0x0010 (size: 0x4)
    int32 OriginalLockerDataIndex;                                                    // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalDisplayRequestData
{
    FName RequestID;                                                                  // 0x0000 (size: 0x8)
    EPalPalDisplayCategory RequestCategory;                                           // 0x0008 (size: 0x1)
    FName RequestPalID;                                                               // 0x000C (size: 0x8)
    TArray<FPalStaticItemIdAndNum> RewardItems;                                       // 0x0018 (size: 0x10)
    int32 ExpBonusLevel;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalDisplayRequestData_DataAsset : public FTableRowBase
{
    EPalPalDisplayCategory RequestCategory;                                           // 0x0008 (size: 0x1)
    FName RequestPalID;                                                               // 0x000C (size: 0x8)
    FString RewardItems;                                                              // 0x0018 (size: 0x10)
    int32 ExpBonusLevel;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalDropCharacterExtraParameter
{
    FGuid DropPlayerUId;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDropCharacterSaveParameterInfo
{
    FPalInstanceID IndividualId;                                                      // 0x0000 (size: 0x30)
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0030 (size: 0x328)

}; // Size: 0x358

struct FPalDropItemDatabaseRow : public FTableRowBase
{
    FName CharacterID;                                                                // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    FName ItemId1;                                                                    // 0x0014 (size: 0x8)
    float Rate1;                                                                      // 0x001C (size: 0x4)
    int32 min1;                                                                       // 0x0020 (size: 0x4)
    int32 Max1;                                                                       // 0x0024 (size: 0x4)
    FName ItemId2;                                                                    // 0x0028 (size: 0x8)
    float Rate2;                                                                      // 0x0030 (size: 0x4)
    int32 min2;                                                                       // 0x0034 (size: 0x4)
    int32 Max2;                                                                       // 0x0038 (size: 0x4)
    FName ItemId3;                                                                    // 0x003C (size: 0x8)
    float Rate3;                                                                      // 0x0044 (size: 0x4)
    int32 min3;                                                                       // 0x0048 (size: 0x4)
    int32 Max3;                                                                       // 0x004C (size: 0x4)
    FName ItemId4;                                                                    // 0x0050 (size: 0x8)
    float Rate4;                                                                      // 0x0058 (size: 0x4)
    int32 min4;                                                                       // 0x005C (size: 0x4)
    int32 Max4;                                                                       // 0x0060 (size: 0x4)
    FName ItemId5;                                                                    // 0x0064 (size: 0x8)
    float Rate5;                                                                      // 0x006C (size: 0x4)
    int32 min5;                                                                       // 0x0070 (size: 0x4)
    int32 Max5;                                                                       // 0x0074 (size: 0x4)
    FName ItemId6;                                                                    // 0x0078 (size: 0x8)
    float Rate6;                                                                      // 0x0080 (size: 0x4)
    int32 min6;                                                                       // 0x0084 (size: 0x4)
    int32 Max6;                                                                       // 0x0088 (size: 0x4)
    FName ItemId7;                                                                    // 0x008C (size: 0x8)
    float Rate7;                                                                      // 0x0094 (size: 0x4)
    int32 min7;                                                                       // 0x0098 (size: 0x4)
    int32 Max7;                                                                       // 0x009C (size: 0x4)
    FName ItemId8;                                                                    // 0x00A0 (size: 0x8)
    float Rate8;                                                                      // 0x00A8 (size: 0x4)
    int32 min8;                                                                       // 0x00AC (size: 0x4)
    int32 Max8;                                                                       // 0x00B0 (size: 0x4)
    FName ItemId9;                                                                    // 0x00B4 (size: 0x8)
    float Rate9;                                                                      // 0x00BC (size: 0x4)
    int32 min9;                                                                       // 0x00C0 (size: 0x4)
    int32 Max9;                                                                       // 0x00C4 (size: 0x4)
    FName ItemId10;                                                                   // 0x00C8 (size: 0x8)
    float Rate10;                                                                     // 0x00D0 (size: 0x4)
    int32 min10;                                                                      // 0x00D4 (size: 0x4)
    int32 Max10;                                                                      // 0x00D8 (size: 0x4)

}; // Size: 0xE0

struct FPalDropItemInfo
{
}; // Size: 0x28

struct FPalDroppedPalProductDataForShop
{
    FPalCharacterStoredParameterId StoredParameterId;                                 // 0x0000 (size: 0x10)
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0010 (size: 0x328)

}; // Size: 0x338

struct FPalDungeonDataLayerAssetSet
{
    TArray<class UDataLayerAsset*> DataLayers;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDungeonEnemySpawnerData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    EPalDungeonEnemySpawnerRankType RankType;                                         // 0x0010 (size: 0x1)
    float WeightInSpawnAreaAndRank;                                                   // 0x0014 (size: 0x4)
    TSoftClassPtr<APalNPCSpawnerBase> SpawnerBlueprintSoftClass;                      // 0x0018 (size: 0x30)
    FName SpawnerName;                                                                // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FPalDungeonGimmickMovingFloorPoint
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float WaitTime;                                                                   // 0x0018 (size: 0x4)
    bool bPlayFXAtPoint;                                                              // 0x001C (size: 0x1)
    class UNiagaraSystem* OverridePlayFXAtPoint;                                      // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalDungeonGimmickTriggerParameter
{
    FGuid TriggerLevelInstanceId;                                                     // 0x0000 (size: 0x10)
    class AActor* TriggerActor;                                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalDungeonInfoParameter
{
    FText DungeonName;                                                                // 0x0000 (size: 0x18)
    int32 Level;                                                                      // 0x0018 (size: 0x4)
    float DisappearRemainSeconds;                                                     // 0x001C (size: 0x4)

}; // Size: 0x28

struct FPalDungeonInstanceEnemySpawnerStatus
{
}; // Size: 0x8

struct FPalDungeonInstanceLevelLoadedInfos
{
}; // Size: 0x50

struct FPalDungeonInstanceModelCreateParameter
{
    class UDataLayerAsset* ReservedDataLayerAsset;                                    // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FPalDungeonItemSpawnerData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    EPalDungeonItemSpawnerType Type;                                                  // 0x0010 (size: 0x1)
    FName ItemFieldLotteryName;                                                       // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalDungeonLevelData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    float WeightInSpawnArea;                                                          // 0x0010 (size: 0x4)
    FName LevelName;                                                                  // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalDungeonLevelInstanceLoadOperator
{
}; // Size: 0x28

struct FPalDungeonMarkerPointData
{
    FGuid MarkerPointId;                                                              // 0x0000 (size: 0x10)
    TArray<FName> SpawnAreaIds;                                                       // 0x0010 (size: 0x10)
    FTransform Transform;                                                             // 0x0020 (size: 0x60)
    FPalDungeonMarkerPointSpawnParameter SpawnParameter;                              // 0x0080 (size: 0x10)
    TSubclassOf<class APalDungeonEntrance> EntranceClass;                             // 0x0090 (size: 0x8)
    FGuid ConnectedDungeonInstanceId;                                                 // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FPalDungeonMarkerPointDataSet
{
    TArray<FPalDungeonMarkerPointData> MarkerPoints;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalDungeonMarkerPointSpawnParameter
{
    float RespawnInterval;                                                            // 0x0000 (size: 0x4)
    float DisappearInterval;                                                          // 0x0004 (size: 0x4)
    float RespawnProbability;                                                         // 0x0008 (size: 0x4)
    float DisappearIntervalAfterDefeatBoss;                                           // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalDungeonPointMarkerSaveData
{
    FGuid MarkerPointId;                                                              // 0x0000 (size: 0x10)
    FGameDateTime NextRespawnGameTime;                                                // 0x0010 (size: 0x8)
    FGuid ConnectedDungeonInstanceId;                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalDungeonRewardSaveData : public FPalBinaryMemory
{
    EPalDungeonRewardSpawnerContentType ContentType;                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FPalDungeonRewardSpawnerLotteryData : public FTableRowBase
{
    FName SpawnAreaId;                                                                // 0x0008 (size: 0x8)
    EPalDungeonRewardSpawnerType RewardSpawnerType;                                   // 0x0010 (size: 0x1)
    float Weight;                                                                     // 0x0014 (size: 0x4)
    EPalDungeonRewardSpawnerContentType SpawnerContentType;                           // 0x0018 (size: 0x1)
    FName LotteryValue;                                                               // 0x001C (size: 0x8)
    FName LotteryValueBlueprintClassName;                                             // 0x0024 (size: 0x8)
    TSoftClassPtr<AActor> LotteryValueBlueprintSoftClass;                             // 0x0030 (size: 0x30)

}; // Size: 0x60

struct FPalDungeonRewardSpawnerLotteryDataWithRowName : public FTableRowBase
{
}; // Size: 0x70

struct FPalDungeonSaveData
{
    FGuid InstanceId;                                                                 // 0x0000 (size: 0x10)
    EPalDungeonType DungeonType;                                                      // 0x0010 (size: 0x1)
    FGuid MarkerPointId;                                                              // 0x0014 (size: 0x10)
    FName DungeonSpawnAreaId;                                                         // 0x0024 (size: 0x8)
    FName DungeonLevelName;                                                           // 0x002C (size: 0x8)
    EPalDungeonInstanceBossState BossState;                                           // 0x0034 (size: 0x1)
    FName EnemySpawnerDataBossRowName;                                                // 0x0038 (size: 0x8)
    FGameDateTime DisappearTimeAt;                                                    // 0x0040 (size: 0x8)
    int32 ReservedDataLayerAssetIndex;                                                // 0x0048 (size: 0x4)
    FPalStageInstanceId StageInstanceId;                                              // 0x004C (size: 0x14)
    TArray<FPalMapObjectSaveData> MapObjectSaveData;                                  // 0x0060 (size: 0x10)
    TMap<class FGuid, class FPalDungeonRewardSaveData> RewardSaveDataMap;             // 0x0070 (size: 0x50)
    FGameDateTime RespawnBossTimeAt;                                                  // 0x00C0 (size: 0x8)

}; // Size: 0xC8

struct FPalDungeonSpawnAreaData : public FTableRowBase
{
    FName DungeonNameTextId;                                                          // 0x0008 (size: 0x8)
    FName PostfixTextId;                                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalDyingEndInfo
{
    FPalInstanceID LastAttackerInstanceID;                                            // 0x0000 (size: 0x30)
    bool bIsInstantDeath;                                                             // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FPalDynamicItemDataInfo
{
    class UPalDynamicItemDataBase* ItemData;                                          // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FPalDynamicItemDisposeReserveInfo
{
}; // Size: 0x20

struct FPalDynamicItemDisposeWaitNotifyInfo
{
    TArray<FPalDynamicItemId> DynamicItemIds;                                         // 0x0000 (size: 0x10)
    TArray<int32> WaitPlayerIds;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalDynamicItemId
{
    FGuid CreatedWorldId;                                                             // 0x0000 (size: 0x10)
    FGuid LocalIdInCreatedWorld;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalDynamicItemIdArray
{
}; // Size: 0x10

struct FPalDynamicItemInfo
{
    FPalItemSlotId SlotId;                                                            // 0x0000 (size: 0x14)
    class UPalDynamicItemDataBase* DynamicItemData;                                   // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalDynamicItemSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalEachDamageRactionInfo
{
    class AActor* Attacker;                                                           // 0x0000 (size: 0x8)
    bool IsBlow;                                                                      // 0x0008 (size: 0x1)
    bool IsLeanBackAnime;                                                             // 0x0009 (size: 0x1)
    bool IsStan;                                                                      // 0x000A (size: 0x1)
    EPalWazaCategory WazaCategory;                                                    // 0x000B (size: 0x1)

}; // Size: 0x10

struct FPalEditorItemActorClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSoftClassPtr<AActor> actorClass;                                                 // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalEditorItemDynamicClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPalDynamicItemDataBase> DynamicClass;                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalEditorItemIconTableRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalEditorItemStaticClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPalStaticItemDataBase> StaticClass;                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalEditorItemStaticMeshTableRow : public FTableRowBase
{
    FName StaticMeshName;                                                             // 0x0008 (size: 0x8)
    TSoftObjectPtr<UStaticMesh> StaticMeshPath;                                       // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalEditorPalBedMotionConfirmBuildObjectInfo
{
}; // Size: 0x40

struct FPalEditorSkinStaticClassTableRow : public FTableRowBase
{
    FName ClassName;                                                                  // 0x0008 (size: 0x8)
    TSubclassOf<class UPalSkinDataBase> StaticClass;                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalEggRankInfo
{
    int32 PalRarity;                                                                  // 0x0000 (size: 0x4)
    float EggScale;                                                                   // 0x0004 (size: 0x4)
    float HatchingSpeedDivisionRate;                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalEggRepInfo : public FFastArraySerializerItem
{
    int32 SlotIndex;                                                                  // 0x000C (size: 0x4)
    class UPalWorkProgress* WorkProgress;                                             // 0x0010 (size: 0x8)
    class UPalDynamicPalEggItemDataBase* PalEggData;                                  // 0x0018 (size: 0x8)
    FPalIndividualCharacterSaveParameter HatchedCharacterSaveParameter;               // 0x0020 (size: 0x328)

}; // Size: 0x350

struct FPalEggSaveInfo
{
    int32 SlotIndex;                                                                  // 0x0000 (size: 0x4)
    FGuid WorkId;                                                                     // 0x0004 (size: 0x10)
    FPalIndividualCharacterSaveParameter HatchedCharacterSaveParameter;               // 0x0018 (size: 0x328)

}; // Size: 0x340

struct FPalEggSpawnerBlueprintData : public FTableRowBase
{
    FName BlueprintClassName;                                                         // 0x0008 (size: 0x8)
    TSoftClassPtr<APalMapObjectSpawnerPalEgg> BlueprintClassSoft;                     // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalEnemyCampSaveData
{
    TMap<class FName, class FPalEnemyCampStatus> EnemyCampStatusMap;                  // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalEnemyCampStatus
{
    bool bIsSpawned;                                                                  // 0x0000 (size: 0x1)
    bool bIsEnemyAllDead;                                                             // 0x0001 (size: 0x1)
    bool bIsClear;                                                                    // 0x0002 (size: 0x1)
    bool bRewardReceived;                                                             // 0x0003 (size: 0x1)
    FName RewardPalId;                                                                // 0x0004 (size: 0x8)
    int32 RewardPalLevel;                                                             // 0x000C (size: 0x4)
    FDateTime ClearDate;                                                              // 0x0010 (size: 0x8)
    float ElapsedTime;                                                                // 0x0018 (size: 0x4)
    FDateTime LastCalcDate;                                                           // 0x0020 (size: 0x8)
    TMap<class FName, class FPalEnemyCampTreasureBoxItemInfo> TreasureBoxInfoMapBySpawnerName; // 0x0028 (size: 0x50)
    int32 CampPresetIndex;                                                            // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FPalEnemyCampTreasureBoxItemInfo
{
    FName MapObjectId;                                                                // 0x0000 (size: 0x8)
    EPalMapObjectTreasureGradeType GradeType;                                         // 0x0008 (size: 0x1)
    TArray<FPalItemAndNum> Items;                                                     // 0x0010 (size: 0x10)
    bool bOpened;                                                                     // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FPalEnemyDropRequestInfo
{
}; // Size: 0x10

struct FPalEquipWeaponInfo
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    class APalMonsterEquipWeaponBase* SpawnedWeapon;                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalExpDatabaseRaw : public FTableRowBase
{
    int64 DropEXP;                                                                    // 0x0008 (size: 0x8)
    int64 NextEXP;                                                                    // 0x0010 (size: 0x8)
    int64 PalNextEXP;                                                                 // 0x0018 (size: 0x8)
    int64 TotalEXP;                                                                   // 0x0020 (size: 0x8)
    int64 PalTotalEXP;                                                                // 0x0028 (size: 0x8)
    int64 BuildEXP;                                                                   // 0x0030 (size: 0x8)
    int64 CraftEXP;                                                                   // 0x0038 (size: 0x8)
    int64 PalBuildEXP;                                                                // 0x0040 (size: 0x8)
    int64 PalCraftEXP;                                                                // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FPalFarmCropGrowupProcessSet
{
    EPalFarmCropState State;                                                          // 0x0000 (size: 0x1)
    FComponentReference TargetCompRef;                                                // 0x0008 (size: 0x28)
    float ProcessRate;                                                                // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalFarmSkillFruitsTreeGrowupProcessSet
{
    EPalFarmSkillFruitsState State;                                                   // 0x0000 (size: 0x1)
    TArray<FComponentReference> TargetCompRefs;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalFastArenaWorldRankingRepInfoArray : public FFastArraySerializer
{
    TArray<FPalArenaWorldRankingRepInfo> Items;                                       // 0x0108 (size: 0x10)

}; // Size: 0x138

struct FPalFastBaseCampItemStackRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampItemStackRepInfo> Items;                                       // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastBaseCampMapObjectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampMapObjectRepInfo> Items;                                       // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FPalFastBaseCampPassiveEffectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampPassiveEffectRepInfo> Items;                                   // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FPalFastBaseCampWorkCollectionRepInfoArray : public FFastArraySerializer
{
    TArray<FPalBaseCampWorkCollectionRepInfo> Items;                                  // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastGuildPlayerInfoRepInfoArray : public FFastArraySerializer
{
    TArray<FPalGuildPlayerInfoRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastLabResearchEffectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalLabResearchEffectRepInfo> Items;                                       // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FPalFastLabResearchRepInfoArray : public FFastArraySerializer
{
    TArray<FPalLabResearchRepInfo> Items;                                             // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastMapObjectCharacterTeamMissionIndividualRepInfoArray : public FFastArraySerializer
{
    TArray<FPalMapObjectCharacterTeamMissionIndividualRepInfo> Items;                 // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastMapObjectModelEffectRepInfoArray : public FFastArraySerializer
{
    TArray<FPalMapObjectModelEffectRepInfo> Items;                                    // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastMapObjectModuleRepInfoArray : public FFastArraySerializer
{
    TArray<FPalMapObjectModuleRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastPalEggRepInfoArray : public FFastArraySerializer
{
    TArray<FPalEggRepInfo> Items;                                                     // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FPalFastPlayerTreasureMapPointRepInfoArray : public FFastArraySerializer
{
    TArray<FPalPlayerTreasureMapPointRepInfo> Items;                                  // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastStageModelRepInfoArray : public FFastArraySerializer
{
    TArray<FPalStageModelRepInfo> Items;                                              // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFastWorkAssignRepInfoArray : public FFastArraySerializer
{
    TArray<FPalWorkAssignRepInfo> Items;                                              // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFieldLotteryName : public FTableRowBase
{
    float ItemSlot1_ProbabilityPercent;                                               // 0x0008 (size: 0x4)
    float ItemSlot2_ProbabilityPercent;                                               // 0x000C (size: 0x4)
    float ItemSlot3_ProbabilityPercent;                                               // 0x0010 (size: 0x4)
    float ItemSlot4_ProbabilityPercent;                                               // 0x0014 (size: 0x4)
    float ItemSlot5_ProbabilityPercent;                                               // 0x0018 (size: 0x4)
    float ItemSlot6_ProbabilityPercent;                                               // 0x001C (size: 0x4)
    float ItemSlot7_ProbabilityPercent;                                               // 0x0020 (size: 0x4)
    float ItemSlot8_ProbabilityPercent;                                               // 0x0024 (size: 0x4)
    float ItemSlot9_ProbabilityPercent;                                               // 0x0028 (size: 0x4)
    float ItemSlot10_ProbabilityPercent;                                              // 0x002C (size: 0x4)
    float ItemSlot11_ProbabilityPercent;                                              // 0x0030 (size: 0x4)
    float ItemSlot12_ProbabilityPercent;                                              // 0x0034 (size: 0x4)
    float ItemSlot13_ProbabilityPercent;                                              // 0x0038 (size: 0x4)
    float ItemSlot14_ProbabilityPercent;                                              // 0x003C (size: 0x4)
    float ItemSlot15_ProbabilityPercent;                                              // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FPalFindEnemy
{
}; // Size: 0x1

struct FPalFindEnemyOption
{
    bool bCheckAimTargetSocket;                                                       // 0x0000 (size: 0x1)
    bool bTargetFriend;                                                               // 0x0001 (size: 0x1)
    bool bTargetNeutral;                                                              // 0x0002 (size: 0x1)
    bool bTargetPlayer;                                                               // 0x0003 (size: 0x1)
    bool bFilterByHateList;                                                           // 0x0004 (size: 0x1)
    bool bLineTrace;                                                                  // 0x0005 (size: 0x1)
    TEnumAsByte<ETraceTypeQuery> TraceType;                                           // 0x0006 (size: 0x1)

}; // Size: 0x7

struct FPalFishPondLotteryData : public FTableRowBase
{
    FName LotteryName;                                                                // 0x0008 (size: 0x8)
    float Weight;                                                                     // 0x0010 (size: 0x4)
    FName CharacterID;                                                                // 0x0014 (size: 0x8)
    int32 CharacterLevelMin;                                                          // 0x001C (size: 0x4)
    int32 CharacterLevelMax;                                                          // 0x0020 (size: 0x4)
    FName GainItemLotteryName;                                                        // 0x0024 (size: 0x8)

}; // Size: 0x30

struct FPalFishPondLotteryNameData : public FTableRowBase
{
    FName TextId;                                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalFishShadowDataRow : public FTableRowBase
{
    EPalFishShadowSizeType FishShadowSize;                                            // 0x0008 (size: 0x1)
    FName PalId;                                                                      // 0x000C (size: 0x8)
    FName BlueprintClassName;                                                         // 0x0014 (size: 0x8)
    TSoftClassPtr<APalFishShadow> FishShadowBlueprintClassSoft;                       // 0x0020 (size: 0x30)
    float MoveSpeedPerSec;                                                            // 0x0050 (size: 0x4)
    float SearchRadius;                                                               // 0x0054 (size: 0x4)
    float SearchProbability;                                                          // 0x0058 (size: 0x4)
    float KingPassiveRate;                                                            // 0x005C (size: 0x4)
    float RarePassiveRate;                                                            // 0x0060 (size: 0x4)
    EPalFishBattleBehaviorType BehaviorType;                                          // 0x0064 (size: 0x1)

}; // Size: 0x68

struct FPalFishShadowRareInfo
{
    FPalDataTableRowName_PassiveSkillData PassiveSkillId;                             // 0x0000 (size: 0x8)
    class UNiagaraSystem* RareEffect;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalFishSpawnPointData
{
    int32 PointIndex;                                                                 // 0x0000 (size: 0x4)
    FBoxSphereBounds PointBounds;                                                     // 0x0008 (size: 0x38)

}; // Size: 0x40

struct FPalFishingBaitDataRow : public FTableRowBase
{
    float HitBarSizeRate;                                                             // 0x0008 (size: 0x4)
    float MissFightAmountRate;                                                        // 0x000C (size: 0x4)
    float SuccessFightAmountRate;                                                     // 0x0010 (size: 0x4)
    float SearchProbabilityRate;                                                      // 0x0014 (size: 0x4)
    float StartProgressAmountPercent;                                                 // 0x0018 (size: 0x4)
    float EnemyAddDropPercent;                                                        // 0x001C (size: 0x4)
    float ItemLotteryAddDropPercent;                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalFishingCatchBattleInfo
{
    EPalFishBattleBehaviorType BehaviorType;                                          // 0x0000 (size: 0x1)
    float Difficulty;                                                                 // 0x0004 (size: 0x4)
    float HitBarSizeRate;                                                             // 0x0008 (size: 0x4)
    float SuccessFightAmountRate;                                                     // 0x000C (size: 0x4)
    float MissFightAmountRate;                                                        // 0x0010 (size: 0x4)
    float StartProgressAmountPercent;                                                 // 0x0014 (size: 0x4)
    float InitFishPos;                                                                // 0x0018 (size: 0x4)
    bool bIsFirstFishing;                                                             // 0x001C (size: 0x1)

}; // Size: 0x20

struct FPalFishingCatchBattleParameter
{
    float RequiredCatchAmount;                                                        // 0x0000 (size: 0x4)
    float DefaultProgressAmount;                                                      // 0x0004 (size: 0x4)
    float SuccessFightCatchAmount;                                                    // 0x0008 (size: 0x4)
    float MissFightCatchAmount;                                                       // 0x000C (size: 0x4)
    float CheckFishPickInterval;                                                      // 0x0010 (size: 0x4)
    float FishingInputAcceptTime;                                                     // 0x0014 (size: 0x4)
    float SinkWaitMinTime;                                                            // 0x0018 (size: 0x4)
    float SinkWaitMaxTime;                                                            // 0x001C (size: 0x4)
    float GaugeMaxSize;                                                               // 0x0020 (size: 0x4)
    float HitBarDefaultSize;                                                          // 0x0024 (size: 0x4)
    float HitBarMoveSpeed;                                                            // 0x0028 (size: 0x4)
    float HitBarMoveGravity;                                                          // 0x002C (size: 0x4)
    float HitBarMoveLiftForce;                                                        // 0x0030 (size: 0x4)
    float InitFishPos;                                                                // 0x0034 (size: 0x4)
    float InitHitBarPos;                                                              // 0x0038 (size: 0x4)
    float StartDelayTime;                                                             // 0x003C (size: 0x4)
    float OverrideSearchAreaRate;                                                     // 0x0040 (size: 0x4)
    float OverrideSearchProbability;                                                  // 0x0044 (size: 0x4)
    float FirstFishingMissFightCatchAmountRate;                                       // 0x0048 (size: 0x4)

}; // Size: 0x4C

struct FPalFishingCutsceneCharacterInfo
{
    FString NickName;                                                                 // 0x0000 (size: 0x10)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    FName CharacterID;                                                                // 0x0014 (size: 0x8)
    TArray<FName> PassiveSkillIds;                                                    // 0x0020 (size: 0x10)
    EPalGenderType GenderType;                                                        // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FPalFishingCutsceneInfo
{
    class USkeletalMesh* SkeletalMesh;                                                // 0x0000 (size: 0x8)
    TArray<class UMaterialInterface*> MeshMaterials;                                  // 0x0008 (size: 0x10)
    FVector MeshRelativeScale;                                                        // 0x0018 (size: 0x18)
    EPalSizeType CameraSizeType;                                                      // 0x0030 (size: 0x1)
    EPalFishingPlayerMotionType PlayerMotionType;                                     // 0x0031 (size: 0x1)
    FVector CameraTargetOffset;                                                       // 0x0038 (size: 0x18)
    float CameraTargetDistanceOffset;                                                 // 0x0050 (size: 0x4)
    bool bHasFishingRod;                                                              // 0x0054 (size: 0x1)
    class UAnimMontage* FishingCaughtMontage;                                         // 0x0058 (size: 0x8)
    FPalFishingCutsceneCharacterInfo CharacterInfo;                                   // 0x0060 (size: 0x38)

}; // Size: 0x98

struct FPalFishingRodInitParameter
{
    float FishingMaxDistance;                                                         // 0x0000 (size: 0x4)
    float FloatMoveSpeed;                                                             // 0x0004 (size: 0x4)
    float HitBarSizeRate;                                                             // 0x0008 (size: 0x4)
    float MissFightAmountRate;                                                        // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalFishingSpotLotteryDataRow : public FTableRowBase
{
    FName LotteryName;                                                                // 0x0008 (size: 0x8)
    float Weight;                                                                     // 0x0010 (size: 0x4)
    FName FishShadowId;                                                               // 0x0014 (size: 0x8)
    FName GainItemLotteryName;                                                        // 0x001C (size: 0x8)
    EPalOneDayTimeType OnlyTime;                                                      // 0x0024 (size: 0x1)
    int32 MinLevel;                                                                   // 0x0028 (size: 0x4)
    int32 MaxLevel;                                                                   // 0x002C (size: 0x4)
    int32 Difficulty;                                                                 // 0x0030 (size: 0x4)
    float DecreaseDurability;                                                         // 0x0034 (size: 0x4)
    EPalFishingSpotDifficultyType FishingSpotDifficulty;                              // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FPalFishingSpotLotteryNameDataRow : public FTableRowBase
{
    float RespawnTime;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalFishingSpotPalSpawnerData : public FTableRowBase
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0008 (size: 0x8)
    int32 LevelMin;                                                                   // 0x0010 (size: 0x4)
    int32 LevelMax;                                                                   // 0x0014 (size: 0x4)
    float OverrideBuoyancy;                                                           // 0x0018 (size: 0x4)
    float OverrideInWaterRate;                                                        // 0x001C (size: 0x4)

}; // Size: 0x20

struct FPalFishingSpotSaveData
{
    float RespawnTimeElapsed;                                                         // 0x0000 (size: 0x4)
    float RespawnTimeFinish;                                                          // 0x0004 (size: 0x4)
    int32 CurrentFishCount;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalFixedWeaponDestroySaveData
{
    TArray<FGuid> DestroyedWeapon;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalFixupParameterForSaveData
{
    TSet<FPalInstanceID> UsedInstanceIDs;                                             // 0x0000 (size: 0x50)
    TSet<FPalContainerId> UsedContainerIDs;                                           // 0x0050 (size: 0x50)
    TSet<FPalDynamicItemId> UsedDynamicItemIDs;                                       // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FPalFoliageGridInstanceMap
{
    TMap<class FPalFoliageInstanceId, class UPalFoliageInstance*> InstanceMap;        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalFoliageGridSaveData
{
    TMap<class FName, class FPalFoliageSaveData> ModelMap;                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalFoliageIdentifiableInfo
{
    FPalCellCoord CellCoord;                                                          // 0x0000 (size: 0x18)
    FName ModelId;                                                                    // 0x0018 (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalFoliageInstallData
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0018 (size: 0x18)
    FVector Scale3D;                                                                  // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FPalFoliageInstallDataArray
{
    TArray<FPalFoliageInstallData> InstallDataArray;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalFoliageInstallDataSet
{
}; // Size: 0x50

struct FPalFoliageInstanceId
{
    FGuid Guid;                                                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalFoliageInstanceInfo
{
}; // Size: 0x4

struct FPalFoliageInstanceRepInfo : public FFastArraySerializerItem
{
    FName FoliageTypeId;                                                              // 0x000C (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0014 (size: 0x10)
    class UPalFoliageInstance* Instance;                                              // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FPalFoliageInstanceRepInfoArray : public FFastArraySerializer
{
    TArray<FPalFoliageInstanceRepInfo> Items;                                         // 0x0108 (size: 0x10)

}; // Size: 0x148

struct FPalFoliageInstanceSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalFoliageInstanceTransform
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0018 (size: 0x18)
    float ScaleX;                                                                     // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalFoliageMasterData : public FTableRowBase
{
    FName ClassRefId;                                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalFoliagePresetData
{
    FPalDataTableRowName_MapObjectData FoliageMapObjectId;                            // 0x0000 (size: 0x8)
    int32 Hp;                                                                         // 0x0008 (size: 0x4)
    bool bNotDropItemIfDamagedOverMaxHp;                                              // 0x000C (size: 0x1)
    TArray<FPalMapObjectDropItemData> DamagedDropItems;                               // 0x0010 (size: 0x10)
    FPalDataTableRowName_ItemData DropItemId;                                         // 0x0020 (size: 0x8)
    int32 DropItemNum;                                                                // 0x0028 (size: 0x4)
    int32 DropEXP;                                                                    // 0x002C (size: 0x4)
    EPalMapObjectDestroyFXType DestroyFXType;                                         // 0x0030 (size: 0x1)
    float DistanceFromPlayerNotRespawn;                                               // 0x0034 (size: 0x4)
    int32 RespawnIntervalRealMinutes;                                                 // 0x0038 (size: 0x4)
    int32 RetryRespawnIntervalRealMinutes;                                            // 0x003C (size: 0x4)

}; // Size: 0x40

struct FPalFoliageSaveData : public FPalBinaryMemory
{
    TMap<class FPalFoliageInstanceId, class FPalFoliageInstanceSaveData> InstanceDataMap; // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FPalFoliageTypeReference : public FTableRowBase
{
    TSoftObjectPtr<UFoliageType> FoliageType;                                         // 0x0008 (size: 0x30)
    FPalDataTableRowName_MapObjectData FoliageMapObjectId;                            // 0x0038 (size: 0x8)
    int32 Hp;                                                                         // 0x0040 (size: 0x4)
    FPalDataTableRowName_ItemData DropItemId;                                         // 0x0044 (size: 0x8)
    int32 DropItemNum;                                                                // 0x004C (size: 0x4)
    EPalMapObjectDestroyFXType DestroyFXType;                                         // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FPalFoodRegeneEffectParameter
{
    EPalFoodStatusEffectType EffectType;                                              // 0x0000 (size: 0x1)
    int32 Value;                                                                      // 0x0004 (size: 0x4)
    int32 Interval;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalFoodRegeneInfo
{
    FName ItemId;                                                                     // 0x0000 (size: 0x8)
    int32 EffectTime;                                                                 // 0x0008 (size: 0x4)
    int32 RemainingTime;                                                              // 0x000C (size: 0x4)
    TArray<FPalFoodRegeneEffectParameter> RegeneEfectParameters;                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalFriendshipRankDataRow : public FTableRowBase
{
    int32 FriendshipRank;                                                             // 0x0008 (size: 0x4)
    int32 RequiredPoint;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalFunnelCharacterManagementInfo
{
    FPalInstanceID OwnerCharacterId;                                                  // 0x0000 (size: 0x30)
    class APalFunnelCharacter* FunnelCharacter;                                       // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalFunnelSkillModuleCollectItemSearchInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float Distance;                                                                   // 0x0018 (size: 0x4)
    float ElapsedTime;                                                                // 0x001C (size: 0x4)

}; // Size: 0x28

struct FPalGainStatusPointsItemDataRow : public FTableRowBase
{
    int32 MaxHP;                                                                      // 0x0008 (size: 0x4)
    int32 MaxSP;                                                                      // 0x000C (size: 0x4)
    int32 Power;                                                                      // 0x0010 (size: 0x4)
    int32 WorkSpeed;                                                                  // 0x0014 (size: 0x4)
    int32 MaxInventoryWeight;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalGainWorkSuitabilityRankItemDataRow : public FTableRowBase
{
    EPalWorkSuitability WorkSuitability;                                              // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FPalGameProgressPresetDataTableRow : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    int32 HPLevel;                                                                    // 0x000C (size: 0x4)
    int32 SPLevel;                                                                    // 0x0010 (size: 0x4)
    int32 AttackLevel;                                                                // 0x0014 (size: 0x4)
    int32 WorkLevel;                                                                  // 0x0018 (size: 0x4)
    int32 WeightLevel;                                                                // 0x001C (size: 0x4)
    int32 CaptureLevel;                                                               // 0x0020 (size: 0x4)
    TArray<FPalDebugOtomoPalInfo> OtomoPals;                                          // 0x0028 (size: 0x10)
    TArray<FPalDebugOtomoPalInfo> CapturedPals;                                       // 0x0038 (size: 0x10)
    TArray<FPalDebugItemCreateInfo> LoadoutItems;                                     // 0x0048 (size: 0x10)
    TArray<FPalDebugItemCreateInfo> Items;                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalGameSystemInitSequenceSet
{
    TArray<class UPalGameSystemInitSequenceBase*> InitSequences;                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalGameTimeSaveData
{
    int64 GameDateTimeTicks;                                                          // 0x0000 (size: 0x8)
    int64 RealDateTimeTicks;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalGamepadButtonImageDatabaseRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> XboxButtonImage;                                       // 0x0008 (size: 0x30)
    FKey Key;                                                                         // 0x0038 (size: 0x18)

}; // Size: 0x50

struct FPalGaugeInterpolationCalculator
{
    float CurrentValue;                                                               // 0x0000 (size: 0x4)
    float TargetValue;                                                                // 0x0004 (size: 0x4)
    bool bDirectionPositive;                                                          // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalGliderMeshDataRow : public FTableRowBase
{
    TSoftObjectPtr<USkeletalMesh> SkeletalMesh;                                       // 0x0008 (size: 0x30)
    TArray<TSoftObjectPtr<UMaterialInterface>> Materials;                             // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FPalGliderPalInfo
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0000 (size: 0x8)
    TArray<TSoftClassPtr<APalGliderObject>> GliderPalArray;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalGlobalPalStorageExportOption
{
    bool bRemoveOldData;                                                              // 0x0000 (size: 0x1)
    bool bForceExport;                                                                // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FPalGlobalPalStorageImportOption
{
    bool bOverwriteData;                                                              // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalGlobalPalStorageImportResultAdditionalData
{
    int32 OverwriteTargetSlotIndex;                                                   // 0x0000 (size: 0x4)
    int32 ImportedSlotIndex;                                                          // 0x0004 (size: 0x4)
    FPalIndividualCharacterSaveParameter OverwriteSaveParameter;                      // 0x0008 (size: 0x328)

}; // Size: 0x330

struct FPalGlobalPalStorageSaveParameter
{
    FPalIndividualCharacterSaveParameter SaveParameter;                               // 0x0000 (size: 0x328)
    FPalInstanceID InstanceId;                                                        // 0x0328 (size: 0x30)

}; // Size: 0x358

struct FPalGotStatusPoint
{
    FName StatusName;                                                                 // 0x0000 (size: 0x8)
    int32 StatusPoint;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalGrantCharacterRequestData
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    FName LotteryItemName;                                                            // 0x0010 (size: 0x8)
    class UPalIndividualCharacterHandle* IndividualHandle;                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalGrapplingGunInitParameter
{
    float CableShootSpeed;                                                            // 0x0000 (size: 0x4)
    float CableReturnSpeed;                                                           // 0x0004 (size: 0x4)
    float CableMaxLength;                                                             // 0x0008 (size: 0x4)
    float CharacterMoveSpeed;                                                         // 0x000C (size: 0x4)
    float NearCoolTimeDistance;                                                       // 0x0010 (size: 0x4)
    float NearCoolTimeRate;                                                           // 0x0014 (size: 0x4)
    class APalCharacter* ActionCharacter;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalGrapplingParameter
{
    FVector HitLocation;                                                              // 0x0000 (size: 0x18)
    FVector MoveEndLocation;                                                          // 0x0018 (size: 0x18)
    FVector HitNormal;                                                                // 0x0030 (size: 0x18)
    FVector StartVelocity;                                                            // 0x0048 (size: 0x18)
    float ElapsedTime;                                                                // 0x0060 (size: 0x4)

}; // Size: 0x68

struct FPalGroupCreateParameter
{
    EPalGroupType Type;                                                               // 0x0000 (size: 0x1)
    EPalOrganizationType OrganizationType;                                            // 0x0001 (size: 0x1)
    FString GroupName;                                                                // 0x0008 (size: 0x10)
    FGuid AdminPlayerUId;                                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPalGroupSaveData : public FPalBinaryMemory
{
    EPalGroupType GroupType;                                                          // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FPalGroupUpdateInfo
{
    FGuid EnterGroupId;                                                               // 0x0000 (size: 0x10)
    FGuid ExitGroupId;                                                                // 0x0010 (size: 0x10)
    TArray<FGuid> PlayerUIds;                                                         // 0x0020 (size: 0x10)
    TArray<FPalInstanceID> CharacterIndividualIds;                                    // 0x0030 (size: 0x10)
    TArray<FGuid> MapObjectInstanceIds_BaseCampPoint;                                 // 0x0040 (size: 0x10)
    TArray<FGuid> BaseCampIds;                                                        // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FPalGuildCharacterTeamMissionInfo
{
    FName MissionId;                                                                  // 0x0000 (size: 0x8)
    bool bEnableChallenge;                                                            // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalGuildEnterRequestLogInfo
{
    TArray<FDateTime> RequestAtArray;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalGuildExpeditionSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalGuildExtraSaveData : public FPalBinaryMemory
{
    FPalGuildItemStorageSaveData GuildItemStorage;                                    // 0x0020 (size: 0x20)
    FPalGuildLabSaveData Lab;                                                         // 0x0040 (size: 0x20)
    FPalGuildExpeditionSaveData Expedition;                                           // 0x0060 (size: 0x20)

}; // Size: 0x80

struct FPalGuildItemStorageSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalGuildLabCompleteLogDisplayData
{
    FName CompletedResearchId;                                                        // 0x0000 (size: 0x8)
    EPalLogType Type;                                                                 // 0x0008 (size: 0x1)
    EPalLogContentToneType ToneType;                                                  // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FPalGuildLabEffectRateGetParameter
{
}; // Size: 0x3

struct FPalGuildLabRequestDebugParameter
{
    bool bNotConsumeMaterials;                                                        // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalGuildLabSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalGuildPalStorageInfo
{
}; // Size: 0x38

struct FPalGuildPlayerInfo
{
    EPalGuildPlayerStatus Status;                                                     // 0x0000 (size: 0x1)
    FDateTime LastOnlineRealTime;                                                     // 0x0008 (size: 0x8)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalGuildPlayerInfoRepInfo : public FFastArraySerializerItem
{
    FGuid PlayerUId;                                                                  // 0x000C (size: 0x10)
    FPalGuildPlayerInfo PlayerInfo;                                                   // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FPalHeatSourceInfo
{
    int32 HeatLevel_DayTime;                                                          // 0x0000 (size: 0x4)
    int32 HeatLevel_NightTime;                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalHitCollisionSetupParameter
{
}; // Size: 0x20

struct FPalHoveringWaterParameter
{
    bool EnableIdleHoveringWaterEffect;                                               // 0x0000 (size: 0x1)
    float Rate;                                                                       // 0x0004 (size: 0x4)
    float Delay;                                                                      // 0x0008 (size: 0x4)
    float Duration;                                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalIncidentBroadcastParameter
{
    EPalInvaderType InvaderType;                                                      // 0x0000 (size: 0x1)
    class UPalBaseCampModel* TargetBaseCamp;                                          // 0x0008 (size: 0x8)
    FPalInvaderDatabaseRow ChosenInvaderData;                                         // 0x0010 (size: 0x90)
    FGuid GroupGuid;                                                                  // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FPalIncidentExecutionSettings
{
    bool bCanExecuteMultiple;                                                         // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalIncidentIdParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName IncidentType;                                                               // 0x0008 (size: 0x8)
    FName Option;                                                                     // 0x0010 (size: 0x8)
    TArray<FName> Args;                                                               // 0x0018 (size: 0x10)
    TArray<FName> Options;                                                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPalIncidentInitializeParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName Option;                                                                     // 0x0008 (size: 0x8)
    class UObject* OccuredObject;                                                     // 0x0010 (size: 0x8)
    class UObject* OwnerObject;                                                       // 0x0018 (size: 0x8)
    class UPalIncidentDynamicParameter* DynamicParameter;                             // 0x0020 (size: 0x8)
    class UPalIncidentBase* ParentObject;                                             // 0x0028 (size: 0x8)

}; // Size: 0x38

struct FPalIncidentNotifyParameter
{
    FName IncidentId;                                                                 // 0x0000 (size: 0x8)
    FName IncidentType;                                                               // 0x0008 (size: 0x8)
    class UObject* OccuredObject;                                                     // 0x0010 (size: 0x8)
    class UObject* OwnerObject;                                                       // 0x0018 (size: 0x8)
    class UPalIncidentBase* IncidentObject;                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalIncidentParameterDataTableRow : public FTableRowBase
{
    FName Option;                                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalIncidentSystemFunctionAccessor
{
}; // Size: 0xC0

struct FPalIndividualCharacterCacheParameter
{
    FGuid GroupId;                                                                    // 0x0000 (size: 0x10)
    bool bSleeping;                                                                   // 0x0010 (size: 0x1)
    bool bContinueSleepingUntilFullRecovery;                                          // 0x0011 (size: 0x1)
    FGuid InvaderTargetBaseCampId;                                                    // 0x0018 (size: 0x10)
    EPalInvaderType InvaderType;                                                      // 0x0028 (size: 0x1)
    bool bIsInArena;                                                                  // 0x0029 (size: 0x1)
    float ArenaDamageRate;                                                            // 0x002C (size: 0x4)
    int32 OverrideLevel;                                                              // 0x0030 (size: 0x4)
    EPalGroupType GroupType;                                                          // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FPalIndividualCharacterContainerReplicationParameter
{
}; // Size: 0x60

struct FPalIndividualCharacterEquipItemContainerHandler
{
}; // Size: 0x8

struct FPalIndividualCharacterHandleId : public FFastArraySerializerItem
{
    FPalInstanceID HandleId;                                                          // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalIndividualCharacterSaveParameter
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    FName UniqueNPCID;                                                                // 0x0008 (size: 0x8)
    EPalGenderType Gender;                                                            // 0x0010 (size: 0x1)
    TSubclassOf<class APalCharacter> CharacterClass;                                  // 0x0018 (size: 0x8)
    uint8 Level;                                                                      // 0x0020 (size: 0x1)
    uint8 Rank;                                                                       // 0x0021 (size: 0x1)
    uint16 RankUpExp;                                                                 // 0x0022 (size: 0x2)
    uint8 Rank_HP;                                                                    // 0x0024 (size: 0x1)
    uint8 Rank_Attack;                                                                // 0x0025 (size: 0x1)
    uint8 Rank_Defence;                                                               // 0x0026 (size: 0x1)
    uint8 Rank_CraftSpeed;                                                            // 0x0027 (size: 0x1)
    int64 Exp;                                                                        // 0x0028 (size: 0x8)
    FString NickName;                                                                 // 0x0030 (size: 0x10)
    FString FilteredNickName;                                                         // 0x0040 (size: 0x10)
    bool IsRarePal;                                                                   // 0x0050 (size: 0x1)
    TArray<EPalWazaID> EquipWaza;                                                     // 0x0058 (size: 0x10)
    TArray<EPalWazaID> MasteredWaza;                                                  // 0x0068 (size: 0x10)
    FFixedPoint64 Hp;                                                                 // 0x0078 (size: 0x8)
    uint8 Talent_HP;                                                                  // 0x0080 (size: 0x1)
    uint8 Talent_Melee;                                                               // 0x0081 (size: 0x1)
    uint8 Talent_Shot;                                                                // 0x0082 (size: 0x1)
    uint8 Talent_Defense;                                                             // 0x0083 (size: 0x1)
    float FullStomach;                                                                // 0x0084 (size: 0x4)
    EPalStatusPhysicalHealthType PhysicalHealth;                                      // 0x0088 (size: 0x1)
    EPalBaseCampWorkerSickType WorkerSick;                                            // 0x0089 (size: 0x1)
    TArray<FName> PassiveSkillList;                                                   // 0x0090 (size: 0x10)
    int32 DyingTimer;                                                                 // 0x00A0 (size: 0x4)
    FFixedPoint64 MP;                                                                 // 0x00A8 (size: 0x8)
    bool IsPlayer;                                                                    // 0x00B0 (size: 0x1)
    FDateTime OwnedTime;                                                              // 0x00B8 (size: 0x8)
    FGuid OwnerPlayerUId;                                                             // 0x00C0 (size: 0x10)
    TArray<FGuid> OldOwnerPlayerUIds;                                                 // 0x00D0 (size: 0x10)
    FFixedPoint64 MaxHP;                                                              // 0x00E0 (size: 0x8)
    int32 Support;                                                                    // 0x00E8 (size: 0x4)
    int32 CraftSpeed;                                                                 // 0x00EC (size: 0x4)
    TArray<FPalWorkSuitabilityInfo> CraftSpeeds;                                      // 0x00F0 (size: 0x10)
    FFixedPoint64 ShieldHP;                                                           // 0x0100 (size: 0x8)
    FFixedPoint64 ShieldMaxHP;                                                        // 0x0108 (size: 0x8)
    bool bApplyShieldDamage;                                                          // 0x0110 (size: 0x1)
    FFixedPoint64 MaxMP;                                                              // 0x0118 (size: 0x8)
    FFixedPoint64 MaxSP;                                                              // 0x0120 (size: 0x8)
    EPalStatusHungerType HungerType;                                                  // 0x0128 (size: 0x1)
    float SanityValue;                                                                // 0x012C (size: 0x4)
    EPalBaseCampWorkerEventType BaseCampWorkerEventType;                              // 0x0130 (size: 0x1)
    float BaseCampWorkerEventProgressTime;                                            // 0x0134 (size: 0x4)
    FPalContainerId ItemContainerId;                                                  // 0x0138 (size: 0x10)
    FPalContainerId EquipItemContainerId;                                             // 0x0148 (size: 0x10)
    FPalCharacterSlotId SlotId;                                                       // 0x0158 (size: 0x14)
    float MaxFullStomach;                                                             // 0x016C (size: 0x4)
    float FullStomachDecreaseRate_Tribe;                                              // 0x0170 (size: 0x4)
    uint16 UnusedStatusPoint;                                                         // 0x0174 (size: 0x2)
    TArray<FPalGotStatusPoint> GotStatusPointList;                                    // 0x0178 (size: 0x10)
    TArray<FPalGotStatusPoint> GotExStatusPointList;                                  // 0x0188 (size: 0x10)
    FFloatContainer DecreaseFullStomachRates;                                         // 0x0198 (size: 0x10)
    FFloatContainer AffectSanityRates;                                                // 0x01A8 (size: 0x10)
    FFloatContainer CraftSpeedRates;                                                  // 0x01B8 (size: 0x10)
    FVector LastJumpedLocation;                                                       // 0x01C8 (size: 0x18)
    FName FoodWithStatusEffect;                                                       // 0x01E0 (size: 0x8)
    int32 Tiemr_FoodWithStatusEffect;                                                 // 0x01E8 (size: 0x4)
    FPalFoodRegeneInfo FoodRegeneEffectInfo;                                          // 0x01F0 (size: 0x20)
    EPalWorkSuitability CurrentWorkSuitability;                                       // 0x0210 (size: 0x1)
    FPalWorkSuitabilityPreferenceInfo WorkSuitabilityOptionInfo;                      // 0x0218 (size: 0x18)
    bool bAppliedDeathPenarty;                                                        // 0x0230 (size: 0x1)
    bool bEnablePlayerRespawnInHardcore;                                              // 0x0231 (size: 0x1)
    float PalReviveTimer;                                                             // 0x0234 (size: 0x4)
    uint8 VoiceID;                                                                    // 0x0238 (size: 0x1)
    FGuid SkinAppliedCharacterId;                                                     // 0x023C (size: 0x10)
    FName SkinName;                                                                   // 0x024C (size: 0x8)
    bool IsFavoritePal;                                                               // 0x0254 (size: 0x1)
    uint8 FavoriteIndex;                                                              // 0x0255 (size: 0x1)
    FGuid MapObjectConcreteInstanceIdAssignedToExpedition;                            // 0x0258 (size: 0x10)
    FPalArenaCharacterRestoreParameter ArenaRestoreParameter;                         // 0x0268 (size: 0x48)
    TArray<FPalWorkSuitabilityInfo> GotWorkSuitabilityAddRankList;                    // 0x02B0 (size: 0x10)
    FGuid LastNickNameModifierPlayerUid;                                              // 0x02C0 (size: 0x10)
    bool bImportedCharacter;                                                          // 0x02D0 (size: 0x1)
    int32 FriendshipPoint;                                                            // 0x02D4 (size: 0x4)
    int32 FriendshipOtomoSec;                                                         // 0x02D8 (size: 0x4)
    int32 FriendshipActiveOtomoSec;                                                   // 0x02DC (size: 0x4)
    int32 FriendshipBasecampSec;                                                      // 0x02E0 (size: 0x4)
    bool bFavoriteChangedByFriendship;                                                // 0x02E4 (size: 0x1)
    int32 ArenaRankPoint;                                                             // 0x02E8 (size: 0x4)
    bool bDisableSaleInPalLost;                                                       // 0x02EC (size: 0x1)
    FPalIndividualCharacterCacheParameter Dynamic;                                    // 0x02F0 (size: 0x38)

}; // Size: 0x328

struct FPalIndividualCharacterSaveParameterSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalIndividualCharacterSlotResultInfo
{
}; // Size: 0x20

struct FPalIndividualCharacterSlotUpdateInfo
{
}; // Size: 0x68

struct FPalInsideBaseCampUI_DisplayItemInfo
{
    bool isShowWhenNothingItem;                                                       // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FPalInstanceID
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    FGuid InstanceId;                                                                 // 0x0010 (size: 0x10)
    FString DebugName;                                                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalInteractComponentOverlapComponentSet
{
    TSet<UPrimitiveComponent*> Components;                                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalInteractLockSettingData
{
    FPalDataTableRowName_ItemData ItemName;                                           // 0x0000 (size: 0x8)
    int32 requireNum;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalInteractLockSettingDataSet
{
    TArray<FPalInteractLockSettingData> ItemLockSettingData;                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalInteractiveObjectActionBy
{
    class AActor* InteractingActor;                                                   // 0x0000 (size: 0x8)
    int32 InteractId;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalInteractiveObjectActionInfoData
{
    EPalInteractiveObjectIndicatorType IndicatorType;                                 // 0x0000 (size: 0x1)
    EPalInteractiveObjectButtonType buttonType;                                       // 0x0001 (size: 0x1)
    float longPushTime;                                                               // 0x0004 (size: 0x4)
    EPalActionType ActionType;                                                        // 0x0008 (size: 0x1)
    bool bValid;                                                                      // 0x0009 (size: 0x1)
    bool bLockRiding;                                                                 // 0x000A (size: 0x1)
    bool isInputComsume;                                                              // 0x000B (size: 0x1)
    bool bCanToggle;                                                                  // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalInteractiveObjectActionInfoSet
{
    FPalInteractiveObjectActionInfoData Interact1_Indicator;                          // 0x0000 (size: 0x10)
    FPalInteractiveObjectActionInfoData Interact2_Indicator;                          // 0x0010 (size: 0x10)
    FPalInteractiveObjectActionInfoData Interact3_Indicator;                          // 0x0020 (size: 0x10)
    FPalInteractiveObjectActionInfoData Interact4_Indicator;                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalInvaderDatabaseRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    EPalBiomeType BiomeID;                                                            // 0x0010 (size: 0x1)
    int32 InvadeGradeMin;                                                             // 0x0014 (size: 0x4)
    int32 InvadeGradeMax;                                                             // 0x0018 (size: 0x4)
    float Weight;                                                                     // 0x001C (size: 0x4)
    FName CharactorID_A;                                                              // 0x0020 (size: 0x8)
    FName Otomo_A;                                                                    // 0x0028 (size: 0x8)
    int32 LevelMin_A;                                                                 // 0x0030 (size: 0x4)
    int32 LevelMax_A;                                                                 // 0x0034 (size: 0x4)
    int32 Number_A;                                                                   // 0x0038 (size: 0x4)
    FName CharactorID_B;                                                              // 0x003C (size: 0x8)
    FName Otomo_B;                                                                    // 0x0044 (size: 0x8)
    int32 LevelMin_B;                                                                 // 0x004C (size: 0x4)
    int32 LevelMax_B;                                                                 // 0x0050 (size: 0x4)
    int32 Number_B;                                                                   // 0x0054 (size: 0x4)
    FName CharactorID_C;                                                              // 0x0058 (size: 0x8)
    FName Otomo_C;                                                                    // 0x0060 (size: 0x8)
    int32 LevelMin_C;                                                                 // 0x0068 (size: 0x4)
    int32 LevelMax_C;                                                                 // 0x006C (size: 0x4)
    int32 Number_C;                                                                   // 0x0070 (size: 0x4)
    FName CharactorID_D;                                                              // 0x0074 (size: 0x8)
    FName Otomo_D;                                                                    // 0x007C (size: 0x8)
    int32 LevelMin_D;                                                                 // 0x0084 (size: 0x4)
    int32 LevelMax_D;                                                                 // 0x0088 (size: 0x4)
    int32 Number_D;                                                                   // 0x008C (size: 0x4)

}; // Size: 0x90

struct FPalInvaderSaveData
{
    bool bIsInvading;                                                                 // 0x0000 (size: 0x1)
    float CoolTimeElapsed;                                                            // 0x0004 (size: 0x4)
    float CoolTimeFinish;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalInvaderSpawnCharacterParameter
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    FName Otomo;                                                                      // 0x000C (size: 0x8)
    bool bIsVisitorLeader;                                                            // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPalInvaderStartPointInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    EPalBiomeType BiomeType;                                                          // 0x0018 (size: 0x1)
    class AActor* SourceActor;                                                        // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalItemAndNum
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 Num;                                                                        // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FPalItemAndSlot
{
    FPalItemId ItemId;                                                                // 0x0000 (size: 0x28)
    int32 Num;                                                                        // 0x0028 (size: 0x4)
    FPalItemSlotId SlotId;                                                            // 0x002C (size: 0x14)

}; // Size: 0x40

struct FPalItemAndSlotUpdateContentSet
{
    TArray<FPalItemAndSlot> UpdateContents;                                           // 0x0000 (size: 0x10)
    TArray<FPalStaticItemIdAndDynamicItemDataSet> UpdateDynamicItems;                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FPalItemBoothTradeDealingInfo
{
}; // Size: 0x7C

struct FPalItemBoothTradeInfo
{
    FPalItemAndNum Product;                                                           // 0x0000 (size: 0x2C)
    FPalItemAndNum Cost;                                                              // 0x002C (size: 0x2C)
    FGuid SellerPlayerUId;                                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalItemContainerBelongInfo : public FPalContainerBelongInfo
{
    FGuid GroupId;                                                                    // 0x0008 (size: 0x10)
    bool bControllableOthers;                                                         // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalItemContainerCreateParameter
{
    int32 SlotNum;                                                                    // 0x0000 (size: 0x4)
    FPalItemPermission Permission;                                                    // 0x0008 (size: 0x30)
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0038 (size: 0x20)
    TArray<FPalItemAndNum> InitialItems;                                              // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalItemContainerFilter
{
    TArray<FName> FilterOffList;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalItemContainerInfo : public FPalContainerInfo
{
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0020 (size: 0x20)
    FPalItemPermission Permission;                                                    // 0x0040 (size: 0x30)

}; // Size: 0x70

struct FPalItemContainerSaveData : public FPalBinaryMemory
{
    FPalItemContainerBelongInfo BelongInfo;                                           // 0x0020 (size: 0x20)
    TArray<FPalItemSlotSaveData> Slots;                                               // 0x0040 (size: 0x10)
    int32 SlotNum;                                                                    // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FPalItemCreateParameter
{
    FPalPassiveSkillAssignInfo PassiveSkillAssignInfo;                                // 0x0000 (size: 0x18)
    FName CharacterID;                                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalItemData
{
    class UPalStaticItemDataBase* StaticData;                                         // 0x0000 (size: 0x8)
    class UPalDynamicItemDataBase* DynamicData;                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalItemDropOutInfo
{
    TArray<class UPalMapObjectSpawnRequestHandler*> OutSpawnRequestHandlers;          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalItemFilterPreference
{
    TMap<class FName, class FPalItemFilterPreferenceItem> PreferenceMap;              // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalItemFilterPreferenceItem
{
    FDataTableRowHandle FilterTextId;                                                 // 0x0000 (size: 0x10)
    TArray<EPalItemTypeA> TypeA;                                                      // 0x0010 (size: 0x10)
    TArray<EPalItemTypeB> TypeB;                                                      // 0x0020 (size: 0x10)
    TArray<EPalItemTypeB> TypeB_Except;                                               // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPalItemFlowInSplineInfo
{
    class AActor* ItemActor;                                                          // 0x0000 (size: 0x8)
    float ProgressTime;                                                               // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalItemId
{
    FName StaticId;                                                                   // 0x0000 (size: 0x8)
    FPalDynamicItemId DynamicId;                                                      // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FPalItemLotteryData : public FTableRowBase
{
    FName FieldName;                                                                  // 0x0008 (size: 0x8)
    int32 SlotNo;                                                                     // 0x0010 (size: 0x4)
    float WeightInSlot;                                                               // 0x0014 (size: 0x4)
    FName StaticItemId;                                                               // 0x0018 (size: 0x8)
    int32 MinNum;                                                                     // 0x0020 (size: 0x4)
    int32 MaxNum;                                                                     // 0x0024 (size: 0x4)
    int32 NumUnit;                                                                    // 0x0028 (size: 0x4)
    EPalMapObjectTreasureGradeType TreasureBoxGrade;                                  // 0x002C (size: 0x1)

}; // Size: 0x30

struct FPalItemOperationInfo_Move
{
    FPalInstanceID ExecutorIndividualId;                                              // 0x0000 (size: 0x30)
    TArray<FPalItemId> ItemIds;                                                       // 0x0030 (size: 0x10)
    TArray<FPalItemSlotId> FromSlotIds;                                               // 0x0040 (size: 0x10)
    FPalContainerId ToContainerId;                                                    // 0x0050 (size: 0x10)
    TArray<FPalItemSlotId> ToSlotIds;                                                 // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FPalItemOperationOptions
{
}; // Size: 0x1

struct FPalItemPalEggDataHandle
{
    TArray<FPalDataTableRowName_ItemData> ItemRowNameArray;                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalItemPermission
{
    TArray<EPalItemTypeA> PermissionTypeA;                                            // 0x0000 (size: 0x10)
    TArray<EPalItemTypeB> PermissionTypeB;                                            // 0x0010 (size: 0x10)
    TArray<FName> PermissionItemStaticIds;                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalItemRecipe : public FTableRowBase
{
    FName Product_Id;                                                                 // 0x0008 (size: 0x8)
    int32 Product_Count;                                                              // 0x0010 (size: 0x4)
    float WorkAmount;                                                                 // 0x0014 (size: 0x4)
    int32 WorkableAttribute;                                                          // 0x0018 (size: 0x4)
    FName UnlockItemID;                                                               // 0x001C (size: 0x8)
    FName Material1_Id;                                                               // 0x0024 (size: 0x8)
    int32 Material1_Count;                                                            // 0x002C (size: 0x4)
    FName Material2_Id;                                                               // 0x0030 (size: 0x8)
    int32 Material2_Count;                                                            // 0x0038 (size: 0x4)
    FName Material3_Id;                                                               // 0x003C (size: 0x8)
    int32 Material3_Count;                                                            // 0x0044 (size: 0x4)
    FName Material4_Id;                                                               // 0x0048 (size: 0x8)
    int32 Material4_Count;                                                            // 0x0050 (size: 0x4)
    FName Material5_Id;                                                               // 0x0054 (size: 0x8)
    int32 Material5_Count;                                                            // 0x005C (size: 0x4)
    EPalEnergyType EnergyType;                                                        // 0x0060 (size: 0x1)
    int32 EnergyAmount;                                                               // 0x0064 (size: 0x4)
    float CraftExpRate;                                                               // 0x0068 (size: 0x4)
    int32 Editor_RowNameHash;                                                         // 0x006C (size: 0x4)

}; // Size: 0x70

struct FPalItemRecipeMaterialInfo
{
    FName MaterialID;                                                                 // 0x0000 (size: 0x8)
    int32 MaterialCount;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalItemShopCreateDataRow : public FTableRowBase
{
    TArray<FPalItemShopCreateDataStruct> productDataArray;                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalItemShopCreateDataStruct
{
    FName StaticItemId;                                                               // 0x0000 (size: 0x8)
    EPalItemShopProductType ProductType;                                              // 0x0008 (size: 0x1)
    int32 OverridePrice;                                                              // 0x000C (size: 0x4)
    int32 ProductNum;                                                                 // 0x0010 (size: 0x4)
    int32 Stock;                                                                      // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalItemShopCreateIntermediateDataRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    FName StaticItemId;                                                               // 0x0010 (size: 0x8)
    EPalItemShopProductType ProductType;                                              // 0x0018 (size: 0x1)
    int32 OverridePrice;                                                              // 0x001C (size: 0x4)
    int32 ProductNum;                                                                 // 0x0020 (size: 0x4)
    int32 Stock;                                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FPalItemShopLotteryDataRow : public FTableRowBase
{
    TArray<FPalItemShopLotteryDataStruct> lotteryDataArray;                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalItemShopLotteryDataStruct
{
    FName ShopGroupName;                                                              // 0x0000 (size: 0x8)
    int32 Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalItemShopLotteryIntermediateDataRow : public FTableRowBase
{
    FName GroupName;                                                                  // 0x0008 (size: 0x8)
    FName ShopGroupName;                                                              // 0x0010 (size: 0x8)
    int32 Weight;                                                                     // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalItemShopSettingDataRow : public FTableRowBase
{
    FName CurrencyItemID;                                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalItemSlotId
{
    FPalContainerId ContainerId;                                                      // 0x0000 (size: 0x10)
    int32 SlotIndex;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalItemSlotIdAndNum
{
    FPalItemSlotId SlotId;                                                            // 0x0000 (size: 0x14)
    int32 Num;                                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalItemSlotSaveData : public FPalBinaryMemory
{
    int32 SlotIndex;                                                                  // 0x0020 (size: 0x4)
    FPalItemId ItemId;                                                                // 0x0024 (size: 0x28)
    int32 StackCount;                                                                 // 0x004C (size: 0x4)

}; // Size: 0x50

struct FPalItemThrottleAutoCounter
{
    TWeakObjectPtr<class UObject> WorldContext;                                       // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalItemVisualModelFXInfo
{
    class UNiagaraSystem* NiagaraSystem;                                              // 0x0000 (size: 0x8)
    FTransform LocalTransform;                                                        // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FPalKeyAction
{
    FName ActionName;                                                                 // 0x0000 (size: 0x8)
    EPalKeyConfigAxisFilterType FilterType;                                           // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FPalKeyConfigKeys
{
    FKey MainKey;                                                                     // 0x0000 (size: 0x18)
    FKey SecondaryKey;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FPalKeyConfigSettings
{
    TMap<class FName, class FPalKeyConfigKeys> MouseAndKeyboardActionMappings;        // 0x0000 (size: 0x50)
    TArray<FPalAxisKeyConfigKeys> MouseAndKeyboardAxisMappings;                       // 0x0050 (size: 0x10)
    TMap<class FName, class FPalKeyConfigKeys> GamePadActionMappings;                 // 0x0060 (size: 0x50)
    TArray<FPalAxisKeyConfigKeys> GamePadAxisMappings;                                // 0x00B0 (size: 0x10)
    TMap<class FName, class FKey> MouseAndKeyboardUIInputMappings;                    // 0x00C0 (size: 0x50)
    TMap<class FName, class FKey> GamePadUIInputMappings;                             // 0x0110 (size: 0x50)

}; // Size: 0x160

struct FPalKillLogDisplayData
{
    EPalKillLogDisplayType LogType;                                                   // 0x0000 (size: 0x1)
    FString AttackerName;                                                             // 0x0008 (size: 0x10)
    FName AttackerCharacterID;                                                        // 0x0018 (size: 0x8)
    FName AttackerUniqueNPCID;                                                        // 0x0020 (size: 0x8)
    FGuid AttackerPlayerUID;                                                          // 0x0028 (size: 0x10)
    FString KilledCharacterName;                                                      // 0x0038 (size: 0x10)
    FName KilledCharacterID;                                                          // 0x0048 (size: 0x8)
    FName KilledUniqueNPCID;                                                          // 0x0050 (size: 0x8)
    FGuid KilledPlayerUID;                                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FPalLabResearchEffectRepInfo : public FFastArraySerializerItem
{
    EPalPassiveSkillEffectType EffectType;                                            // 0x000C (size: 0x1)
    FPalPassiveSkillEffectKeyOption EffectOption;                                     // 0x000D (size: 0x2)
    float EffectValue;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalLabResearchMasterData : public FTableRowBase
{
    FName TextId;                                                                     // 0x0008 (size: 0x8)
    EPalWorkSuitability LabCategoryWorkSuitability;                                   // 0x0010 (size: 0x1)
    EPalLabCategorySubType LabCategorySubType;                                        // 0x0011 (size: 0x1)
    FName AssignDefineId;                                                             // 0x0014 (size: 0x8)
    int32 RequiredWorkAmount;                                                         // 0x001C (size: 0x4)
    FName ResearchSpaceBlueprintClassName;                                            // 0x0020 (size: 0x8)
    TSoftClassPtr<APalBuildObjectLabResearchSpace> ResearchSpaceClassPath;            // 0x0028 (size: 0x30)
    FName RequiredResearchId;                                                         // 0x0058 (size: 0x8)
    FName Material1_Id;                                                               // 0x0060 (size: 0x8)
    int32 Material1_Count;                                                            // 0x0068 (size: 0x4)
    FName Material2_Id;                                                               // 0x006C (size: 0x8)
    int32 Material2_Count;                                                            // 0x0074 (size: 0x4)
    FName Material3_Id;                                                               // 0x0078 (size: 0x8)
    int32 Material3_Count;                                                            // 0x0080 (size: 0x4)
    FName Material4_Id;                                                               // 0x0084 (size: 0x8)
    int32 Material4_Count;                                                            // 0x008C (size: 0x4)
    EPalPassiveSkillEffectType EffectType;                                            // 0x0090 (size: 0x1)
    float EffectValue;                                                                // 0x0094 (size: 0x4)
    EPalWorkSuitability EffectOptionWorkSuitability;                                  // 0x0098 (size: 0x1)
    EPalPassiveSkillEffectTargetItemType EffectOptionItemType;                        // 0x0099 (size: 0x1)
    FName EffectDescriptionTextIdOverwrite;                                           // 0x009C (size: 0x8)
    bool bIsEssential;                                                                // 0x00A4 (size: 0x1)

}; // Size: 0xA8

struct FPalLabResearchRepInfo : public FFastArraySerializerItem
{
    FName ResearchId;                                                                 // 0x000C (size: 0x8)
    float WorkAmount;                                                                 // 0x0014 (size: 0x4)
    float RequiredWorkAmount;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalLanternItemSetting
{
    int32 Priority;                                                                   // 0x0000 (size: 0x4)
    TSoftClassPtr<APalPlayerLampBase> SoftLanternClass;                               // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalLoadoutSummonData
{
    class UPalDynamicItemDataBase* DynamicData;                                       // 0x0000 (size: 0x8)
    int32 SummonNum;                                                                  // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalLoadoutSynchronalizedData
{
    TSoftClassPtr<AActor> actorClass;                                                 // 0x0000 (size: 0x30)
    FPalItemId ItemId;                                                                // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FPalLocalQuestLocationData
{
    FPalQuestTrackingLocationSettingData SettingData;                                 // 0x0000 (size: 0x40)
    TArray<FGuid> LocationIdArray;                                                    // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FPalLocalSaveData
{
    TMap<EPalTribeID, int32> Local_ActivateOtomoCount;                                // 0x0000 (size: 0x50)
    TMap<class EPalTribeID, class bool> Local_PalEncountFlag;                         // 0x0050 (size: 0x50)
    TMap<class FName, class bool> Local_NoteCheckedFlag;                              // 0x00A0 (size: 0x50)
    TMap<EPalPlayerInventoryType, int32> Local_LoadoutSelectedIndexMap;               // 0x00F0 (size: 0x50)
    TMap<FName, int32> Local_NewUnlockedBuilds;                                       // 0x0140 (size: 0x50)
    bool Local_IsBuildMenuChecked;                                                    // 0x0190 (size: 0x1)
    TMap<FName, int32> Local_NPCTalkCountMap;                                         // 0x0198 (size: 0x50)
    TMap<class FName, class bool> Local_NewUnlockedTechs;                             // 0x01E8 (size: 0x50)
    TMap<class FName, class bool> Local_ShowedCutsceneFlag;                           // 0x0238 (size: 0x50)
    int32 Local_PlayTime;                                                             // 0x0288 (size: 0x4)
    int32 Local_DoctorSurgiCount;                                                     // 0x028C (size: 0x4)
    int32 Local_DoctorLastSurgiDay;                                                   // 0x0290 (size: 0x4)
    TMap<FString, int32> Local_ItemRequestCircumCountMap;                             // 0x0298 (size: 0x50)
    TMap<class FName, class bool> Local_NpcItemCircumCount;                           // 0x02E8 (size: 0x50)
    TMap<class FName, class bool> Local_PalDisplayNPCDataTableProgress;               // 0x0338 (size: 0x50)
    TMap<class FName, class bool> Local_NpcPalDexRewardCount;                         // 0x0388 (size: 0x50)
    TMap<class FName, class bool> Local_NpcBossDefeatRewardCount;                     // 0x03D8 (size: 0x50)
    TMap<class FName, class bool> Local_NpcPalCaptureRewardCount;                     // 0x0428 (size: 0x50)
    TArray<uint8> worldMapMaskTexture;                                                // 0x0478 (size: 0x10)
    TArray<uint8> WorldMapMaskTextureV4;                                              // 0x0488 (size: 0x10)
    TArray<FPalCustomMarkerSaveData> Local_CustomMarkerSaveData;                      // 0x0498 (size: 0x10)
    TArray<FPalTutorialTriggerSaveData> Local_TutorialTriggerSaveData;                // 0x04A8 (size: 0x10)
    TArray<FPalCompletedQuestSaveData> Local_CompletedTutorialQuestSaveData;          // 0x04B8 (size: 0x10)
    TArray<FPalOrderedQuestSaveData> Local_OrderedTutorialQuestSaveData;              // 0x04C8 (size: 0x10)
    FPalArenaRule Local_ArenaRule;                                                    // 0x04D8 (size: 0x38)
    TArray<FName> Local_ItemQuickMoveExceptionIDList;                                 // 0x0510 (size: 0x10)
    TArray<FPalOtomoLoadoutData> Local_OtomoLoadoutSaveData;                          // 0x0520 (size: 0x10)
    FName TrackingQuestId;                                                            // 0x0530 (size: 0x8)
    TMap<FPalInstanceID, int32> Local_MaxFriendshipPalIds;                            // 0x0538 (size: 0x50)
    bool bUnlockedBlueprintCategoryInBuildMenu;                                       // 0x0588 (size: 0x1)

}; // Size: 0x590

struct FPalLocalizedTextData : public FTableRowBase
{
    FText TextData;                                                                   // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FPalLocationRepInfo : public FFastArraySerializerItem
{
    FGuid ID;                                                                         // 0x000C (size: 0x10)
    class UPalLocationBase* Location;                                                 // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalLocationUIData
{
    TSoftObjectPtr<UTexture2D> Icon;                                                  // 0x0000 (size: 0x30)
    TSubclassOf<class UPalUICompassIconBase> compassIconWidget;                       // 0x0030 (size: 0x8)
    float displayLength;                                                              // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPalLocationUIData_TableRow : public FTableRowBase
{
    TMap<class EPalLocationType, class FPalLocationUIData> locationUIDataMap;         // 0x0008 (size: 0x50)
    TMap<class FName, class TSoftObjectPtr<UTexture2D>> mapObjectIconMap;             // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FPalLogAdditionalData
{
    TArray<TSoftObjectPtr<UTexture2D>> softTextures;                                  // 0x0000 (size: 0x10)
    EPalLogContentToneType logToneType;                                               // 0x0010 (size: 0x1)
    FName DefaultFontStyleName;                                                       // 0x0014 (size: 0x8)
    TSubclassOf<class UPalLogWidgetBase> overrideWidgetClass;                         // 0x0020 (size: 0x8)
    FPalStaticItemIdAndNum ItemIDAndNum;                                              // 0x0028 (size: 0xC)

}; // Size: 0x38

struct FPalLogDataSet
{
    FText Text;                                                                       // 0x0000 (size: 0x18)
    FPalLogAdditionalData AdditionalData;                                             // 0x0018 (size: 0x38)

}; // Size: 0x50

struct FPalLogInfo_DropPal
{
    FString NickName;                                                                 // 0x0000 (size: 0x10)
    FName CharacterID;                                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalLogInfo_Skill
{
    FText SkillName;                                                                  // 0x0000 (size: 0x18)
    FText CharacterName;                                                              // 0x0018 (size: 0x18)
    FText Value;                                                                      // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FPalLoggedinPlayerSaveDataRecordData
{
    TMap<class FName, class bool> TowerBossDefeatFlag;                                // 0x0000 (size: 0x50)
    TMap<FName, int32> TowerBossDefeatCount;                                          // 0x0050 (size: 0x50)
    TMap<class FName, class bool> NormalBossDefeatFlag;                               // 0x00A0 (size: 0x50)
    TMap<FName, int32> RaidBossDefeatCount;                                           // 0x00F0 (size: 0x50)
    TMap<FName, int32> SpecificBossDefeatFlag;                                        // 0x0140 (size: 0x50)
    int32 BossDefeatCount;                                                            // 0x0190 (size: 0x4)
    int32 PredatorDefeatCount;                                                        // 0x0194 (size: 0x4)
    int32 TribeCaptureCount;                                                          // 0x0198 (size: 0x4)
    TMap<FName, int32> PalCaptureCount;                                               // 0x01A0 (size: 0x50)
    TMap<FName, int32> PalCaptureBonusCount;                                          // 0x01F0 (size: 0x50)
    TMap<FName, int32> PalButcherCount;                                               // 0x0240 (size: 0x50)
    TMap<class FName, class bool> PaldeckUnlockFlag;                                  // 0x0290 (size: 0x50)
    int32 PalCaptureCountBonusCount_Tier1;                                            // 0x02E0 (size: 0x4)
    int32 PalCaptureCountBonusCount_Tier2;                                            // 0x02E4 (size: 0x4)
    int32 PalCaptureCountBonusCount_Tier3;                                            // 0x02E8 (size: 0x4)
    int32 PalCaptureBonusExpTableIndex;                                               // 0x02EC (size: 0x4)
    int32 NpcBonusExpTableIndex;                                                      // 0x02F0 (size: 0x4)
    TMap<class FName, class bool> RelicObtainForInstanceFlag;                         // 0x02F8 (size: 0x50)
    int32 RelicPossessNum;                                                            // 0x0348 (size: 0x4)
    TMap<class FName, class bool> NoteObtainForInstanceFlag;                          // 0x0350 (size: 0x50)
    TMap<FName, int32> NPCTalkIdCount;                                                // 0x03A0 (size: 0x50)
    TMap<class FName, class bool> FastTravelPointUnlockFlag;                          // 0x03F0 (size: 0x50)
    TArray<FGuid> BuildingObjectMapObjectInstanceIds;                                 // 0x0440 (size: 0x10)
    TMap<FName, int32> CraftItemCount;                                                // 0x0450 (size: 0x50)
    int32 NormalDungeonClearCount;                                                    // 0x04A0 (size: 0x4)
    int32 FixedDungeonClearCount;                                                     // 0x04A4 (size: 0x4)
    int32 OilrigClearCount;                                                           // 0x04A8 (size: 0x4)
    TMap<FName, int32> PalRankupCount;                                                // 0x04B0 (size: 0x50)
    TMap<class FName, class bool> FindAreaFlagMap;                                    // 0x0500 (size: 0x50)
    int32 AreaBonusExpTableIndex;                                                     // 0x0550 (size: 0x4)
    TMap<FName, int32> ArenaSoloClearCount;                                           // 0x0558 (size: 0x50)
    TArray<FGuid> CompletedEmoteNPCIDArray;                                           // 0x05A8 (size: 0x10)
    TMap<FName, int32> NPCTalkCountMap;                                               // 0x05B8 (size: 0x50)
    TMap<class FName, class bool> InvokeNPCNetworkEventMap;                           // 0x0608 (size: 0x50)
    TMap<class FGuid, class FPalPlayerSaveDataRecordDataFoundTreasureMapPoint> FoundTreasureMapPointMap; // 0x0658 (size: 0x50)
    TMap<FName, int32> FishingCountMap;                                               // 0x06A8 (size: 0x50)
    int32 CampConqueredCount;                                                         // 0x06F8 (size: 0x4)
    int32 FoundTreasureCount;                                                         // 0x06FC (size: 0x4)
    TMap<class FName, class bool> NpcItemTradeFlag;                                   // 0x0700 (size: 0x50)
    TMap<class FName, class bool> PalDisplayNPCDataTableProgress;                     // 0x0750 (size: 0x50)
    TMap<class FName, class bool> NPCAchivementRewardFlag;                            // 0x07A0 (size: 0x50)
    bool bFirstFishingComplete;                                                       // 0x07F0 (size: 0x1)

}; // Size: 0x7F8

struct FPalMakeDamageInfo
{
    class AActor* Attacker;                                                           // 0x0000 (size: 0x8)
    class AActor* Defender;                                                           // 0x0008 (size: 0x8)
    class USceneComponent* HitComponent;                                              // 0x0010 (size: 0x8)
    int32 Power;                                                                      // 0x0018 (size: 0x4)
    EPalWazaCategory Category;                                                        // 0x001C (size: 0x1)
    EPalElementType Element;                                                          // 0x001D (size: 0x1)
    EPalAttackType AttackType;                                                        // 0x001E (size: 0x1)
    EPalWeaponType WeaponType;                                                        // 0x001F (size: 0x1)
    FVector HitLocation;                                                              // 0x0020 (size: 0x18)
    bool IsLeanBack;                                                                  // 0x0038 (size: 0x1)
    bool IsBlow;                                                                      // 0x0039 (size: 0x1)
    FVector BlowVelocity;                                                             // 0x0040 (size: 0x18)
    FHitResult HitInfo;                                                               // 0x0058 (size: 0xE8)
    EPalAdditionalEffectType EffectType1;                                             // 0x0140 (size: 0x1)
    int32 EffectValue1;                                                               // 0x0144 (size: 0x4)
    float EffectValueEx1;                                                             // 0x0148 (size: 0x4)
    EPalAdditionalEffectType EffectType2;                                             // 0x014C (size: 0x1)
    int32 EffectValue2;                                                               // 0x0150 (size: 0x4)
    float EffectValueEx2;                                                             // 0x0154 (size: 0x4)
    TArray<int32> HitFoliageIndex;                                                    // 0x0158 (size: 0x10)
    float SneakAttackRate;                                                            // 0x0168 (size: 0x4)
    float DamageRatePerCollision;                                                     // 0x016C (size: 0x4)
    TArray<FPalSpecialAttackRateInfo> SpecialAttackRateInfos;                         // 0x0170 (size: 0x10)
    EPalDamageAnimationReactionType DamageReactionAnimationType;                      // 0x0180 (size: 0x1)
    bool bAttackableToFriend;                                                         // 0x0181 (size: 0x1)
    bool NoDamage;                                                                    // 0x0182 (size: 0x1)
    bool IgnoreShield;                                                                // 0x0183 (size: 0x1)
    bool UIDamageTextOverride_DoubleRegist;                                           // 0x0184 (size: 0x1)
    EPalPlayerDamageCameraShakeCategory CameraShake;                                  // 0x0185 (size: 0x1)
    EPalSizeType ForceRagdollSize;                                                    // 0x0186 (size: 0x1)
    class AActor* OverrideNetworkOwner;                                               // 0x0188 (size: 0x8)
    float WeaponDamageRatePvP;                                                        // 0x0190 (size: 0x4)
    FName AttackStaticItemID;                                                         // 0x0194 (size: 0x8)

}; // Size: 0x1A0

struct FPalMapObjectAppearanceData
{
    FGameDateTime DateTime;                                                           // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalMapObjectAppearanceDataWithId
{
    FGuid InstanceId;                                                                 // 0x0000 (size: 0x10)
    FPalMapObjectAppearanceData AppearanceData;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectAssignData : public FTableRowBase
{
    EPalGenusCategoryType GenusCategory;                                              // 0x0008 (size: 0x1)
    EPalElementType ElementType;                                                      // 0x0009 (size: 0x1)
    EPalWorkSuitability WorkSuitability;                                              // 0x000A (size: 0x1)
    int32 WorkSuitabilityRank;                                                        // 0x000C (size: 0x4)
    bool bPlayerWorkable;                                                             // 0x0010 (size: 0x1)
    bool bBaseCampWorkerWorkable;                                                     // 0x0011 (size: 0x1)
    TArray<EPalTribeID> WorkableTribeIDs;                                             // 0x0018 (size: 0x10)
    EPalSizeType WorkableSizeMin;                                                     // 0x0028 (size: 0x1)
    EPalSizeType WorkableSizeMax;                                                     // 0x0029 (size: 0x1)
    EPalWorkType WorkType;                                                            // 0x002A (size: 0x1)
    EPalActionType WorkActionType;                                                    // 0x002B (size: 0x1)
    int32 WorkerMaxNum;                                                               // 0x002C (size: 0x4)
    float AffectSanityValue;                                                          // 0x0030 (size: 0x4)
    float AffectFullStomachValue;                                                     // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FPalMapObjectBelongInfo : public FPalBelongInfo
{
    FGuid GroupId;                                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectBlueprintDataAssetResetParameter
{
    TSubclassOf<class UPalTextWidgetComponent> TextWidgetClass;                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalMapObjectBlueprintPart
{
    FName MapObjectId;                                                                // 0x0000 (size: 0x8)
    FVector LocationOffset;                                                           // 0x0008 (size: 0x18)
    FRotator RotationOffset;                                                          // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FPalMapObjectBoundsInfo
{
}; // Size: 0x50

struct FPalMapObjectBuildProcessSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalMapObjectCharacterTeamMissionIndividual
{
    EPalTribeID TribeId;                                                              // 0x0000 (size: 0x2)
    int32 Level;                                                                      // 0x0004 (size: 0x4)
    FString NickName;                                                                 // 0x0008 (size: 0x10)
    int32 Strength;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPalMapObjectCharacterTeamMissionIndividualRepInfo : public FFastArraySerializerItem
{
    FPalInstanceID IndividualId;                                                      // 0x0010 (size: 0x30)
    FPalMapObjectCharacterTeamMissionIndividual IndividualInfo;                       // 0x0040 (size: 0x20)

}; // Size: 0x60

struct FPalMapObjectComponentInfo
{
}; // Size: 0xC

struct FPalMapObjectConcreteModelCreateParameter
{
}; // Size: 0xA0

struct FPalMapObjectConcreteModelModuleSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalMapObjectConcreteModelSaveData : public FPalBinaryMemory
{
    TMap<class EPalMapObjectConcreteModelModuleType, class FPalMapObjectConcreteModelModuleSaveData> ModuleMap; // 0x0020 (size: 0x50)

}; // Size: 0x70

struct FPalMapObjectConnectorSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalMapObjectConvertCharacterToItemProcessItem
{
    FPalInstanceID IndividualId;                                                      // 0x0000 (size: 0x30)
    float ConvertProgressRate;                                                        // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPalMapObjectCreateParameter
{
}; // Size: 0x80

struct FPalMapObjectDamageInfo
{
}; // Size: 0x128

struct FPalMapObjectDisposeOptions
{
}; // Size: 0x10

struct FPalMapObjectDisposeReserveInfo
{
}; // Size: 0x20

struct FPalMapObjectDropItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectDropTreasureLotteryParameter
{
    FPalDataTableRowName_MapObjectData SpawnMapObjectId;                              // 0x0000 (size: 0x8)
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0008 (size: 0x8)
    int32 Weight;                                                                     // 0x0010 (size: 0x4)
    int32 Num;                                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalMapObjectEffectSaveData : public FPalBinaryMemory
{
}; // Size: 0x20

struct FPalMapObjectFarmCropData : public FTableRowBase
{
    FName CropBlueprintClassName;                                                     // 0x0008 (size: 0x8)
    TSoftClassPtr<APalMapObjectFarmCrop> CropClassPath;                               // 0x0010 (size: 0x30)
    FName CropItemId;                                                                 // 0x0040 (size: 0x8)
    float GrowupTime;                                                                 // 0x0048 (size: 0x4)
    int32 CropItemNum;                                                                // 0x004C (size: 0x4)
    float SeedingWorkAmount;                                                          // 0x0050 (size: 0x4)
    float WateringWorkAmount;                                                         // 0x0054 (size: 0x4)
    float HarvestWorkAmount;                                                          // 0x0058 (size: 0x4)
    FName MaterialItem1_Id;                                                           // 0x005C (size: 0x8)
    int32 MaterialItem1_Num;                                                          // 0x0064 (size: 0x4)
    FName MaterialItem2_Id;                                                           // 0x0068 (size: 0x8)
    int32 MaterialItem2_Num;                                                          // 0x0070 (size: 0x4)
    int32 Editor_RowNameHash;                                                         // 0x0074 (size: 0x4)

}; // Size: 0x78

struct FPalMapObjectFarmSkillFruitsLotteryRow : public FTableRowBase
{
    EPalFarmSkillFruitsLotteryItemType LotteryItemType;                               // 0x0008 (size: 0x1)
    FName OtherItemId;                                                                // 0x000C (size: 0x8)
    int32 Weight;                                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalMapObjectFishPondCaughtCharacterInfo
{
    FName CharacterID;                                                                // 0x0000 (size: 0x8)
    int32 CharacterLevel;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectFishPondLotteryTargetData
{
    FPalDataTableRowName_ItemData RequiredMaterialStaticItemId;                       // 0x0000 (size: 0x8)
    int32 RequiredMaterialItemNum;                                                    // 0x0008 (size: 0x4)
    float RequiredWorkAmound;                                                         // 0x000C (size: 0x4)
    FPalWorkSuitabilityDefineData WorkSuitabilityDefineData;                          // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FPalMapObjectFoliageDropItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectFoliageInstallData : public FTableRowBase
{
    FName FoliageTypeName;                                                            // 0x0008 (size: 0x8)
    FVector Location;                                                                 // 0x0010 (size: 0x18)
    FRotator Rotator;                                                                 // 0x0028 (size: 0x18)
    FVector Scale3D;                                                                  // 0x0040 (size: 0x18)

}; // Size: 0x58

struct FPalMapObjectFoliageInstanceAccessID
{
    FName ModelId;                                                                    // 0x0000 (size: 0x8)
    FPalFoliageInstanceId InstanceId;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectInfoTickInBackground
{
}; // Size: 0x10

struct FPalMapObjectItemContainerCreateContainerParameter
{
}; // Size: 0x70

struct FPalMapObjectItemContainerModuleFilter
{
    TArray<FName> FilterOffList;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalMapObjectItemContainerModuleSlotIndexes
{
    EPalMapObjectItemContainerSlotAttribute Attribute;                                // 0x0000 (size: 0x1)
    TArray<int32> Indexes;                                                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectItemProductData : public FTableRowBase
{
    FName Product_Id;                                                                 // 0x0008 (size: 0x8)
    float RequiredWorkAmount;                                                         // 0x0010 (size: 0x4)
    float AutoWorkAmountBySec;                                                        // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPalMapObjectLotteryData : public FTableRowBase
{
    FName FieldName;                                                                  // 0x0008 (size: 0x8)
    float Weight;                                                                     // 0x0010 (size: 0x4)
    FName MapObjectId;                                                                // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalMapObjectManageAsyncTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalMapObjectManageTickInBackgroundFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalMapObjectManageTickPostProcessFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalMapObjectMasterData : public FTableRowBase
{
    FName OverrideNameMsgID;                                                          // 0x0008 (size: 0x8)
    FName BlueprintClassName;                                                         // 0x0010 (size: 0x8)
    TSoftClassPtr<APalMapObject> BlueprintClassSoft;                                  // 0x0018 (size: 0x30)
    EPalMapObjectMaterialType MaterialType;                                           // 0x0048 (size: 0x1)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0049 (size: 0x1)
    bool bCollectionObject;                                                           // 0x004A (size: 0x1)
    int32 Hp;                                                                         // 0x004C (size: 0x4)
    int32 Defense;                                                                    // 0x0050 (size: 0x4)
    bool bBelongToBaseCamp;                                                           // 0x0054 (size: 0x1)
    int32 DistributeExpAroundPlayer;                                                  // 0x0058 (size: 0x4)
    float DeteriorationDamage;                                                        // 0x005C (size: 0x4)
    float ExtinguishBurnWorkAmount;                                                   // 0x0060 (size: 0x4)
    bool bShowHPGauge;                                                                // 0x0064 (size: 0x1)
    bool bInDevelop;                                                                  // 0x0065 (size: 0x1)
    int32 Editor_RowNameHash;                                                         // 0x0068 (size: 0x4)

}; // Size: 0x70

struct FPalMapObjectMeshVisibleData
{
    FComponentReference MeshComponentRef;                                             // 0x0000 (size: 0x28)
    float VisibleHpPercentageThreshold;                                               // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalMapObjectModelConnectInfo
{
    EPalMapObjectModelConnectIndex ConnectIndex;                                      // 0x0000 (size: 0x1)
    TArray<FPalMapObjectModelConnectInfoItem> ConnectToInfos;                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectModelConnectInfoItem
{
    FGuid ConnectToModelInstanceId;                                                   // 0x0000 (size: 0x10)
    EPalMapObjectModelConnectIndex ConnectIndex;                                      // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FPalMapObjectModelEffectRepInfo : public FFastArraySerializerItem
{
    EPalStatusID statusID;                                                            // 0x000C (size: 0x1)
    class UPalMapObjectModelEffectBase* Effect;                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectModelInitializeExtraParameters
{
    TArray<class UPalMapObjectModelInitializeExtraParameterBase*> Entries;            // 0x0000 (size: 0x10)
    bool bIgnoredSave;                                                                // 0x0010 (size: 0x1)
    FGuid LevelObjectInstanceId;                                                      // 0x0014 (size: 0x10)

}; // Size: 0x28

struct FPalMapObjectModelSaveData : public FPalBinaryMemory
{
    FPalMapObjectBuildProcessSaveData BuildProcess;                                   // 0x0020 (size: 0x20)
    FPalMapObjectConnectorSaveData Connector;                                         // 0x0040 (size: 0x20)
    TMap<class EPalStatusID, class FPalMapObjectEffectSaveData> EffectMap;            // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FPalMapObjectModelStaticData
{
    FPalBoundsTransform WorkableBounds;                                               // 0x0000 (size: 0x80)
    FBox MeshBoxBounds;                                                               // 0x0080 (size: 0x38)
    EPalMapObjectDamagableType DamagableType;                                         // 0x00B8 (size: 0x1)
    FName BuildObjectId;                                                              // 0x00BC (size: 0x8)
    TSubclassOf<class APalMapObject> BlueprintClass;                                  // 0x00C8 (size: 0x8)

}; // Size: 0xD0

struct FPalMapObjectModuleRepInfo : public FFastArraySerializerItem
{
    class UPalMapObjectConcreteModelModuleBase* Module;                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectPasswordLockPlayerInfo
{
    FGuid PlayerUId;                                                                  // 0x0000 (size: 0x10)
    int32 TryFailedCount;                                                             // 0x0010 (size: 0x4)
    bool TrySuccessCache;                                                             // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FPalMapObjectPickupItemData
{
    FPalDataTableRowName_ItemData StaticItemId;                                       // 0x0000 (size: 0x8)
    int32 Num;                                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectPickupItemPalEggData
{
    FPalDataTableRowName_PalMonsterData PalMonsterId;                                 // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPalMapObjectPickupItemPalEggLotteryData
{
    FPalMapObjectPickupItemPalEggData PalEggData;                                     // 0x0000 (size: 0x8)
    float Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectRepairInfo
{
    FPalDataTableRowName_ItemData RepairKitItemName;                                  // 0x0000 (size: 0x8)
    int32 RepairKitRequiredNum;                                                       // 0x0008 (size: 0x4)
    float RepairRequiredWorkAmount;                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPalMapObjectSaveData
{
    FName MapObjectId;                                                                // 0x0000 (size: 0x8)
    FPalMapObjectModelSaveData Model;                                                 // 0x0008 (size: 0xB0)
    FPalMapObjectConcreteModelSaveData ConcreteModel;                                 // 0x00B8 (size: 0x70)

}; // Size: 0x128

struct FPalMapObjectSignificanceInfo
{
    float DistanceInRangeFromPlayer;                                                  // 0x0000 (size: 0x4)
    float TickInterval;                                                               // 0x0004 (size: 0x4)
    bool bBuildObjectVisible;                                                         // 0x0008 (size: 0x1)
    bool bInvalidTickForSkeletalMeshComponent;                                        // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FPalMapObjectSpawnableCheckParameter
{
    TArray<class AActor*> IgnoredOverlapCheckActors;                                  // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FPalMapObjectSpawnerBlueprintData : public FTableRowBase
{
    FName BlueprintClassName;                                                         // 0x0008 (size: 0x8)
    TSoftClassPtr<APalMapObjectSpawnerBase> BlueprintClassSoft;                       // 0x0010 (size: 0x30)

}; // Size: 0x40

struct FPalMapObjectSpawnerInStageSaveData
{
    TMap<class FGuid, class FPalMapObjectSpawnerSaveData> SpawnerDataMapByLevelObjectInstanceId; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectSpawnerItemSaveData
{
    int64 NextLotteryGameTime;                                                        // 0x0000 (size: 0x8)
    FGuid MapObjectInstanceId;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalMapObjectSpawnerSaveData
{
    TMap<int32, FPalMapObjectSpawnerItemSaveData> ItemMap;                            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectSpawnerSimpleLotteryParameter
{
    FPalDataTableRowName_MapObjectData SpawnMapObjectId;                              // 0x0000 (size: 0x8)
    int32 Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPalMapObjectSpawnerTreasureBoxLotteryParameter
{
    FPalDataTableRowName_MapObjectData SpawnMapObjectId;                              // 0x0000 (size: 0x8)
    FPalDataTableRowName_FieldLotteryNameData FieldLotteryName;                       // 0x0008 (size: 0x8)
    int32 Weight;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FPalMapObjectStaticData
{
    FName DummyFoliageMapObjectId;                                                    // 0x0000 (size: 0x8)
    FName DropItem3DMapObjectId;                                                      // 0x0008 (size: 0x8)
    FName DropItem3DSKMapObjectId;                                                    // 0x0010 (size: 0x8)
    FName BuildObjectId_PalStorage;                                                   // 0x0018 (size: 0x8)
    FName MapObjectId_ItemChest;                                                      // 0x0020 (size: 0x8)
    FName MapObjectId_DeathPenalty;                                                   // 0x0028 (size: 0x8)
    FName MapObjectId_DroppedCharacter;                                               // 0x0030 (size: 0x8)
    FName MapObjectId_TreasureBox_VisibleContent;                                     // 0x0038 (size: 0x8)
    FName MapObjectId_SkillFruit_VisibleContent;                                      // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FPalMapObjectStatusValue
{
    int32 CurrentValue;                                                               // 0x0000 (size: 0x4)
    int32 MaxValue;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalMapObjectTreasureBoxOpenRequiredItemMapByGrade
{
    TMap<class EPalMapObjectTreasureGradeType, class FPalDataTableRowName_ItemData> RequiredItemMapByGrade; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectVisualEffectAssets
{
    TMap<class EPalMapObjectVisualEffectType, class TSoftObjectPtr<UNiagaraSystem>> AssetMap; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalMapObjectVisualEffectInstanceSet
{
    TArray<class UNiagaraComponent*> Instances;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalMapObjectWorldDropItemInfo
{
    FName StaticItemId;                                                               // 0x0008 (size: 0x8)
    FGameDateTime CreatedAt;                                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPalMapObjectWorldDropItemInfoSet
{
    TArray<FPalMapObjectWorldDropItemInfo> Infos;                                     // 0x0000 (size: 0x10)
    TArray<FPalMapObjectWorldDropItemInfo> InsertReservedInfoSet;                     // 0x0010 (size: 0x10)
    int32 MaxCount;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalMealLogDisplayData
{
    FPalInstanceID InstanceId;                                                        // 0x0000 (size: 0x30)
    FName MealItemID;                                                                 // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPalMemoryArchive
{
}; // Size: 0x1

struct FPalMiningRankDefineData
{
    float DamageRate;                                                                 // 0x0000 (size: 0x4)
    EPalMapObjectMaterialSubType MaterialSubType;                                     // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPalMissileLauncherTargetInfo
{
    float InRangeTimer;                                                               // 0x0000 (size: 0x4)
    bool IsSentWarningSign;                                                           // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FPalMonsterControllerBaseCampHungryParameter
{
    float RecoverSatietyTo;                                                           // 0x0000 (size: 0x4)
    float RecoverSanityTo;                                                            // 0x0004 (size: 0x4)
    int32 EatMaxNum;                                                                  // 0x0008 (size: 0x4)
    EPalBaseCampRecoverStatusType RecoverStatusType;                                  // 0x000C (size: 0x1)

}; // Size: 0x10

struct FPalMonsterControllerBaseCampLogContent
{
    EPalMonsterControllerBaseCampLogType Type;                                        // 0x0000 (size: 0x1)
    FName TextId;                                                                     // 0x0004 (size: 0x8)
    FName TargetObjectTextId;                                                         // 0x000C (size: 0x8)
    FPalInstanceID InstanceId;                                                        // 0x0018 (size: 0x30)

}; // Size: 0x48

struct FPalMorphSetting
{
    TMap<FName, float> WeightList;                                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalNPCAppearDatabaseRow : public FTableRowBase
{
    int32 DummyValue;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPalNPCAppearFlagSaveData
{
    TArray<FName> NPCAppearFlagName;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalNPCInteractConditionConstValueDataTableRow : public FTableRowBase
{
    FName ValText;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCInteractionDataTableRow : public FTableRowBase
{
    FName UniqueNPCID;                                                                // 0x0008 (size: 0x8)
    FName CharacterID;                                                                // 0x0010 (size: 0x8)
    EPalInteractiveObjectIndicatorType InteractionType;                               // 0x0018 (size: 0x1)
    FName Conditions;                                                                 // 0x001C (size: 0x8)
    FName IncidentId;                                                                 // 0x0024 (size: 0x8)
    FName IncidentArgs1;                                                              // 0x002C (size: 0x8)
    FName IncidentArgs2;                                                              // 0x0034 (size: 0x8)

}; // Size: 0x40

struct FPalNPCMultiTalkRow : public FTableRowBase
{
    TSubclassOf<class UPalNPCMultiTalkHandle> MultiTalkHandleClass;                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCOneTalkRow : public FTableRowBase
{
    class UDataTable* OneTalkData;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNPCOtomoWazaDataRow : public FTableRowBase
{
    FPalDataTableRowName_PalMonsterData PalName;                                      // 0x0008 (size: 0x8)
    EPalWazaID Waza1;                                                                 // 0x0010 (size: 0x2)
    EPalWazaID Waza2;                                                                 // 0x0012 (size: 0x2)
    EPalWazaID Waza3;                                                                 // 0x0014 (size: 0x2)

}; // Size: 0x18

struct FPalNPCSpawnInfo
{
    TSubclassOf<class APalAIController> ControllerClass;                              // 0x0000 (size: 0x8)
    FName CharacterID;                                                                // 0x0008 (size: 0x8)
    int32 Level;                                                                      // 0x0010 (size: 0x4)
    FVector Location;                                                                 // 0x0018 (size: 0x18)
    float Yaw;                                                                        // 0x0030 (size: 0x4)
    class UPalSquad* Squad;                                                           // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FPalNPCTalkData
{
    EPalNPCTalkCommand TalkCommand;                                                   // 0x0000 (size: 0x1)
    TArray<FName> MessageIDList;                                                      // 0x0008 (size: 0x10)
    TArray<FName> ChoiceMessageIDList;                                                // 0x0018 (size: 0x10)
    FName TalkerNameID;                                                               // 0x0028 (size: 0x8)
    FName CustomFuncName;                                                             // 0x0030 (size: 0x8)
    bool isCloseWhenCalledCustomFunc;                                                 // 0x0038 (size: 0x1)
    class UDataTable* CustomFuncParam;                                                // 0x0040 (size: 0x8)
    TArray<FPalNPCTalkSelectedChoiceCommandData> SelectedChoiceCommandDataList;       // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FPalNPCTalkDataTableRow : public FTableRowBase
{
    TArray<FPalNPCTalkData> TalkData;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalNPCTalkFlowDataTable : public FTableRowBase
{
    TSoftObjectPtr<UPalNPCTalkFlowAssetBase> SoftTalkFlowAsset;                       // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalNPCTalkNotifyInfo
{
    class UDataTable* TalkDataTable;                                                  // 0x0000 (size: 0x8)
    int32 TalkDataIndex;                                                              // 0x0008 (size: 0x4)
    FName TalkDataSeqenceName;                                                        // 0x000C (size: 0x8)

}; // Size: 0x18

struct FPalNPCTalkSelectedChoiceCommandData
{
    EPalNPCTalkSelectedChoiceCommand selectedChoiceCommand;                           // 0x0000 (size: 0x1)
    FName SeqenceName;                                                                // 0x0004 (size: 0x8)
    FName CustomFuncName;                                                             // 0x000C (size: 0x8)
    bool isCloseWhenCalledCustomFunc;                                                 // 0x0014 (size: 0x1)
    class UDataTable* CustomFuncParam;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalNPCTalkSystemCustomFunctionParameters
{
    TScriptInterface<class IPalNPCTalkSystemCustomFunctionInterface> Interface;       // 0x0000 (size: 0x10)
    class UDataTable* FuncParameter;                                                  // 0x0010 (size: 0x8)
    int32 TalkDataIndex;                                                              // 0x0018 (size: 0x4)
    FName TalkDataSeqenceName;                                                        // 0x001C (size: 0x8)

}; // Size: 0x28

struct FPalNPCWeaponCombatInfo
{
    TSubclassOf<class UPalAIActionBase> CombatAIActionClass;                          // 0x0000 (size: 0x8)
    int32 NPCWeaponRange_Near_cm;                                                     // 0x0008 (size: 0x4)
    int32 NPCWeaponRange_Far_cm;                                                      // 0x000C (size: 0x4)
    float ShootInterval;                                                              // 0x0010 (size: 0x4)
    int32 MxgazineSize;                                                               // 0x0014 (size: 0x4)
    int32 MaxShootCount;                                                              // 0x0018 (size: 0x4)
    float ReloadTime;                                                                 // 0x001C (size: 0x4)
    float RandomMoveTime_Min;                                                         // 0x0020 (size: 0x4)
    float AimOffset_Height;                                                           // 0x0024 (size: 0x4)
    bool UseSideDashMovement;                                                         // 0x0028 (size: 0x1)
    bool UseReloadMotion;                                                             // 0x0029 (size: 0x1)
    bool MeleeAttackWithGun;                                                          // 0x002A (size: 0x1)
    float AimRotateSpeed;                                                             // 0x002C (size: 0x4)
    TSubclassOf<class UPalStateMachineStateBase> FireStateClass;                      // 0x0030 (size: 0x8)
    float SphereCastRadius;                                                           // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FPalNavigationDividedAreaInfo
{
}; // Size: 0x50

struct FPalNavigationUpdateFrequencySetting
{
    int32 UpdateDivideRate;                                                           // 0x0000 (size: 0x4)
    FVector2D UpdatableRangeMinMaxFromPlayer;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPalNetArchive
{
    TArray<uint8> Bytes;                                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalNetworkChangeIndividualID
{
}; // Size: 0x60

struct FPalNetworkCharacterContainerParameter
{
}; // Size: 0x58

struct FPalNetworkContainerParameter
{
}; // Size: 0x20

struct FPalNetworkDynamicItemParameter
{
}; // Size: 0x30

struct FPalNetworkItemOperationParameter
{
}; // Size: 0x20

struct FPalNetworkMapObjectSpawnRequestParameter
{
}; // Size: 0x10

struct FPalNetworkMapObjectTickIntervalInBackgroundInfo
{
    float TickInterval;                                                               // 0x0000 (size: 0x4)
    int32 Count;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalNetworkNPCTalkRequestData
{
    class UPalNPCTalkFlowComponent* TalkFlowComponent;                                // 0x0000 (size: 0x8)
    FGuid Token;                                                                      // 0x0008 (size: 0x10)
    FName NetworkInvokeName;                                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPalNetworkNPCTalkResponseData
{
    class UPalNPCTalkFlowComponent* TalkFlowComponent;                                // 0x0000 (size: 0x8)
    bool bSuccess;                                                                    // 0x0008 (size: 0x1)
    FName OutputPinName;                                                              // 0x000C (size: 0x8)
    FName NetworkInvokeName;                                                          // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalNetworkParameter
{
}; // Size: 0x10

struct FPalNetworkTransmitterDelaySpawnInfo
{
    FGuid SpawnGUID;                                                                  // 0x0010 (size: 0x10)
    class AActor* SpawnActor;                                                         // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPalNoteMasterData : public FTableRowBase
{
    FName TextId_Description;                                                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalNoteMasterDataTextureTableRow : public FTableRowBase
{
    TSoftObjectPtr<UTexture2D> Texture;                                               // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FPalObjectCollectorCalcNearestCharacterTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalObjectCollectorMapObjectSpawnerId
{
}; // Size: 0x18

struct FPalObjectCollectorMapObjectSpawnerInfo
{
}; // Size: 0x18

struct FPalObjectCollectorTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FPalObjectPoolActivateParameter
{
    TSubclassOf<class AActor> actorClass;                                             // 0x0000 (size: 0x8)
    FTransform Transform;                                                             // 0x0010 (size: 0x60)
    class AActor* Owner;                                                              // 0x0070 (size: 0x8)
    class APawn* Instigator;                                                          // 0x0078 (size: 0x8)
    bool bSpawnIfEmpty;                                                               // 0x0080 (size: 0x1)
    ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingOverride;                // 0x0081 (size: 0x1)

}; // Size: 0x90

struct FPalObjectPoolContainer
{
    TArray<class AActor*> Actors;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPalObjectPoolKey
{
    FName PoolKey;                                                                    // 0x0000 (size: 0x8)
    UClass* TargetClass;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPalObjectPoolParameter
{
    FName PoolKey;                                                                    // 0x0000 (size: 0x8)
    int32 PoolSize;                                                                   // 0x0008 (size: 0x4)
    TSubclassOf<class AActor> TargetClass;                                            // 0x0010 (size: 0x8)
    bool bIsValid;                                                                    // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FPalOilrigCombatHeliRandomWeaponInfo
{
    EPalOilrigCombatHeliWeaponType WeaponType;                                        // 0x0000 (size: 0x1)
    float Weight;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalOilrigSaveData
{
    TMap<class EPalOilrigType, class FPalOilrigSaveStatus> OilrigMap;                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPalOilrigSaveStatus
{
    TArray<FGuid> DestroyedCannon;                                                    // 0x0000 (size: 0x10)
    TArray<FGuid> DestroyedGasTank;                                                   // 0x0010 (size: 0x10)
    TArray<FGuid> WipedOutEnemySpawner;                                               // 0x0020 (size: 0x10)
    TArray<FGuid> OpenedTreasureBoxSpawner;                                           // 0x0030 (size: 0x10)
    int32 GoalTreasureBoxSpawnerIndex;                                                // 0x0040 (size: 0x4)
    bool Alarm;                                                                       // 0x0044 (size: 0x1)
    bool Clear;                                                                       // 0x0045 (size: 0x1)
    float ResetTimer;                                                                 // 0x0048 (size: 0x4)
    bool IsMachineSpawned;                                                            // 0x004C (size: 0x1)
    bool IsMachineDestroyed;                                                          // 0x004D (size: 0x1)

}; // Size: 0x50

struct FPalOperatingTablePassiveSkillData : public FTableRowBase
{
    FName PassiveSkill;                                                               // 0x0008 (size: 0x8)
    int32 Price;                                                                      // 0x0010 (size: 0x4)
    FName RequireItemId;                                                              // 0x0014 (size: 0x8)

}; // Size: 0x20

struct FPalOptimizeParameter
{
    int32 FoliageISMDistance_Meters;                                                  // 0x0000 (size: 0x4)
    float TargetFPS;                                                                  // 0x0004 (size: 0x4)
    float MinFPS;                                                                     // 0x0008 (size: 0x4)
    float MaxFPS;                                                                     // 0x000C (size: 0x4)
    int32 CharacterImportance_CheckNumberPerFrame;                                    // 0x0010 (size: 0x4)
    int32 CharacterImportance_NearestCount;                                           // 0x0014 (size: 0x4)
    float CharacterImportance_NearDistance;                                           // 0x0018 (size: 0x4)
    float CharacterImportance_FarDistance;                                            // 0x001C (size: 0x4)
    float CharacterImportance_FarthestDistance;                                       // 0x0020 (size: 0x4)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Actor;  // 0x0028 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Movement; // 0x0078 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Mesh;   // 0x00C8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Mesh_Update; // 0x0118 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Mesh_Evaluation; // 0x0168 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Action; // 0x01B8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Status; // 0x0208 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_LookAt; // 0x0258 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_VisualEffect; // 0x02A8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Shooter; // 0x02F8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_FlyMesh; // 0x0348 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_Controller; // 0x0398 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_AIAction; // 0x03E8 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_AISensor; // 0x0438 (size: 0x50)
    TMap<EPalCharacterImportanceType, float> CharacterImportance_TickInterval_PathFollowing; // 0x0488 (size: 0x50)
    float SpawnerImportance_NearDistance;                                             // 0x04D8 (size: 0x4)
    float SpawnerImportance_FarDistance;                                              // 0x04DC (size: 0x4)
    TMap<EPalSpwnerImportanceType, float> SpawnerImportance_TickInterval_NPCSpawner;  // 0x04E0 (size: 0x50)

}; // Size: 0x530

struct FPalOptionAudioSettings
{
    float Master;                                                                     // 0x0000 (size: 0x4)
    float BGM;                                                                        // 0x0004 (size: 0x4)
    float SE;                                                                         // 0x0008 (size: 0x4)
    float PalVoice;                                                                   // 0x000C (size: 0x4)
    float HumanVoice;                                                                 // 0x0010 (size: 0x4)
    float Ambient;                                                                    // 0x0014 (size: 0x4)
    float UI;                                                                         // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FPalOptionCommonSettings
{
    float PalRideCameraLengthRate;                                                    // 0x0000 (size: 0x4)
    float FOV;                                                                        // 0x0004 (size: 0x4)
    bool bEnableMotionBlur;                                                           // 0x0008 (size: 0x1)
    bool bEnableCameraShake;                                                          // 0x0009 (size: 0x1)
    TArray<FHistoryServerWorld> HistoryServerWorldGUIDs;                              // 0x0010 (size: 0x10)
    float Brightness;                                                                 // 0x0020 (size: 0x4)
    bool bDisableAutoPickupItemInOverflowWeight;                                      // 0x0024 (size: 0x1)
    bool bDisableGuildJoinRequest;                                                    // 0x0025 (size: 0x1)
    bool bHideCraftExpLog;                                                            // 0x0026 (size: 0x1)
    int32 ScreenPercentage;                                                           // 0x0028 (size: 0x4)
    EPalOptionMapObjectDrawDistanceType MapObjectDrawDistanceType;                    // 0x002C (size: 0x1)
    bool bArachnophobiaMode;                                                          // 0x002D (size: 0x1)

}; // Size: 0x30

struct FPalOptionGraphicsPresetRow : public FTableRowBase
{
    EPalOptionGraphicsLevel GraphicsLevel;                                            // 0x0008 (size: 0x1)
    TEnumAsByte<EAntiAliasingMethod> AntiAliasingType;                                // 0x0009 (size: 0x1)
    int32 CommonQuality;                                                              // 0x000C (size: 0x4)
    int32 ViewDistanceQuality;                                                        // 0x0010 (size: 0x4)
    EPalOptionMapObjectDrawDistanceType MapObjectDrawDistanceType;                    // 0x0014 (size: 0x1)
    int32 FoliageQuality;                                                             // 0x0018 (size: 0x4)
    int32 ShadowQuality;                                                              // 0x001C (size: 0x4)
    int32 TextureQuality;                                                             // 0x0020 (size: 0x4)
    bool bEnableMotionBlur;                                                           // 0x0024 (size: 0x1)
    int32 ScreenPercentage;                                                           // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FPalOptionGraphicsSettings
{
    EPalOptionGraphicsLevel GraphicsLevel;                                            // 0x0000 (size: 0x1)
    TEnumAsByte<EWindowMode> WindowMode;                                              // 0x0001 (size: 0x1)
    FIntPoint ScreenResolution;                                                       // 0x0004 (size: 0x8)
    bool bEnableVSync;                                                                // 0x000C (size: 0x1)
    bool bEnableMotionBlur;                                                           // 0x000D (size: 0x1)
    TEnumAsByte<EAntiAliasingMethod> AntiAliasingType;                                // 0x000E (size: 0x1)
    bool bEnableCameraShake;                                                          // 0x000F (size: 0x1)
    bool bEnableCameraRecoil;                                                         // 0x0010 (size: 0x1)
    float FOV;                                                                        // 0x0014 (size: 0x4)
    float PalRideCameraLengthRate;                                                    // 0x0018 (size: 0x4)
    float LODBias;                                                                    // 0x001C (size: 0x4)
    float DrawDistance;                                                               // 0x0020 (size: 0x4)
    float GrassDrawDistance;                                                          // 0x0024 (size: 0x4)
    bool bEnableShadow;                                                               // 0x0028 (size: 0x1)
    float ShadowResolution;                                                           // 0x002C (size: 0x4)
    int32 CommonQuality;                                                              // 0x0030 (size: 0x4)
    int32 ViewDistanceQuality;                                                        // 0x0034 (size: 0x4)
    int32 FoliageQuality;                                                             // 0x0038 (size: 0x4)
    int32 ShadowQuality;                                                              // 0x003C (size: 0x4)
    EPalOptionMapObjectDrawDistanceType MapObjectDrawDistanceType;                    // 0x0040 (size: 0x1)
    float Brightness;                                                                 // 0x0044 (size: 0x4)
    bool bEnableAutoContrast;                                                         // 0x0048 (size: 0x1)
    int32 TextureQuality;                                                             // 0x004C (size: 0x4)
    UDLSSMode DLSSMode;                                                               // 0x0050 (size: 0x1)
    float MaxFPS;                                                                     // 0x0054 (size: 0x4)
    int32 ScreenPercentage;                                                           // 0x0058 (size: 0x4)
    bool bArachnophobiaMode;                                                          // 0x005C (size: 0x1)

}; // Size: 0x60

struct FPalOptionKeyboardSettings
{
    bool bIsDashHold;                                                                 // 0x0000 (size: 0x1)
    float MouseSensitivity;                                                           // 0x0004 (size: 0x4)
    float MouseAimSensitivity;                                                        // 0x0008 (size: 0x4)
    bool bIsReverseYaw;                                                               // 0x000C (size: 0x1)
    bool bIsReversePitch;                                                             // 0x000D (size: 0x1)
    bool bEnableAimAssist;                                                            // 0x000E (size: 0x1)
    bool bShowChat;                                                                   // 0x000F (size: 0x1)
    bool bIsToggleInteract;                                                           // 0x0010 (size: 0x1)
    bool bIsToggleBuildMode;                                                          // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FPalOptionLocalStaticSettings
{
    FPalOptionValueFloat MouseSensitivity;                                            // 0x0000 (size: 0x8)
    FPalOptionValueFloat MouseAimSensitivity;                                         // 0x0008 (size: 0x8)
    FPalOptionValueFloat LeftStickThreshold;                                          // 0x0010 (size: 0x8)
    FPalOptionValueFloat RightStickSensitivity;                                       // 0x0018 (size: 0x8)
    FPalOptionValueFloat RightStickAimSensitivity;                                    // 0x0020 (size: 0x8)
    FPalOptionValueFloat RightStickThreshold;                                         // 0x0028 (size: 0x8)
    FPalOptionValueFloat PalRideCameraLengthRate;                                     // 0x0030 (size: 0x8)
    FPalOptionValueFloat FOV;                                                         // 0x0038 (size: 0x8)
    TMap<EPalOptionMapObjectDrawDistanceType, int32> MapObjectDrawDistanceMaxMap;     // 0x0040 (size: 0x50)
    FPalOptionValueFloat DamageTextScale;                                             // 0x0090 (size: 0x8)
    FPalOptionValueFloat DamageTextMaxNum;                                            // 0x0098 (size: 0x8)
    FPalOptionValueFloat ChatUICloseDelayTime;                                        // 0x00A0 (size: 0x8)

}; // Size: 0xA8

struct FPalOptionOnlineIds
{
    FString UserId;                                                                   // 0x0000 (size: 0x10)
    FGuid PlayerUId;                                                                  // 0x0010 (size: 0x10)
    FString CachePlayerName;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPalOptionOnlineUserSettings
{
    TArray<FPalOptionOnlineIds> MuteList;                                             // 0x0000 (size: 0x10)
    TArray<FPalOptionOnlineIds> BlockList;                                            // 0x0010 (size: 0x10)
    int32 TermsOfUseAgreementNumber;                                                  // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FPalOptionPadSettings
{
    bool bIsDashHold;                                                                 // 0x0000 (size: 0x1)
    float LeftStickThreshold;                                                         // 0x0004 (size: 0x4)
    float RightStickSensitivity;                                                      // 0x0008 (size: 0x4)
    float RightStickAimSensitivity;                                                   // 0x000C (size: 0x4)
    float RightStickThreshold;                                                        // 0x0010 (size: 0x4)
    bool bIsRightStickReverseYaw;                                                     // 0x0014 (size: 0x1)
    bool bIsRightStickReversePitch;                                                   // 0x0015 (size: 0x1)
    bool bEnableVibration;                                                            // 0x0016 (size: 0x1)
    bool bEnableAimAssist;                                                            // 0x0017 (size: 0x1)
    bool bIsToggleInteract;                                                           // 0x0018 (size: 0x1)
    bool bIsToggleBuildMode;                                                          // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FPalOptionSaveData
{
    FPalOptionKeyboardSettings KeyboardSettings;                                      // 0x0000 (size: 0x14)
    FPalOptionPadSettings PadSettings;                                                // 0x0014 (size: 0x1C)
    FPalKeyConfigSettings KeyConfigSettings;                                          // 0x0030 (size: 0x160)
    FPalOptionUISettings UISettings;                                                  // 0x0190 (size: 0x1C)
    FPalOptionOnlineUserSettings OnlineUserSettings;                                  // 0x01B0 (size: 0x28)
    FPalOptionCommonSettings CommonSettings;                                          // 0x01D8 (size: 0x30)
    FPalOptionGraphicsSettings GraphicsSettings;                                      // 0x0208 (size: 0x60)
    FPalOptionAudioSettings AudioSettings;                                            // 0x0268 (size: 0x1C)
    bool bHasAppliedUserSetting;                                                      // 0x0284 (size: 0x1)

}; // Size: 0x288

struct FPalOptionUISettings
{
    float DamageTextScale;                                                            // 0x0000 (size: 0x4)
    int32 DamageTextMaxNum;                                                           // 0x0004 (size: 0x4)
    int32 ReticleColorIndex;                                                          // 0x0008 (size: 0x4)
    float ReticleOutlineOpacity;                                                      // 0x000C (size: 0x4)
    float ChatUICloseDelayTime;                                                       // 0x0010 (size: 0x4)
    int32 MinFontSize;                                                                // 0x0014 (size: 0x4)
    bool bHideUIWhenNotInBattle;                                                      // 0x0018 (size: 0x1)
    bool bCompletedGlobapPalboxTutotial;                                              // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FPalOptionValueFloat
{
    float Min;                                                                        // 0x0000 (size: 0x4)
    float Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalOptionValueInt
{
    int32 Min;                                                                        // 0x0000 (size: 0x4)
    int32 Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPalOptionWorldModePresetRow : public FTableRowBase
{
    EPalOptionWorldMode WorldMode;                                                    // 0x0008 (size: 0x1)
    bool bEnablePlayerToPlayerDamage;                                                 // 0x0009 (size: 0x1)
    bool bCanPickupOtherGuildDeathPenaltyDrop;                                        // 0x000A (size: 0x1)
    bool bEnableNonLoginPenalty;                                                      // 0x000B (size: 0x1)
    bool bIsStartLocationSelectByMap;                                                 // 0x000C (size: 0x1)
    bool bExistPlayerAfterLogout;                                                     // 0x000D (size: 0x1)
    bool bEnableDefenseOtherGuildPlayer;                                              // 0x000E (size: 0x1)

}; // Size: 0x10

struct FPalOptionWorldPresetRow : public FTableRowBase
{
    EPalOptionWorldDifficulty Diffculty;                                              // 0x0008 (size: 0x1)
    EPalRandomizerType RandomizerType;                                                // 0x0009 (size: 0x1)
    float DayTimeSpeedRate;                                                           // 0x000C (size: 0x4)
    float NightTimeSpeedRate;                                                         // 0x0010 (size: 0x4)
    float ExpRate;                                                                    // 0x0014 (size: 0x4)
    float PalCaptureRate;                                                             // 0x0018 (size: 0x4)
    float PalSpawnNumRate;                                                            // 0x001C (size: 0x4)
    float PalDamageRateAttack;                                                        // 0x0020 (size: 0x4)
    float PalDamageRateDefense;                                                       // 0x0024 (size: 0x4)
    float PlayerDamageRateAttack;                                                     // 0x0028 (size: 0x4)
    float PlayerDamageRateDefense;                                                    // 0x002C (size: 0x4)
    float PlayerStomachDecreaceRate;                                                  // 0x0030 (size: 0x4)
    float PlayerStaminaDecreaceRate;                                                  // 0x0034 (size: 0x4)
    float PlayerAutoHPRegeneRate;                                                     // 0x0038 (size: 0x4)
    float PlayerAutoHpRegeneRateInSleep;                                              // 0x003C (size: 0x4)
    float PalStomachDecreaceRate;                                                     // 0x0040 (size: 0x4)
    float PalStaminaDecreaceRate;                                                     // 0x0044 (size: 0x4)
    float PalAutoHPRegeneRate;                                                        // 0x0048 (size: 0x4)
    float PalAutoHpRegeneRateInSleep;                                                 // 0x004C (size: 0x4)
    float BuildObjectHpRate;                                                          // 0x0050 (size: 0x4)
    float BuildObjectDamageRate;                                                      // 0x0054 (size: 0x4)
    float BuildObjectDeteriorationDamageRate;                                         // 0x0058 (size: 0x4)
    float CollectionDropRate;                                                         // 0x005C (size: 0x4)
    float CollectionObjectHpRate;                                                     // 0x0060 (size: 0x4)
    float CollectionObjectRespawnSpeedRate;                                           // 0x0064 (size: 0x4)
    float EnemyDropItemRate;                                                          // 0x0068 (size: 0x4)
    EPalOptionWorldDeathPenalty DeathPenalty;                                         // 0x006C (size: 0x1)
    bool bActiveUNKO;                                                                 // 0x006D (size: 0x1)
    int32 DropItemMaxNum_UNKO;                                                        // 0x0070 (size: 0x4)
    bool bEnableInvaderEnemy;                                                         // 0x0074 (size: 0x1)
    int32 DropItemMaxNum;                                                             // 0x0078 (size: 0x4)
    bool bAutoResetGuildNoOnlinePlayers;                                              // 0x007C (size: 0x1)
    float AutoResetGuildTimeNoOnlinePlayers;                                          // 0x0080 (size: 0x4)
    int32 GuildPlayerMaxNum;                                                          // 0x0084 (size: 0x4)
    float PalEggDefaultHatchingTime;                                                  // 0x0088 (size: 0x4)
    int32 BaseCampWorkerMaxNum;                                                       // 0x008C (size: 0x4)
    int32 SupplyDropSpan;                                                             // 0x0090 (size: 0x4)
    bool bHardcore;                                                                   // 0x0094 (size: 0x1)
    bool bPalLost;                                                                    // 0x0095 (size: 0x1)
    bool bAllowGlobalPalboxExport;                                                    // 0x0096 (size: 0x1)
    bool bAllowGlobalPalboxImport;                                                    // 0x0097 (size: 0x1)

}; // Size: 0x98

struct FPalOptionWorldSaveData
{
    FPalOptionWorldSettings Settings;                                                 // 0x0000 (size: 0x1A0)

}; // Size: 0x1A0

struct FPalOptionWorldSettinThresholds
{
    TMap<EPalSupportedPlatformType, int32> BaseCampMaxNumInGuild;                     // 0x0000 (size: 0x50)
    TMap<EPalSupportedPlatformType, int32> BaseCampWorkerMaxNum;                      // 0x0050 (size: 0x50)
    TMap<EPalSupportedPlatformType, int32> MaxBuildingLimitNum;                       // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FPalOptionWorldSettings
{
    EPalOptionWorldDifficulty Difficulty;                                             // 0x0000 (size: 0x1)
    EPalRandomizerType RandomizerType;                                                // 0x0001 (size: 0x1)
    FString RandomizerSeed;                                                           // 0x0008 (size: 0x10)
    bool bIsRandomizerPalLevelRandom;                                                 // 0x0018 (size: 0x1)
    float DayTimeSpeedRate;                                                           // 0x001C (size: 0x4)
    float NightTimeSpeedRate;                                                         // 0x0020 (size: 0x4)
    float ExpRate;                                                                    // 0x0024 (size: 0x4)
    float PalCaptureRate;                                                             // 0x0028 (size: 0x4)
    float PalSpawnNumRate;                                                            // 0x002C (size: 0x4)
    float PalDamageRateAttack;                                                        // 0x0030 (size: 0x4)
    float PalDamageRateDefense;                                                       // 0x0034 (size: 0x4)
    float PlayerDamageRateAttack;                                                     // 0x0038 (size: 0x4)
    float PlayerDamageRateDefense;                                                    // 0x003C (size: 0x4)
    float PlayerStomachDecreaceRate;                                                  // 0x0040 (size: 0x4)
    float PlayerStaminaDecreaceRate;                                                  // 0x0044 (size: 0x4)
    float PlayerAutoHPRegeneRate;                                                     // 0x0048 (size: 0x4)
    float PlayerAutoHpRegeneRateInSleep;                                              // 0x004C (size: 0x4)
    float PalStomachDecreaceRate;                                                     // 0x0050 (size: 0x4)
    float PalStaminaDecreaceRate;                                                     // 0x0054 (size: 0x4)
    float PalAutoHPRegeneRate;                                                        // 0x0058 (size: 0x4)
    float PalAutoHpRegeneRateInSleep;                                                 // 0x005C (size: 0x4)
    float BuildObjectHpRate;                                                          // 0x0060 (size: 0x4)
    float BuildObjectDamageRate;                                                      // 0x0064 (size: 0x4)
    float BuildObjectDeteriorationDamageRate;                                         // 0x0068 (size: 0x4)
    float CollectionDropRate;                                                         // 0x006C (size: 0x4)
    float CollectionObjectHpRate;                                                     // 0x0070 (size: 0x4)
    float CollectionObjectRespawnSpeedRate;                                           // 0x0074 (size: 0x4)
    float EnemyDropItemRate;                                                          // 0x0078 (size: 0x4)
    EPalOptionWorldDeathPenalty DeathPenalty;                                         // 0x007C (size: 0x1)
    bool bEnablePlayerToPlayerDamage;                                                 // 0x007D (size: 0x1)
    bool bEnableFriendlyFire;                                                         // 0x007E (size: 0x1)
    bool bEnableInvaderEnemy;                                                         // 0x007F (size: 0x1)
    bool bActiveUNKO;                                                                 // 0x0080 (size: 0x1)
    bool bEnableAimAssistPad;                                                         // 0x0081 (size: 0x1)
    bool bEnableAimAssistKeyboard;                                                    // 0x0082 (size: 0x1)
    int32 DropItemMaxNum;                                                             // 0x0084 (size: 0x4)
    int32 DropItemMaxNum_UNKO;                                                        // 0x0088 (size: 0x4)
    int32 BaseCampMaxNum;                                                             // 0x008C (size: 0x4)
    int32 BaseCampWorkerMaxNum;                                                       // 0x0090 (size: 0x4)
    float DropItemAliveMaxHours;                                                      // 0x0094 (size: 0x4)
    bool bAutoResetGuildNoOnlinePlayers;                                              // 0x0098 (size: 0x1)
    float AutoResetGuildTimeNoOnlinePlayers;                                          // 0x009C (size: 0x4)
    int32 GuildPlayerMaxNum;                                                          // 0x00A0 (size: 0x4)
    int32 BaseCampMaxNumInGuild;                                                      // 0x00A4 (size: 0x4)
    float PalEggDefaultHatchingTime;                                                  // 0x00A8 (size: 0x4)
    float WorkSpeedRate;                                                              // 0x00AC (size: 0x4)
    float autoSaveSpan;                                                               // 0x00B0 (size: 0x4)
    bool bIsMultiplay;                                                                // 0x00B4 (size: 0x1)
    bool bIsPvP;                                                                      // 0x00B5 (size: 0x1)
    bool bHardcore;                                                                   // 0x00B6 (size: 0x1)
    bool bPalLost;                                                                    // 0x00B7 (size: 0x1)
    bool bCharacterRecreateInHardcore;                                                // 0x00B8 (size: 0x1)
    bool bCanPickupOtherGuildDeathPenaltyDrop;                                        // 0x00B9 (size: 0x1)
    bool bEnableNonLoginPenalty;                                                      // 0x00BA (size: 0x1)
    bool bEnableFastTravel;                                                           // 0x00BB (size: 0x1)
    bool bIsStartLocationSelectByMap;                                                 // 0x00BC (size: 0x1)
    bool bExistPlayerAfterLogout;                                                     // 0x00BD (size: 0x1)
    bool bEnableDefenseOtherGuildPlayer;                                              // 0x00BE (size: 0x1)
    bool bInvisibleOtherGuildBaseCampAreaFX;                                          // 0x00BF (size: 0x1)
    bool bBuildAreaLimit;                                                             // 0x00C0 (size: 0x1)
    float ItemWeightRate;                                                             // 0x00C4 (size: 0x4)
    int32 CoopPlayerMaxNum;                                                           // 0x00C8 (size: 0x4)
    int32 ServerPlayerMaxNum;                                                         // 0x00CC (size: 0x4)
    FString ServerName;                                                               // 0x00D0 (size: 0x10)
    FString ServerDescription;                                                        // 0x00E0 (size: 0x10)
    FString AdminPassword;                                                            // 0x00F0 (size: 0x10)
    FString ServerPassword;                                                           // 0x0100 (size: 0x10)
    int32 PublicPort;                                                                 // 0x0110 (size: 0x4)
    FString PublicIP;                                                                 // 0x0118 (size: 0x10)
    bool RCONEnabled;                                                                 // 0x0128 (size: 0x1)
    int32 RCONPort;                                                                   // 0x012C (size: 0x4)
    FString Region;                                                                   // 0x0130 (size: 0x10)
    bool bUseAuth;                                                                    // 0x0140 (size: 0x1)
    FString BanListURL;                                                               // 0x0148 (size: 0x10)
    bool RESTAPIEnabled;                                                              // 0x0158 (size: 0x1)
    int32 RESTAPIPort;                                                                // 0x015C (size: 0x4)
    bool bShowPlayerList;                                                             // 0x0160 (size: 0x1)
    int32 ChatPostLimitPerMinute;                                                     // 0x0164 (size: 0x4)
    TArray<EPalAllowConnectPlatform> CrossplayPlatforms;                              // 0x0168 (size: 0x10)
    bool bIsUseBackupSaveData;                                                        // 0x0178 (size: 0x1)
    EPalLogFormatType LogFormatType;                                                  // 0x0179 (size: 0x1)
    bool bIsShowJoinLeftMessage;                                                      // 0x017A (size: 0x1)
    int32 SupplyDropSpan;                                                             // 0x017C (size: 0x4)
    bool EnablePredatorBossPal;                                                       // 0x0180 (size: 0x1)
    int32 MaxBuildingLimitNum;                                                        // 0x0184 (size: 0x4)
    float ServerReplicatePawnCullDistance;                                            // 0x0188 (size: 0x4)
    bool bAllowGlobalPalboxExport;                                                    // 0x018C (size: 0x1)
    bool bAllowGlobalPalboxImport;                                                    // 0x018D (size: 0x1)
    float EquipmentDurabilityDamageRate;                                              // 0x0190 (size: 0x4)
    float ItemContainerForceMarkDirtyInterval;                                        // 0x0194 (size: 0x4)
    float ItemCorruptionMultiplier;                                                   // 0x0198 (size: 0x4)
    bool bIsForceEnableRandomizerPalLevelRandom_ForUI;                                // 0x019C (size: 0x1)

}; // Size: 0x1A0

struct FPalOptionWorldStaticSettings
{
    FPalOptionValueFloat DayTimeSpeedRate;                                            // 0x0000 (size: 0x8)
    FPalOptionValueFloat NightTimeSpeedRate;                                          // 0x0008 (size: 0x8)
    FPalOptionValueFloat ExpRate;                                                     // 0x0010 (size: 0x8)
    FPalOptionValueFloat PalCaptureRate;                                              // 0x0018 (size: 0x8)
    FPalOptionValueFloat PalSpawnNumRate;                                             // 0x0020 (size: 0x8)
    FPalOptionValueFloat PalDamageRateAttack;                                         // 0x0028 (size: 0x8)
    FPalOptionValueFloat PalDamageRateDefense;                                        // 0x0030 (size: 0x8)
    FPalOptionValueFloat PlayerDamageRateAttack;                                      // 0x0038 (size: 0x8)
    FPalOptionValueFloat PlayerDamageRateDefense;                                     // 0x0040 (size: 0x8)
    FPalOptionValueFloat PlayerStomachDecreaceRate;                                   // 0x0048 (size: 0x8)
    FPalOptionValueFloat PlayerStaminaDecreaceRate;                                   // 0x0050 (size: 0x8)
    FPalOptionValueFloat PlayerAutoHPRegeneRate;                                      // 0x0058 (size: 0x8)
    FPalOptionValueFloat PlayerAutoHpRegeneRateInSleep;                               // 0x0060 (size: 0x8)
    FPalOptionValueFloat PalStomachDecreaceRate;                                      // 0x0068 (size: 0x8)
    FPalOptionValueFloat PalStaminaDecreaceRate;                                      // 0x0070 (size: 0x8)
    FPalOptionValueFloat PalAutoHPRegeneRate;                                         // 0x0078 (size: 0x8)
    FPalOptionValueFloat PalAutoHpRegeneRateInSleep;                                  // 0x0080 (size: 0x8)
    FPalOptionValueFloat BuildObjectHpRate;                                           // 0x0088 (size: 0x8)
    FPalOptionValueFloat BuildObjectDamageRate;                                       // 0x0090 (size: 0x8)
    FPalOptionValueFloat BuildObjectDeteriorationDamageRate;                          // 0x0098 (size: 0x8)
    FPalOptionValueFloat CollectionDropRate;                                          // 0x00A0 (size: 0x8)
    FPalOptionValueFloat CollectionObjectHpRate;                                      // 0x00A8 (size: 0x8)
    FPalOptionValueFloat CollectionObjectRespawnSpeedRate;                            // 0x00B0 (size: 0x8)
    FPalOptionValueFloat EnemyDropItemRate;                                           // 0x00B8 (size: 0x8)
    FPalOptionValueInt DropItemMaxNum;                                                // 0x00C0 (size: 0x8)
    FPalOptionValueInt DropItemMaxNum_UNKO;                                           // 0x00C8 (size: 0x8)
    FPalOptionValueFloat WorkSpeedRate;                                               // 0x00D0 (size: 0x8)
    FPalOptionValueInt AutoResetGuildTimeNoOnlinePlayers;                             // 0x00D8 (size: 0x8)
    FPalOptionValueInt GuildPlayerMaxNum;                                             // 0x00E0 (size: 0x8)
    FPalOptionValueInt BaseCampMaxNumInGuild;                                         // 0x00E8 (size: 0x8)
    FPalOptionValueInt PalEggDefaultHatchingTime;                                     // 0x00F0 (size: 0x8)
    FPalOptionValueInt BaseCampWorkerMaxNum;                                          // 0x00F8 (size: 0x8)
    FPalOptionValueInt autoSaveSpan;                                                  // 0x0100 (size: 0x8)
    FPalOptionValueInt SupplyDropSpan;                                                // 0x0108 (size: 0x8)
    FPalOptionValueFloat ItemWeightRate;                                              // 0x0110 (size: 0x8)
    TMap<EPalBuildingLimitType, int32> BuildingLimitType;                             // 0x0118 (size: 0x50)
    FPalOptionValueFloat ServerReplicatePawnCullDistance;                             // 0x0168 (size: 0x8)
    FPalOptionValueFloat EquipmentDurabilityDamageRate;                               // 0x0170 (size: 0x8)
    FPalOptionValueFloat ItemCorruptionMultiplier;                                    // 0x0178 (size: 0x8)

}; // Size: 0x180

struct FPalOrderedQuestSaveData
{
